hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/*
   This file has been generated by IDA.
   It contains local type definitions from
   the type library 'prod_test_531.axf'
*/

#define __int8 char
#define __int16 short
#define __int32 int
#define __int64 long long

struct bd_addr;
struct co_list_hdr;
struct hci_cmd_desc_tag;
struct prf_env;

/* 2 */
typedef unsigned __int16 uint16_t;

/* 3 */
typedef unsigned __int8 uint8_t;

/* 1 */
struct nvds_data_struct
{
  uint16_t lpclk_drift;
  uint8_t bd_address[6];
  uint16_t ble_ca_timer_dur;
  uint8_t ble_cra_timer_dur;
  uint8_t ble_ca_min_rssi;
  uint8_t ble_ca_nb_pkt;
  uint8_t ble_ca_nb_bad_pkt;
};

/* 4 */
struct rom_nvds_cfg_t
{
  const nvds_data_struct *nvds_data_storage;
  bd_addr *dev_bdaddr;
};

/* 5 */
struct bd_addr
{
  uint8_t addr[6];
};

/* 6 */
typedef uint8_t nvds_tag_len_t;

/* 7 */
enum NVDS_STATUS : __int8
{
  NVDS_OK = 0x0,
  NVDS_FAIL = 0x1,
  NVDS_TAG_NOT_DEFINED = 0x2,
  NVDS_NO_SPACE_AVAILABLE = 0x3,
  NVDS_LENGTH_OUT_OF_RANGE = 0x4,
  NVDS_PARAM_LOCKED = 0x5,
  NVDS_CORRUPT = 0x6,
};

/* 8 */
enum NVDS_TAG : __int8
{
  NVDS_TAG_BD_ADDRESS = 0x1,
  NVDS_TAG_DEVICE_NAME = 0x2,
  NVDS_TAG_LPCLK_DRIFT = 0x7,
  NVDS_TAG_LPCLK_JITTER = 0x8,
  NVDS_TAG_RADIO_CLASS = 0x9,
  NVDS_TAG_BJ_TXCNTL1 = 0xA,
  NVDS_TAG_APP_BLE_ADV_DATA = 0xB,
  NVDS_TAG_APP_BLE_SCAN_RESP_DATA = 0xC,
  NVDS_TAG_EXT_WAKEUP_TIME = 0xD,
  NVDS_TAG_OSC_WAKEUP_TIME = 0xE,
  NVDS_TAG_RM_WAKEUP_TIME = 0xF,
  NVDS_TAG_UART_BAUDRATE = 0x10,
  NVDS_TAG_SLEEP_ENABLE = 0x11,
  NVDS_TAG_EXT_WAKEUP_ENABLE = 0x12,
  NVDS_TAG_SP_PRIVATE_KEY = 0x13,
  NVDS_TAG_SP_PUBLIC_KEY = 0x14,
  NVDS_TAG_ERRATA_ADOPTED = 0x15,
  NVDS_TAG_BASIC_THRESHOLD = 0x16,
  NVDS_TAG_EDR_THRESHOLD = 0x17,
  NVDS_TAG_BASIC_ALGORITHM = 0x18,
  NVDS_TAG_EDR_ALGORITHM = 0x19,
  NVDS_TAG_BASIC_PACKET_LUT = 0x2A,
  NVDS_TAG_EDR_PACKET_LUT = 0x2B,
  NVDS_TAG_SYNC_CONFIG = 0x2C,
  NVDS_TAG_PCM_SETTINGS = 0x2D,
  NVDS_TAG_HCI_SYNC_BUF_SIZE = 0x2E,
  NVDS_TAG_DIAG_BT_HW = 0x30,
  NVDS_TAG_DIAG_BLE_HW = 0x31,
  NVDS_TAG_DIAG_SW = 0x32,
  NVDS_TAG_DIAG_PLF = 0x34,
  NVDS_TAG_MOUSE_SAMPLE_RATE = 0x38,
  NVDS_TAG_PERIPH_BONDED = 0x39,
  NVDS_TAG_MOUSE_NTF_CFG = 0x3A,
  NVDS_TAG_MOUSE_TIMEOUT = 0x3B,
  NVDS_TAG_PEER_BD_ADDRESS = 0x3C,
  NVDS_TAG_MOUSE_ENERGY_SAFE = 0x3D,
  NVDS_TAG_LTK = 0x3E,
  NVDS_TAG_PAIRING = 0x3F,
  NVDS_TAG_BLE_CA_TIMER_DUR = 0x40,
  NVDS_TAG_BLE_CRA_TIMER_DUR = 0x41,
  NVDS_TAG_BLE_CA_MIN_RSSI = 0x42,
  NVDS_TAG_BLE_CA_NB_PKT = 0x43,
  NVDS_TAG_BLE_CA_NB_BAD_PKT = 0x44,
  NVDS_TAG_AFH_REASS_NBCH = 0x51,
  NVDS_TAG_AFH_WINLGTH = 0x52,
  NVDS_TAG_AFH_RSSIMIN = 0x53,
  NVDS_TAG_AFH_PERTHRESBAD = 0x54,
  NVDS_TAG_AFH_REASS_INT = 0x55,
  NVDS_TAG_AFH_NMIN = 0x56,
  NVDS_TAG_AFH_MAXADAPT = 0x57,
  NVDS_TAG_AFH_THSMIN = 0x58,
  NVDS_TAG_BT_LINK_KEY_FIRST = 0x60,
  NVDS_TAG_BT_LINK_KEY_LAST = 0x67,
  NVDS_TAG_BLE_LINK_KEY_FIRST = 0x70,
  NVDS_TAG_BLE_LINK_KEY_LAST = 0x7F,
};

/* 9 */
enum NVDS_LEN : __int8
{
  NVDS_LEN_BD_ADDRESS = 0x6,
  NVDS_LEN_DEVICE_NAME = 0xF8,
  NVDS_LEN_LPCLK_DRIFT = 0x2,
  NVDS_LEN_LPCLK_JITTER = 0x1,
  NVDS_LEN_RADIO_CLASS = 0x1,
  NVDS_LEN_BJ_TXCNTL1 = 0x4,
  NVDS_LEN_APP_BLE_ADV_DATA = 0x20,
  NVDS_LEN_APP_BLE_SCAN_RESP_DATA = 0x20,
  NVDS_LEN_EXT_WAKEUP_TIME = 0x2,
  NVDS_LEN_OSC_WAKEUP_TIME = 0x2,
  NVDS_LEN_RM_WAKEUP_TIME = 0x2,
  NVDS_LEN_UART_BAUDRATE = 0x4,
  NVDS_LEN_SLEEP_ENABLE = 0x1,
  NVDS_LEN_EXT_WAKEUP_ENABLE = 0x1,
  NVDS_LEN_SP_PRIVATE_KEY = 0x18,
  NVDS_LEN_SP_PUBLIC_KEY = 0x30,
  NVDS_LEN_ERRATA_ADOPTED = 0x1,
  NVDS_LEN_BASIC_THRESHOLD = 0x46,
  NVDS_LEN_EDR_THRESHOLD = 0x46,
  NVDS_LEN_BASIC_ALGORITHM = 0x15,
  NVDS_LEN_EDR_ALGORITHM = 0x15,
  NVDS_LEN_BASIC_PACKET_LUT = 0x10,
  NVDS_LEN_EDR_PACKET_LUT = 0x10,
  NVDS_LEN_SYNC_CONFIG = 0x2,
  NVDS_LEN_PCM_SETTINGS = 0x4,
  NVDS_LEN_HCI_SYNC_BUF_SIZE = 0x1,
  NVDS_LEN_DIAG_BT_HW = 0x4,
  NVDS_LEN_DIAG_BLE_HW = 0x4,
  NVDS_LEN_DIAG_SW = 0x4,
  NVDS_LEN_DIAG_PLF = 0x4,
  NVDS_LEN_MOUSE_SAMPLE_RATE = 0x1,
  NVDS_LEN_PERIPH_BONDED = 0x1,
  NVDS_LEN_MOUSE_NTF_CFG = 0x2,
  NVDS_LEN_MOUSE_TIMEOUT = 0x2,
  NVDS_LEN_PEER_BD_ADDRESS = 0x7,
  NVDS_LEN_MOUSE_SAFE_ENERGY = 0x2,
  NVDS_LEN_LTK = 0x1C,
  NVDS_LEN_PAIRING = 0x36,
  NVDS_LEN_BLE_CA_TIMER_DUR = 0x2,
  NVDS_LEN_BLE_CRA_TIMER_DUR = 0x1,
  NVDS_LEN_BLE_CA_MIN_RSSI = 0x1,
  NVDS_LEN_BLE_CA_NB_PKT = 0x1,
  NVDS_LEN_BLE_CA_NB_BAD_PKT = 0x1,
  NVDS_LEN_AFH_REASS_NBCH = 0x1,
  NVDS_LEN_AFH_WINLGTH = 0x1,
  NVDS_LEN_AFH_RSSIMIN = 0x1,
  NVDS_LEN_AFH_PERTHRESBAD = 0x1,
  NVDS_LEN_AFH_REASS_INT = 0x1,
  NVDS_LEN_AFH_NMIN = 0x1,
  NVDS_LEN_AFH_MAXADAPT = 0x1,
  NVDS_LEN_AFH_THSMIN = 0x1,
  NVDS_LEN_BT_LINK_KEY = 0x16,
  NVDS_LEN_BLE_LINK_KEY = 0x30,
};

/* 10 */
enum $64EF1C0260FDB43DDD46CEE588C0655A : __int8
{
  TX_PW_LVL_CURRENT = 0x0,
  TX_PW_LVL_MAX = 0x1,
  TX_PW_LVL_END = 0x2,
};

/* 11 */
enum $11C0AA21CEFD687ED13822AF5210ECB5 : __int8
{
  FLOW_CTRL_OFF = 0x0,
  FLOW_CTRL_ON_ACL_OFF_SYNC = 0x1,
  FLOW_CTRL_OFF_ACL_ON_SYNC = 0x2,
  FLOW_CTRL_ON_ACL_ON_SYNC = 0x3,
  FLOW_CTRL_END = 0x4,
};

/* 12 */
enum $93D2BF4121A0F734D8A01F49598EA0D3 : __int8
{
  LE_SUPP_HOST_DIS = 0x0,
  LE_SUPP_HOST_EN = 0x1,
  LE_SUPP_HOST_END = 0x2,
};

/* 13 */
enum $83EC13F8298927C5041B2CF98C5DFF9F : __int8
{
  SIMULT_LE_HOST_DIS = 0x0,
  SIMULT_LE_HOST_EN = 0x1,
  SIMULT_LE_HOST_END = 0x2,
};

/* 14 */
enum $7970F4CA1DC8F5BFE7C3BEC2A8A2C17F : __int8
{
  ADV_CONN_UNDIR = 0x0,
  ADV_CONN_DIR = 0x1,
  ADV_DISC_UNDIR = 0x2,
  ADV_NONCONN_UNDIR = 0x3,
  ADV_CONN_DIR_LDC = 0x4,
  ADV_END = 0x5,
};

/* 15 */
enum $61366D9583798F6C1ADCFA5B331F8744 : __int8
{
  SCAN_REQ = 0x0,
  SCAN_RSP = 0x1,
  SCAN_LEN = 0x2,
};

/* 16 */
enum $453C94C73C4D578963A7C0FC08097F30 : __int8
{
  ADDR_PUBLIC = 0x0,
  ADDR_RAND = 0x1,
  ADDR_RPA_PUBLIC = 0x2,
  ADDR_RPA_RAND = 0x3,
  ADDR_END = 0x4,
};

/* 17 */
enum adv_channel_map : __int8
{
  ADV_CHNL_37_EN = 0x1,
  ADV_CHNL_38_EN = 0x2,
  ADV_CHNL_39_EN = 0x4,
  ADV_ALL_CHNLS_EN = 0x7,
  ADV_CHNL_END = 0x8,
};

/* 18 */
enum adv_filter_policy : __int8
{
  ADV_ALLOW_SCAN_ANY_CON_ANY = 0x0,
  ADV_ALLOW_SCAN_WLST_CON_ANY = 0x1,
  ADV_ALLOW_SCAN_ANY_CON_WLST = 0x2,
  ADV_ALLOW_SCAN_WLST_CON_WLST = 0x3,
  ADV_ALLOW_SCAN_END = 0x4,
};

/* 19 */
enum $2535413AEA402B4580644B2DD1A3E949 : __int8
{
  ADV_DIS = 0x0,
  ADV_EN = 0x1,
  ADV_EN_END = 0x2,
};

/* 20 */
enum $7DFC3423E6C6A13FF1D598E37E62ACCE : __int8
{
  SCAN_PASSIVE = 0x0,
  SCAN_ACTIVE = 0x1,
  SCAN_END = 0x2,
};

