hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 21 */
enum scan_filter_policy : __int8
{
  SCAN_ALLOW_ADV_ALL = 0x0,
  SCAN_ALLOW_ADV_WLST = 0x1,
  SCAN_ALLOW_ADV_ALL_RPA = 0x2,
  SCAN_ALLOW_ADV_WLST_RPA = 0x3,
  SCAN_ALLOW_ADV_END = 0x4,
};

/* 22 */
enum $A59E6CEF3B1453262DEF5E6C12BD82BD : __int8
{
  SCAN_DIS = 0x0,
  SCAN_EN = 0x1,
  SCAN_EN_END = 0x2,
};

/* 23 */
enum scan_dup_filter_policy : __int8
{
  SCAN_FILT_DUPLIC_DIS = 0x0,
  SCAN_FILT_DUPLIC_EN = 0x1,
  SCAN_FILT_DUPLIC_END = 0x2,
};

/* 24 */
enum $F196B912D6572A3555380DE2B2BE7CF5 : __int8
{
  INIT_FILT_IGNORE_WLST = 0x0,
  INIT_FILT_USE_WLST = 0x1,
  INIT_FILT_END = 0x2,
};

/* 25 */
enum $DBB45BCB4AF23B14A9E531AE384B56F8 : __int8
{
  PAYL_PSEUDO_RAND_9 = 0x0,
  PAYL_11110000 = 0x1,
  PAYL_10101010 = 0x2,
  PAYL_PSEUDO_RAND_15 = 0x3,
  PAYL_ALL_1 = 0x4,
  PAYL_ALL_0 = 0x5,
  PAYL_00001111 = 0x6,
  PAYL_01010101 = 0x7,
  PAYL_END = 0x8,
};

/* 26 */
enum $783CAD725BF63869D68CC644E0755292 : __int8
{
  ROLE_MASTER = 0x0,
  ROLE_SLAVE = 0x1,
  ROLE_END = 0x2,
};

/* 27 */
enum $1833033FF6D14D5E30ACDDB1606BC44A : __int8
{
  SCA_500PPM = 0x0,
  SCA_250PPM = 0x1,
  SCA_150PPM = 0x2,
  SCA_100PPM = 0x3,
  SCA_75PPM = 0x4,
  SCA_50PPM = 0x5,
  SCA_30PPM = 0x6,
  SCA_20PPM = 0x7,
};

/* 28 */
enum $3E4099CCF2729DDD1E92E93DA0A586DD : __int8
{
  FC_OFF = 0x0,
  FC_DATA_ON_SYNC_OFF = 0x1,
  FC_DATA_OFF_SYNC_ON = 0x2,
  FC_ON = 0x3,
};

/* 29 */
enum $51E876DBC243058FBD56724422499162 : __int8
{
  LL_ADV_CONN_UNDIR = 0x0,
  LL_ADV_CONN_DIR = 0x1,
  LL_ADV_NONCONN_UNDIR = 0x2,
  LL_SCAN_REQ = 0x3,
  LL_SCAN_RSP = 0x4,
  LL_CONNECT_REQ = 0x5,
  LL_ADV_DISC_UNDIR = 0x6,
  LL_ADV_END = 0x7,
};

/* 30 */
enum $121221939EC782E091E501271BA80649 : __int8
{
  LL_CONNECTION_UPDATE_REQ = 0x0,
  LL_CHANNEL_MAP_REQ = 0x1,
  LL_TERMINATE_IND = 0x2,
  LL_ENC_REQ = 0x3,
  LL_ENC_RSP = 0x4,
  LL_START_ENC_REQ = 0x5,
  LL_START_ENC_RSP = 0x6,
  LL_UNKNOWN_RSP = 0x7,
  LL_FEATURE_REQ = 0x8,
  LL_FEATURE_RSP = 0x9,
  LL_PAUSE_ENC_REQ = 0xA,
  LL_PAUSE_ENC_RSP = 0xB,
  LL_VERSION_IND = 0xC,
  LL_REJECT_IND = 0xD,
  LL_SLAVE_FEATURE_REQ = 0xE,
  LL_CONNECTION_PARAM_REQ = 0xF,
  LL_CONNECTION_PARAM_RSP = 0x10,
  LL_REJECT_IND_EXT = 0x11,
  LL_PING_REQ = 0x12,
  LL_PING_RSP = 0x13,
  LL_LENGTH_REQ = 0x14,
  LL_LENGTH_RSP = 0x15,
  LL_OPCODE_MAX = 0x16,
  LL_IDLE = 0x17,
};

/* 31 */
enum $45E9BD372BD7ED53FECFC5963DDFB6EE : __int8
{
  LLID_RFU = 0x0,
  LLID_CONTINUE = 0x1,
  LLID_START = 0x2,
  LLID_CNTL = 0x3,
  LLID_END = 0x4,
};

/* 32 */
struct bd_name
{
  uint8_t namelen;
  uint8_t name[248];
};

/* 33 */
struct device_name
{
  uint8_t name[248];
};

/* 34 */
struct name_vect
{
  uint8_t vect[14];
};

/* 35 */
struct lap
{
  uint8_t A[3];
};

/* 36 */
struct devclass
{
  uint8_t A[3];
};

/* 37 */
struct eir
{
  uint8_t data[240];
};

/* 38 */
struct evt_mask
{
  uint8_t mask[8];
};

/* 39 */
struct host_cmpl_pkts
{
  uint16_t con_hdl;
  uint16_t nb_cmpl_pkts;
};

/* 40 */
struct access_addr
{
  uint8_t addr[4];
};

/* 41 */
struct adv_data
{
  uint8_t data[31];
};

/* 42 */
struct scan_rsp_data
{
  uint8_t data[31];
};

/* 43 */
struct chnl_map
{
  uint8_t map[10];
};

/* 44 */
struct le_chnl_map
{
  uint8_t map[5];
};

/* 45 */
struct ltk
{
  uint8_t ltk[16];
};

/* 46 */
struct bd_addr_plus_key
{
  bd_addr bd_addr;
  ltk link_key;
};

/* 47 */
struct rand_nb
{
  uint8_t nb[8];
};

/* 48 */
struct adv_report
{
  uint8_t evt_type;
  uint8_t adv_addr_type;
  bd_addr adv_addr;
  uint8_t data_len;
  uint8_t data[31];
  uint8_t rssi;
};

/* 49 */
struct direct_adv_report
{
  uint8_t evt_type;
  uint8_t adv_addr_type;
  bd_addr adv_addr;
  uint8_t direct_adv_addr_type;
  bd_addr direct_adv_addr;
  uint8_t rssi;
};

/* 50 */
struct le_features
{
  uint8_t feats[8];
};

/* 51 */
struct hash
{
  uint8_t C[16];
};

/* 52 */
struct randomizer
{
  uint8_t R[16];
};

/* 53 */
struct pin_code
{
  uint8_t pin[16];
};

/* 54 */
struct sres_nb
{
  uint8_t nb[4];
};

/* 55 */
struct aco
{
  uint8_t a[12];
};

/* 56 */
struct byte16
{
  uint8_t A[16];
};

/* 57 */
struct nb_cmpl_pk
{
  uint16_t con_hdl;
  uint16_t nb_hc_cmpl_pkts;
};

/* 58 */
struct features
{
  uint8_t feats[8];
};

/* 59 */
struct supp_cmds
{
  uint8_t cmds[64];
};

/* 60 */
struct lmp_features
{
  uint8_t feats[8];
};

/* 61 */
struct io_capability
{
  uint8_t io_cap;
  uint8_t oob_data;
  uint8_t aut_req;
};

/* 62 */
struct pub_key
{
  uint8_t p_key[24];
};

/* 63 */
struct sp_pub_key
{
  pub_key X;
  pub_key Y;
};

/* 64 */
struct le_states
{
  uint8_t supp_states[8];
};

/* 65 */
struct white_list
{
  bd_addr wl_bdaddr;
  uint8_t wl_bdaddr_type;
};

/* 66 */
struct crc_init
{
  uint8_t crc[3];
};

/* 67 */
struct sess_k_div_x
{
  uint8_t skdiv[8];
};

/* 68 */
struct sess_k_div
{
  uint8_t skd[16];
};

/* 69 */
struct init_vect
{
  uint8_t iv[4];
};

/* 70 */
struct ec_point
{
  uint8_t x[32];
  uint8_t y[32];
};

/* 71 */
struct ecdh_key_pair
{
  uint8_t private_key[32];
  ec_point public_key;
};

/* 72 */
typedef __int64 long_long;

/* 73 */
typedef char int8_t;

/* 74 */
typedef __int16 int16_t;

/* 75 */
typedef int int32_t;

/* 76 */
typedef long_long int64_t;

/* 77 */
typedef unsigned int uint32_t;

/* 78 */
typedef unsigned __int64 uint64_t;

/* 79 */
typedef char int_least8_t;

/* 80 */
typedef __int16 int_least16_t;

/* 81 */
typedef int int_least32_t;

/* 82 */
typedef long_long int_least64_t;

/* 83 */
typedef unsigned __int8 uint_least8_t;

/* 84 */
typedef unsigned __int16 uint_least16_t;

/* 85 */
typedef unsigned int uint_least32_t;

/* 86 */
typedef unsigned __int64 uint_least64_t;

/* 87 */
typedef int int_fast8_t;

/* 88 */
typedef int int_fast16_t;

/* 89 */
typedef int int_fast32_t;

