hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 90 */
typedef long_long int_fast64_t;

/* 91 */
typedef unsigned int uint_fast8_t;

/* 92 */
typedef unsigned int uint_fast16_t;

/* 93 */
typedef unsigned int uint_fast32_t;

/* 94 */
typedef unsigned __int64 uint_fast64_t;

/* 95 */
typedef int intptr_t;

/* 96 */
typedef unsigned int uintptr_t;

/* 97 */
typedef long_long intmax_t;

/* 98 */
typedef unsigned __int64 uintmax_t;

/* 99 */
struct co_list
{
  co_list_hdr *first;
  co_list_hdr *last;
  uint32_t cnt;
  uint32_t maxcnt;
  uint32_t mincnt;
};

/* 100 */
struct co_list_hdr
{
  co_list_hdr *next;
};

/* 101 */
enum $790BDE7F4D8226B626B50C98AFF97163 : __int8
{
  POOL_LINKED_LIST = 0x0,
  RING_LINKED_LIST = 0x1,
  LINK_TYPE_END = 0x2,
};

/* 103 */
typedef uint16_t ke_msg_id_t;

/* 104 */
typedef uint16_t ke_task_id_t;

/* 102 */
struct ke_msg
{
  struct co_list_hdr hdr;
  uint32_t saved;
  ke_msg_id_t id;
  ke_task_id_t dest_id;
  ke_task_id_t src_id;
  uint16_t param_len;
  uint32_t param[1];
};

/* 105 */
typedef uint8_t ke_state_t;

/* 106 */
enum ke_msg_status_tag : __int8
{
  KE_MSG_CONSUMED = 0x0,
  KE_MSG_NO_FREE = 0x1,
  KE_MSG_SAVED = 0x2,
};

/* 107 */
struct co_buf_rx_desc
{
  uint16_t rxptr;
  uint16_t rxstatus;
  uint16_t rxheader;
  uint16_t rxchass;
  uint16_t rxdataptr;
};

/* 108 */
struct co_buf_tx_desc
{
  uint16_t txptr;
  uint16_t txheader;
  uint16_t txdataptr;
};

/* 109 */
struct __attribute__((aligned(4))) co_buf_tx_node
{
  co_list_hdr hdr;
  uint16_t idx;
};

/* 110 */
struct __attribute__((aligned(4))) co_buf_env_tag
{
  co_list tx_free;
  co_buf_tx_node tx_node[15];
  co_buf_tx_desc *tx_desc;
  co_buf_rx_desc *rx_desc;
  uint8_t rx_current;
};

/* 111 */
typedef int (*ke_msg_func_t)(const ke_msg_id_t, const void *, const ke_task_id_t, const ke_task_id_t);

/* 112 */
struct custom_msg_handler
{
  ke_task_id_t task_id;
  ke_msg_id_t id;
  ke_msg_func_t func;
};

/* 113 */
struct ke_msg_handler
{
  ke_msg_id_t id;
  ke_msg_func_t func;
};

/* 114 */
struct ke_state_handler
{
  const struct ke_msg_handler *msg_table;
  uint16_t msg_cnt;
};

/* 115 */
struct ke_task_desc
{
  const struct ke_state_handler *state_handler;
  const struct ke_state_handler *default_handler;
  ke_state_t *state;
  uint16_t state_max;
  uint16_t idx_max;
};

/* 116 */
enum KE_TASK_STATUS
{
  KE_TASK_OK = 0x0,
  KE_TASK_FAIL = 0x1,
  KE_TASK_UNKNOWN = 0x2,
  KE_TASK_CAPA_EXCEEDED = 0x3,
  KE_TASK_ALREADY_EXISTS = 0x4,
};

/* 117 */
enum sleep_mode_t : __int8
{
  mode_active = 0x0,
  mode_idle = 0x1,
  mode_ext_sleep = 0x2,
  mode_ext_sleep_otp_copy = 0x3,
  mode_sleeping = 0x4,
};

/* 118 */
enum boost_overhead_st : __int8
{
  NOT_MEASURED = 0x0,
  APPLY_OVERHEAD = 0x1,
  NO_OVERHEAD = 0x2,
};

/* 119 */
enum drift_value_in_ppm : __int16
{
  DRIFT_20PPM = 0x14,
  DRIFT_30PPM = 0x1E,
  DRIFT_50PPM = 0x32,
  DRIFT_75PPM = 0x4B,
  DRIFT_100PPM = 0x64,
  DRIFT_150PPM = 0x96,
  DRIFT_250PPM = 0xFA,
  DRIFT_500PPM = 0x1F4,
};

/* 120 */
struct mem_usage_log
{
  uint16_t max_used_sz;
  uint16_t used_sz;
  uint16_t max_used_other_sz;
  uint16_t used_other_sz;
};

/* 121 */
struct __attribute__((aligned(4))) ea_interval_tag
{
  co_list_hdr hdr;
  uint16_t interval_used;
  uint16_t offset_used;
  uint16_t bandwidth_used;
  uint16_t conhdl_used;
  uint16_t role_used;
  bool odd_offset;
  uint16_t linkid;
};

/* 122 */
struct ea_param_input
{
  uint16_t interval_min;
  uint16_t interval_max;
  uint16_t duration_min;
  uint16_t duration_max;
  uint8_t pref_period;
  uint16_t offset;
  uint8_t action;
  uint16_t conhdl;
  uint16_t role;
  bool odd_offset;
  uint16_t linkid;
};

/* 123 */
struct ea_param_output
{
  uint16_t interval;
  uint16_t duration;
  uint16_t offset;
};

/* 124 */
enum ea_error : __int8
{
  EA_ERROR_OK = 0x0,
  EA_ERROR_PROG = 0x1,
  EA_ERROR_REJECTED = 0x2,
  EA_ERROR_CANCELED = 0x3,
  EA_ERROR_NOT_FOUND = 0x4,
  EA_ERROR_ALREADY_FREE = 0x5,
  EA_ERROR_BW_FULL = 0x6,
};

/* 125 */
enum ea_param_req_action : __int8
{
  EA_PARAM_REQ_GET = 0x0,
  EA_PARAM_REQ_CHECK = 0x1,
};

/* 126 */
enum ea_elt_asap_type : __int8
{
  EA_FLAG_NO_ASAP = 0x0,
  EA_FLAG_ASAP_NO_LIMIT = 0x1,
  EA_FLAG_ASAP_LIMIT = 0x2,
  EA_FLAG_MAX = 0x3,
};

/* 127 */
enum ea_elt_asap_parity : __int8
{
  EA_EVEN_SLOT = 0x0,
  EA_ODD_SLOT = 0x1,
};

/* 128 */
struct ea_elt_tag
{
  co_list_hdr hdr;
  ea_elt_tag *linked_element;
  uint32_t timestamp;
  uint32_t asap_field;
  uint16_t duration_min;
  uint8_t current_prio;
  uint8_t prev_stop_thr1;
  uint8_t prev_stop_thr2;
  uint8_t prev_start_thr;
  void (*ea_cb_prevent_start)(ea_elt_tag *);
  void (*ea_cb_prevent_stop)(ea_elt_tag *);
  void (*ea_cb_cancel)(ea_elt_tag *);
  void *env;
};

/* 129 */
enum GPIO_PUPD : __int16
{
  INPUT = 0x0,
  INPUT_PULLUP = 0x100,
  INPUT_PULLDOWN = 0x200,
  OUTPUT = 0x300,
};

/* 130 */
enum GPIO_POWER_RAIL : __int8
{
  GPIO_POWER_RAIL_3V = 0x0,
  GPIO_POWER_RAIL_1V = 0x1,
};

/* 131 */
enum GPIO_PORT : __int8
{
  GPIO_PORT_0 = 0x0,
};

/* 132 */
enum GPIO_PIN : __int8
{
  GPIO_PIN_0 = 0x0,
  GPIO_PIN_1 = 0x1,
  GPIO_PIN_2 = 0x2,
  GPIO_PIN_3 = 0x3,
  GPIO_PIN_4 = 0x4,
  GPIO_PIN_5 = 0x5,
  GPIO_PIN_6 = 0x6,
  GPIO_PIN_7 = 0x7,
  GPIO_PIN_8 = 0x8,
  GPIO_PIN_9 = 0x9,
  GPIO_PIN_10 = 0xA,
  GPIO_PIN_11 = 0xB,
};

/* 133 */
enum GPIO_FUNCTION : __int8
{
  PID_GPIO = 0x0,
  PID_UART1_RX = 0x1,
  PID_UART1_TX = 0x2,
  PID_UART2_RX = 0x3,
  PID_UART2_TX = 0x4,
  PID_SYS_CLK = 0x5,
  PID_LP_CLK = 0x6,
  PID_I2C_SCL = 0x9,
  PID_I2C_SDA = 0xA,
  PID_PWM5 = 0xB,
  PID_PWM6 = 0xC,
  PID_PWM7 = 0xD,
  PID_ADC = 0xF,
  PID_PWM0 = 0x10,
  PID_PWM1 = 0x11,
  PID_BLE_DIAG = 0x12,
  PID_UART1_CTSN = 0x13,
  PID_UART1_RTSN = 0x14,
  PID_PWM2 = 0x17,
  PID_PWM3 = 0x18,
  PID_PWM4 = 0x19,
  PID_SPI_DI = 0x1A,
  PID_SPI_DO = 0x1B,
  PID_SPI_CLK = 0x1C,
  PID_SPI_EN = 0x1D,
  PID_SPI_EN1 = 0x1E,
};

/* 134 */
enum GPIO_IRQ_INPUT_LEVEL : __int8
{
  GPIO_IRQ_INPUT_LEVEL_HIGH = 0x0,
  GPIO_IRQ_INPUT_LEVEL_LOW = 0x1,
};

/* 135 */
enum GPIO_POR_PIN_POLARITY : __int8
{
  GPIO_POR_PIN_POLARITY_LOW = 0x0,
  GPIO_POR_PIN_POLARITY_HIGH = 0x1,
};

