hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 136 */
typedef void (*GPIO_handler_function_t)(void);

/* 137 */
struct hci_evt_desc_tag
{
  uint8_t code;
  uint8_t dest_field;
  uint8_t special_pack;
  void *par_fmt;
};

/* 138 */
typedef uint16_t (*hci_pkupk_func_t)(uint8_t *, uint8_t *, uint16_t *, uint16_t);

/* 139 */
struct hci_env_tag
{
  evt_mask evt_msk;
  evt_mask evt_msk_page_2;
};

/* 140 */
enum HCI_MSG_DEST_LL : __int8
{
  MNG = 0x0,
  CTRL = 0x1,
  BLE_MNG = 0x2,
  BLE_CTRL = 0x3,
  BT_MNG = 0x4,
  BT_CTRL_CONHDL = 0x5,
  BT_CTRL_BD_ADDR = 0x6,
  DBG = 0x7,
  LL_UNDEF = 0x8,
};

/* 141 */
enum HCI_MSG_DEST_HL : __int8
{
  HL_MNG = 0x0,
  HL_CTRL = 0x1,
  HL_DATA = 0x2,
  HL_UNDEF = 0x3,
};

/* 142 */
enum HCI_PACK_STATUS : __int8
{
  HCI_PACK_OK = 0x0,
  HCI_PACK_IN_BUF_OVFLW = 0x1,
  HCI_PACK_OUT_BUF_OVFLW = 0x2,
  HCI_PACK_WRONG_FORMAT = 0x3,
  HCI_PACK_ERROR = 0x4,
};

/* 143 */
struct hci_cmd_desc_tab_ref
{
  uint8_t ogf;
  uint16_t nb_cmds;
  const hci_cmd_desc_tag *cmd_desc_tab;
};

/* 144 */
struct hci_cmd_desc_tag
{
  uint16_t opcode;
  uint8_t dest_field;
  uint8_t special_pack_settings;
  void *par_fmt;
  void *ret_par_fmt;
};

/* 145 */
enum $D073F28688CDD1AD0B94E71FCC43657A : __int16
{
  HCI_VS1_USER_CMD_OPCODE = 0xFD00,
  HCI_VS2_USER_CMD_OPCODE = 0xFD01,
  HCI_VS_LAST_USER_CMD_OPCODE = 0xFD02,
};

/* 146 */
struct hci_vs1_user_cmd
{
  uint8_t inputData;
};

/* 147 */
struct hci_vs1_user_cmd_cmp_evt
{
  uint8_t status;
  uint8_t returnData;
};

/* 148 */
struct hci_vs2_user_cmd
{
  uint8_t inputData;
};

/* 149 */
struct hci_vs2_user_cmd_cmp_evt
{
  uint8_t status;
  uint8_t returnData;
  uint8_t mycode;
};

/* 150 */
enum IRQn : __int8
{
  NonMaskableInt_IRQn = 0xF2,
  HardFault_IRQn = 0xF3,
  SVCall_IRQn = 0xFB,
  PendSV_IRQn = 0xFE,
  SysTick_IRQn = 0xFF,
  BLE_WAKEUP_LP_IRQn = 0x0,
  BLE_GEN_IRQn = 0x1,
  UART_IRQn = 0x2,
  UART2_IRQn = 0x3,
  I2C_IRQn = 0x4,
  SPI_IRQn = 0x5,
  ADC_IRQn = 0x6,
  KEYBRD_IRQn = 0x7,
  BLE_RF_DIAG_IRQn = 0x8,
  RF_CAL_IRQn = 0x9,
  GPIO0_IRQn = 0xA,
  GPIO1_IRQn = 0xB,
  GPIO2_IRQn = 0xC,
  GPIO3_IRQn = 0xD,
  GPIO4_IRQn = 0xE,
  SWTIM_IRQn = 0xF,
  WKUP_QUADEC_IRQn = 0x10,
  SWTIM1_IRQn = 0x11,
  RTC_IRQn = 0x12,
  DMA_IRQn = 0x13,
  XTAL32M_RDY_IRQn = 0x14,
  RESERVED21_IRQn = 0x15,
  RESERVED22_IRQn = 0x16,
  RESERVED23_IRQn = 0x17,
};

/* 151 */
typedef IRQn IRQn_Type;

/* 152 */
struct __CLK_REF_SEL_REG
{
  unsigned __int16 BITFLD_REF_CLK_SEL : 2;
  unsigned __int16 BITFLD_REF_CAL_START : 1;
  unsigned __int16 BITFLD_EXT_CNT_EN_SEL : 1;
};

/* 153 */
struct __CLK_REF_CNT_REG
{
  unsigned __int16 BITFLD_REF_CNT_VAL : 16;
};

/* 154 */
struct __CLK_REF_VAL_L_REG
{
  unsigned __int16 BITFLD_XTAL_CNT_VAL : 16;
};

/* 155 */
struct __CLK_REF_VAL_H_REG
{
  unsigned __int16 BITFLD_XTAL_CNT_VAL : 16;
};

/* 156 */
struct __MBIST_SRAM12_ADDR_REG
{
  unsigned __int16 BITFLD_MBIST_ADDR : 1;
};

/* 157 */
struct __MBIST_SRAM12_STATE_REG
{
  unsigned __int16 BITFLD_MBIST_STATE : 1;
};

/* 158 */
struct __MBIST_SRAM12_RD_MSB_REG
{
  unsigned __int16 BITFLD_MBIST_MSB_DATA : 1;
};

/* 159 */
struct __MBIST_SRAM12_RD_LSB_REG
{
  unsigned __int16 BITFLD_MBIST_LSB_DATA : 1;
};

/* 160 */
struct __MBIST_SRAM3_ADDR_REG
{
  unsigned __int16 BITFLD_MBIST_ADDR : 1;
};

/* 161 */
struct __MBIST_SRAM3_STATE_REG
{
  unsigned __int16 BITFLD_MBIST_STATE : 1;
};

/* 162 */
struct __MBIST_SRAM3_RD_MSB_REG
{
  unsigned __int16 BITFLD_MBIST_MSB_DATA : 1;
};

/* 163 */
struct __MBIST_SRAM3_RD_LSB_REG
{
  unsigned __int16 BITFLD_MBIST_LSB_DATA : 1;
};

/* 164 */
struct __BLE_RWBLECNTL_REG
{
  unsigned __int32 BITFLD_SYNCERR : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_RXWINSZDEF : 4;
  unsigned __int32 BITFLD_RWBLE_EN : 1;
  unsigned __int32 BITFLD_ADVERTFILT_EN : 1;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 _anon_2 : 2;
  unsigned __int32 _anon_3 : 2;
  unsigned __int32 BITFLD_HOP_REMAP_DSB : 1;
  unsigned __int32 BITFLD_CRC_DSB : 1;
  unsigned __int32 BITFLD_WHIT_DSB : 1;
  unsigned __int32 BITFLD_CRYPT_DSB : 1;
  unsigned __int32 BITFLD_NESN_DSB : 1;
  unsigned __int32 BITFLD_SN_DSB : 1;
  unsigned __int32 BITFLD_MD_DSB : 1;
  unsigned __int32 _anon_4 : 1;
  unsigned __int32 BITFLD_SCAN_ABORT : 1;
  unsigned __int32 BITFLD_ADVERT_ABORT : 1;
  unsigned __int32 BITFLD_RFTEST_ABORT : 1;
  unsigned __int32 _anon_5 : 1;
  unsigned __int32 BITFLD_SWINT_REQ : 1;
  unsigned __int32 BITFLD_REG_SOFT_RST : 1;
  unsigned __int32 BITFLD_MASTER_TGSOFT_RST : 1;
  unsigned __int32 BITFLD_MASTER_SOFT_RST : 1;
};

/* 165 */
struct __BLE_VERSION_REG
{
  unsigned __int32 BITFLD_BUILD : 8;
  unsigned __int32 BITFLD_UPG : 8;
  unsigned __int32 BITFLD_REL : 8;
  unsigned __int32 BITFLD_TYP : 8;
};

/* 166 */
struct __BLE_RWBLECONF_REG
{
  unsigned __int32 BITFLD_BUSWIDTH : 1;
  unsigned __int32 BITFLD_USECRYPT : 1;
  unsigned __int32 BITFLD_USEDBG : 1;
  unsigned __int32 BITFLD_COEX : 1;
  unsigned __int32 BITFLD_INTMODE : 1;
  unsigned __int32 BITFLD_DMMODE : 1;
  unsigned __int32 BITFLD_DECIPHER : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_CLK_SEL : 6;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_RFIF : 7;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 BITFLD_ADD_WIDTH : 6;
};

/* 167 */
struct __BLE_INTCNTL_REG
{
  unsigned __int32 BITFLD_CSCNTINTMSK : 1;
  unsigned __int32 BITFLD_RXINTMSK : 1;
  unsigned __int32 BITFLD_SLPINTMSK : 1;
  unsigned __int32 BITFLD_EVENTINTMSK : 1;
  unsigned __int32 BITFLD_CRYPTINTMSK : 1;
  unsigned __int32 BITFLD_ERRORINTMSK : 1;
  unsigned __int32 BITFLD_GROSSTGTIMINTMSK : 1;
  unsigned __int32 BITFLD_FINETGTIMINTMSK : 1;
  unsigned __int32 BITFLD_EVENTAPFAINTMSK : 1;
  unsigned __int32 BITFLD_SWINTMSK : 1;
  unsigned __int32 _anon_0 : 5;
  unsigned __int32 BITFLD_CSCNTDEVMSK : 1;
};

/* 168 */
struct __BLE_INTSTAT_REG
{
  unsigned __int32 BITFLD_CSCNTINTSTAT : 1;
  unsigned __int32 BITFLD_RXINTSTAT : 1;
  unsigned __int32 BITFLD_SLPINTSTAT : 1;
  unsigned __int32 BITFLD_EVENTINTSTAT : 1;
  unsigned __int32 BITFLD_CRYPTINTSTAT : 1;
  unsigned __int32 BITFLD_ERRORINTSTAT : 1;
  unsigned __int32 BITFLD_GROSSTGTIMINTSTAT : 1;
  unsigned __int32 BITFLD_FINETGTIMINTSTAT : 1;
  unsigned __int32 BITFLD_EVENTAPFAINTSTAT : 1;
  unsigned __int32 BITFLD_SWINTSTAT : 1;
};

/* 169 */
struct __BLE_INTRAWSTAT_REG
{
  unsigned __int32 BITFLD_CSCNTINTRAWSTAT : 1;
  unsigned __int32 BITFLD_RXINTRAWSTAT : 1;
  unsigned __int32 BITFLD_SLPINTRAWSTAT : 1;
  unsigned __int32 BITFLD_EVENTINTRAWSTAT : 1;
  unsigned __int32 BITFLD_CRYPTINTRAWSTAT : 1;
  unsigned __int32 BITFLD_ERRORINTRAWSTAT : 1;
  unsigned __int32 BITFLD_GROSSTGTIMINTRAWSTAT : 1;
  unsigned __int32 BITFLD_FINETGTIMINTRAWSTAT : 1;
  unsigned __int32 BITFLD_EVENTAPFAINTRAWSTAT : 1;
  unsigned __int32 BITFLD_SWINTRAWSTAT : 1;
};

