hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 170 */
struct __BLE_INTACK_REG
{
  unsigned __int32 BITFLD_CSCNTINTACK : 1;
  unsigned __int32 BITFLD_RXINTACK : 1;
  unsigned __int32 BITFLD_SLPINTACK : 1;
  unsigned __int32 BITFLD_EVENTINTACK : 1;
  unsigned __int32 BITFLD_CRYPTINTACK : 1;
  unsigned __int32 BITFLD_ERRORINTACK : 1;
  unsigned __int32 BITFLD_GROSSTGTIMINTACK : 1;
  unsigned __int32 BITFLD_FINETGTIMINTACK : 1;
  unsigned __int32 BITFLD_EVENTAPFAINTACK : 1;
  unsigned __int32 BITFLD_SWINTACK : 1;
};

/* 171 */
struct __BLE_BASETIMECNT_REG
{
  unsigned __int32 BITFLD_BASETIMECNT : 27;
};

/* 172 */
struct __BLE_FINETIMECNT_REG
{
  unsigned __int32 BITFLD_FINECNT : 10;
};

/* 173 */
struct __BLE_BDADDRL_REG
{
  unsigned __int32 BITFLD_BDADDRL : 32;
};

/* 174 */
struct __BLE_BDADDRU_REG
{
  unsigned __int32 BITFLD_BDADDRU : 16;
  unsigned __int32 BITFLD_PRIV_NPUB : 1;
};

/* 175 */
struct __BLE_CURRENTRXDESCPTR_REG
{
  unsigned __int32 BITFLD_CURRENTRXDESCPTR : 15;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_ETPTR : 16;
};

/* 176 */
struct __BLE_DEEPSLCNTL_REG
{
  unsigned __int32 BITFLD_DEEP_SLEEP_IRQ_EN : 2;
  unsigned __int32 BITFLD_DEEP_SLEEP_ON : 1;
  unsigned __int32 BITFLD_DEEP_SLEEP_CORR_EN : 1;
  unsigned __int32 BITFLD_SOFT_WAKEUP_REQ : 1;
  unsigned __int32 _anon_0 : 10;
  unsigned __int32 BITFLD_DEEP_SLEEP_STAT : 1;
  unsigned __int32 _anon_1 : 15;
  unsigned __int32 BITFLD_EXTWKUPDSB : 1;
};

/* 177 */
struct __BLE_DEEPSLWKUP_REG
{
  unsigned __int32 BITFLD_DEEPSLTIME : 32;
};

/* 178 */
struct __BLE_DEEPSLSTAT_REG
{
  unsigned __int32 BITFLD_DEEPSLDUR : 32;
};

/* 179 */
struct __BLE_ENBPRESET_REG
{
  unsigned __int32 BITFLD_TWIRQ_RESET : 10;
  unsigned __int32 BITFLD_TWIRQ_SET : 11;
  unsigned __int32 BITFLD_TWEXT : 11;
};

/* 180 */
struct __BLE_FINECNTCORR_REG
{
  unsigned __int32 BITFLD_FINECNTCORR : 10;
};

/* 181 */
struct __BLE_BASETIMECNTCORR_REG
{
  unsigned __int32 BITFLD_BASETIMECNTCORR : 27;
};

/* 182 */
struct __BLE_DIAGCNTL_REG
{
  unsigned __int32 BITFLD_DIAG0 : 6;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DIAG0_EN : 1;
  unsigned __int32 BITFLD_DIAG1 : 6;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_DIAG1_EN : 1;
  unsigned __int32 BITFLD_DIAG2 : 6;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 BITFLD_DIAG2_EN : 1;
  unsigned __int32 BITFLD_DIAG3 : 6;
  unsigned __int32 _anon_3 : 1;
  unsigned __int32 BITFLD_DIAG3_EN : 1;
};

/* 183 */
struct __BLE_DIAGSTAT_REG
{
  unsigned __int32 BITFLD_DIAG0STAT : 8;
  unsigned __int32 BITFLD_DIAG1STAT : 8;
  unsigned __int32 BITFLD_DIAG2STAT : 8;
  unsigned __int32 BITFLD_DIAG3STAT : 8;
};

/* 184 */
struct __BLE_DEBUGADDMAX_REG
{
  unsigned __int32 BITFLD_EM_ADDMAX : 16;
  unsigned __int32 BITFLD_REG_ADDMAX : 16;
};

/* 185 */
struct __BLE_DEBUGADDMIN_REG
{
  unsigned __int32 BITFLD_EM_ADDMIN : 16;
  unsigned __int32 BITFLD_REG_ADDMIN : 16;
};

/* 186 */
struct __BLE_ERRORTYPESTAT_REG
{
  unsigned __int32 BITFLD_TXCRYPT_ERROR : 1;
  unsigned __int32 BITFLD_RXCRYPT_ERROR : 1;
  unsigned __int32 BITFLD_PKTCNTL_EMACC_ERROR : 1;
  unsigned __int32 BITFLD_RADIO_EMACC_ERROR : 1;
  unsigned __int32 BITFLD_EVT_SCHDL_EMACC_ERROR : 1;
  unsigned __int32 BITFLD_EVT_SCHDL_ENTRY_ERROR : 1;
  unsigned __int32 BITFLD_EVT_SCHDL_APFM_ERROR : 1;
  unsigned __int32 BITFLD_EVT_CNTL_APFM_ERROR : 1;
  unsigned __int32 BITFLD_WHITELIST_ERROR : 1;
  unsigned __int32 BITFLD_IFS_UNDERRUN : 1;
  unsigned __int32 BITFLD_ADV_UNDERRUN : 1;
  unsigned __int32 BITFLD_LLCHMAP_ERROR : 1;
  unsigned __int32 BITFLD_CSFORMAT_ERROR : 1;
  unsigned __int32 BITFLD_TXDESC_EMPTY_ERROR : 1;
  unsigned __int32 BITFLD_RXDESC_EMPTY_ERROR : 1;
  unsigned __int32 BITFLD_TXDATA_PTR_ERROR : 1;
  unsigned __int32 BITFLD_RXDATA_PTR_ERROR : 1;
  unsigned __int32 BITFLD_CONCEVTIRQ_ERROR : 1;
};

/* 187 */
struct __BLE_SWPROFILING_REG
{
  unsigned __int32 BITFLD_SWPROFVAL : 32;
};

/* 188 */
struct __BLE_RADIOCNTL1_REG
{
  unsigned __int32 _anon_0 : 16;
  unsigned __int32 BITFLD_XRFSEL : 5;
};

/* 189 */
struct __BLE_RADIOPWRUPDN_REG
{
  unsigned __int32 BITFLD_TXPWRUP : 8;
  unsigned __int32 BITFLD_TXPWRDN : 4;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_RXPWRUP : 8;
  unsigned __int32 BITFLD_RTRIP_DELAY : 7;
};

/* 190 */
struct __BLE_ADVTIM_REG
{
  unsigned __int32 BITFLD_ADVINT : 14;
};

/* 191 */
struct __BLE_ACTSCANSTAT_REG
{
  unsigned __int32 BITFLD_UPPERLIMIT : 9;
  unsigned __int32 _anon_0 : 7;
  unsigned __int32 BITFLD_BACKOFF : 9;
};

/* 192 */
struct __BLE_WLPUBADDPTR_REG
{
  unsigned __int32 BITFLD_WLPUBADDPTR : 16;
};

/* 193 */
struct __BLE_WLPRIVADDPTR_REG
{
  unsigned __int32 BITFLD_WLPRIVADDPTR : 16;
};

/* 194 */
struct __BLE_WLNBDEV_REG
{
  unsigned __int32 BITFLD_NBPUBDEV : 8;
  unsigned __int32 BITFLD_NBPRIVDEV : 8;
};

/* 195 */
struct __BLE_AESCNTL_REG
{
  unsigned __int32 BITFLD_AES_START : 1;
  unsigned __int32 BITFLD_AES_MODE : 1;
};

/* 196 */
struct __BLE_AESKEY31_0_REG
{
  unsigned __int32 BITFLD_AESKEY31_0 : 32;
};

/* 197 */
struct __BLE_AESKEY63_32_REG
{
  unsigned __int32 BITFLD_AESKEY63_32 : 32;
};

/* 198 */
struct __BLE_AESKEY95_64_REG
{
  unsigned __int32 BITFLD_AESKEY95_64 : 32;
};

/* 199 */
struct __BLE_AESKEY127_96_REG
{
  unsigned __int32 BITFLD_AESKEY127_96 : 32;
};

/* 200 */
struct __BLE_AESPTR_REG
{
  unsigned __int32 BITFLD_AESPTR : 16;
};

/* 201 */
struct __BLE_TXMICVAL_REG
{
  unsigned __int32 BITFLD_TXMICVAL : 32;
};

/* 202 */
struct __BLE_RXMICVAL_REG
{
  unsigned __int32 BITFLD_RXMICVAL : 32;
};

/* 203 */
struct __BLE_RFTESTCNTL_REG
{
  unsigned __int32 BITFLD_TXLENGTH : 9;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_TXPKTCNTEN : 1;
  unsigned __int32 BITFLD_TXPLDSRC : 1;
  unsigned __int32 BITFLD_PRBSTYPE : 1;
  unsigned __int32 BITFLD_TXLENGTHSRC : 1;
  unsigned __int32 BITFLD_INFINITETX : 1;
  unsigned __int32 _anon_1 : 11;
  unsigned __int32 BITFLD_RXPKTCNTEN : 1;
  unsigned __int32 _anon_2 : 3;
  unsigned __int32 BITFLD_INFINITERX : 1;
};

/* 204 */
struct __BLE_RFTESTTXSTAT_REG
{
  unsigned __int32 BITFLD_TXPKTCNT : 32;
};

