hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 205 */
struct __BLE_RFTESTRXSTAT_REG
{
  unsigned __int32 BITFLD_RXPKTCNT : 32;
};

/* 206 */
struct __BLE_TIMGENCNTL_REG
{
  unsigned __int32 BITFLD_PREFETCH_TIME : 9;
  unsigned __int32 _anon_0 : 7;
  unsigned __int32 BITFLD_PREFETCHABORT_TIME : 10;
  unsigned __int32 _anon_1 : 5;
  unsigned __int32 BITFLD_APFM_EN : 1;
};

/* 207 */
struct __BLE_GROSSTIMTGT_REG
{
  unsigned __int32 BITFLD_GROSSTARGET : 23;
};

/* 208 */
struct __BLE_FINETIMTGT_REG
{
  unsigned __int32 BITFLD_FINETARGET : 27;
};

/* 209 */
struct __BLE_SAMPLECLK_REG
{
  unsigned __int32 BITFLD_SAMP : 1;
};

/* 210 */
struct __BLE_COEXIFCNTL0_REG
{
  unsigned __int32 BITFLD_COEX_EN : 1;
  unsigned __int32 BITFLD_SYNCGEN_EN : 1;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_WLANRXMSK : 2;
  unsigned __int32 BITFLD_WLANTXMSK : 2;
  unsigned __int32 _anon_1 : 8;
  unsigned __int32 BITFLD_WLCTXPRIOMODE : 2;
  unsigned __int32 _anon_2 : 2;
  unsigned __int32 BITFLD_WLCRXPRIOMODE : 2;
};

/* 211 */
struct __BLE_COEXIFCNTL1_REG
{
  unsigned __int32 BITFLD_WLCPDELAY : 7;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_WLCPDURATION : 7;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_WLCPTXTHR : 5;
  unsigned __int32 _anon_2 : 3;
  unsigned __int32 BITFLD_WLCPRXTHR : 5;
};

/* 212 */
struct __BLE_BLEMPRIO0_REG
{
  unsigned __int32 BITFLD_BLEM0 : 4;
  unsigned __int32 BITFLD_BLEM1 : 4;
  unsigned __int32 BITFLD_BLEM2 : 4;
  unsigned __int32 BITFLD_BLEM3 : 4;
  unsigned __int32 BITFLD_BLEM4 : 4;
  unsigned __int32 BITFLD_BLEM5 : 4;
  unsigned __int32 BITFLD_BLEM6 : 4;
  unsigned __int32 BITFLD_BLEM7 : 4;
};

/* 213 */
struct __BLE_BLEMPRIO1_REG
{
  unsigned __int32 _anon_0 : 28;
  unsigned __int32 BITFLD_BLEMDEFAULT : 4;
};

/* 214 */
struct __BLE_CNTL2_REG
{
  unsigned __int32 BITFLD_EMACCERRSTAT : 1;
  unsigned __int32 BITFLD_EMACCERRACK : 1;
  unsigned __int32 BITFLD_EMACCERRMSK : 1;
  unsigned __int32 BITFLD_BLE_DIAG_OVR : 1;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_BLE_CLK_STAT : 1;
  unsigned __int32 BITFLD_MON_LP_CLK : 1;
  unsigned __int32 BITFLD_RADIO_PWRDN_ALLOW : 1;
  unsigned __int32 BITFLD_BLE_CLK_SEL : 6;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_BLE_PTI_SOURCE_SEL : 1;
  unsigned __int32 BITFLD_BB_ONLY : 1;
  unsigned __int32 BITFLD_SW_RPL_SPI : 1;
  unsigned __int32 BITFLD_WAKEUPLPSTAT : 1;
  unsigned __int32 BITFLD_BLE_RSSI_SEL : 1;
  unsigned __int32 BITFLD_BLE_ARP_PHY_ERR_STAT : 1;
  unsigned __int32 BITFLD_BLE_ARP_ERR_MSK_N : 1;
  unsigned __int32 BITFLD_BLE_PHY_ERR_MSK_N : 1;
};

/* 215 */
struct __BLE_EM_BASE_REG
{
  unsigned __int32 _anon_0 : 10;
  unsigned __int32 BITFLD_BLE_EM_BASE_16_10 : 7;
};

/* 216 */
struct __BLE_DIAGCNTL2_REG
{
  unsigned __int32 BITFLD_DIAG4 : 6;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DIAG4_EN : 1;
  unsigned __int32 BITFLD_DIAG5 : 6;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_DIAG5_EN : 1;
  unsigned __int32 BITFLD_DIAG6 : 6;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 BITFLD_DIAG6_EN : 1;
  unsigned __int32 BITFLD_DIAG7 : 6;
  unsigned __int32 _anon_3 : 1;
  unsigned __int32 BITFLD_DIAG7_EN : 1;
};

/* 217 */
struct __BLE_DIAGCNTL3_REG
{
  unsigned __int32 BITFLD_DIAG0_BIT : 3;
  unsigned __int32 BITFLD_DIAG0_INV : 1;
  unsigned __int32 BITFLD_DIAG1_BIT : 3;
  unsigned __int32 BITFLD_DIAG1_INV : 1;
  unsigned __int32 BITFLD_DIAG2_BIT : 3;
  unsigned __int32 BITFLD_DIAG2_INV : 1;
  unsigned __int32 BITFLD_DIAG3_BIT : 3;
  unsigned __int32 BITFLD_DIAG3_INV : 1;
  unsigned __int32 BITFLD_DIAG4_BIT : 3;
  unsigned __int32 BITFLD_DIAG4_INV : 1;
  unsigned __int32 BITFLD_DIAG5_BIT : 3;
  unsigned __int32 BITFLD_DIAG5_INV : 1;
  unsigned __int32 BITFLD_DIAG6_BIT : 3;
  unsigned __int32 BITFLD_DIAG6_INV : 1;
  unsigned __int32 BITFLD_DIAG7_BIT : 3;
  unsigned __int32 BITFLD_DIAG7_INV : 1;
};

/* 218 */
struct __CLK_AMBA_REG
{
  unsigned __int16 BITFLD_HCLK_DIV : 2;
  unsigned __int16 _anon_0 : 2;
  unsigned __int16 BITFLD_PCLK_DIV : 2;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 BITFLD_OTP_ENABLE : 1;
};

/* 219 */
struct __CLK_FREQ_TRIM_REG
{
  unsigned __int16 BITFLD_XTAL32M_TRIM : 8;
};

/* 220 */
struct __CLK_PER_REG
{
  unsigned __int16 BITFLD_TMR_DIV : 2;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_TMR_ENABLE : 1;
  unsigned __int16 BITFLD_WAKEUPCT_ENABLE : 1;
  unsigned __int16 BITFLD_I2C_ENABLE : 1;
  unsigned __int16 BITFLD_UART2_ENABLE : 1;
  unsigned __int16 BITFLD_UART1_ENABLE : 1;
  unsigned __int16 _anon_1 : 2;
  unsigned __int16 BITFLD_SPI_ENABLE : 1;
  unsigned __int16 BITFLD_QUAD_ENABLE : 1;
};

/* 221 */
struct __CLK_RADIO_REG
{
  unsigned __int16 _anon_0 : 2;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 BITFLD_RFCU_ENABLE : 1;
  unsigned __int16 BITFLD_BLE_DIV : 2;
  unsigned __int16 BITFLD_BLE_LP_RESET : 1;
  unsigned __int16 BITFLD_BLE_ENABLE : 1;
};

/* 222 */
struct __CLK_CTRL_REG
{
  unsigned __int16 BITFLD_SYS_CLK_SEL : 2;
  unsigned __int16 BITFLD_XTAL32M_DISABLE : 1;
  unsigned __int16 BITFLD_LP_CLK_SEL : 2;
  unsigned __int16 BITFLD_RUNNING_AT_LP_CLK : 1;
  unsigned __int16 BITFLD_RUNNING_AT_RC32M : 1;
  unsigned __int16 BITFLD_RUNNING_AT_XTAL32M : 1;
};

/* 223 */
struct __PMU_CTRL_REG
{
  unsigned __int16 BITFLD_RESET_ON_WAKEUP : 1;
  unsigned __int16 BITFLD_TIM_SLEEP : 1;
  unsigned __int16 BITFLD_RADIO_SLEEP : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_OTP_COPY_DIV : 2;
  unsigned __int16 BITFLD_MAP_BANDGAP_EN : 1;
};

/* 224 */
struct __SYS_CTRL_REG
{
  unsigned __int16 BITFLD_REMAP_ADR0 : 2;
  unsigned __int16 BITFLD_DEV_PHASE : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_OTP_COPY : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 BITFLD_OTPC_RESET_REQ : 1;
  unsigned __int16 BITFLD_DEBUGGER_ENABLE : 2;
  unsigned __int16 _anon_2 : 1;
  unsigned __int16 BITFLD_TIMEOUT_DISABLE : 1;
  unsigned __int16 _anon_3 : 4;
  unsigned __int16 BITFLD_SW_RESET : 1;
};

