hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 225 */
struct __SYS_STAT_REG
{
  unsigned __int16 BITFLD_RAD_IS_DOWN : 1;
  unsigned __int16 BITFLD_RAD_IS_UP : 1;
  unsigned __int16 BITFLD_TIM_IS_DOWN : 1;
  unsigned __int16 BITFLD_TIM_IS_UP : 1;
  unsigned __int16 BITFLD_DBG_IS_UP : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_XTAL32M_TRIM_READY : 1;
  unsigned __int16 BITFLD_XTAL32M_SETTLED : 1;
};

/* 226 */
struct __TRIM_CTRL_REG
{
  unsigned __int16 BITFLD_XTAL_COUNT_N : 6;
  unsigned __int16 BITFLD_XTAL_TRIM_SELECT : 2;
  unsigned __int16 BITFLD_XTAL_SETTLE_N : 6;
};

/* 227 */
struct __RAM_PWR_CTRL_REG
{
  unsigned __int16 BITFLD_RAM1_PWR_CTRL : 2;
  unsigned __int16 BITFLD_RAM2_PWR_CTRL : 2;
  unsigned __int16 BITFLD_RAM3_PWR_CTRL : 2;
};

/* 228 */
struct __CLK_RC32K_REG
{
  unsigned __int16 BITFLD_RC32K_DISABLE : 1;
  unsigned __int16 BITFLD_RC32K_TRIM : 4;
};

/* 229 */
struct __CLK_RC32M_REG
{
  unsigned __int16 BITFLD_RC32M_DISABLE : 1;
  unsigned __int16 BITFLD_RC32M_BIAS : 4;
  unsigned __int16 BITFLD_RC32M_RANGE : 2;
  unsigned __int16 BITFLD_RC32M_COSC : 4;
};

/* 230 */
struct __CLK_RCX_REG
{
  unsigned __int16 BITFLD_RCX_ENABLE : 1;
  unsigned __int16 BITFLD_RCX_RADJUST : 1;
  unsigned __int16 BITFLD_RCX_CADJUST : 5;
  unsigned __int16 BITFLD_RCX_C0 : 1;
  unsigned __int16 BITFLD_RCX_BIAS : 4;
};

/* 231 */
struct __BANDGAP_REG
{
  unsigned __int16 BITFLD_BGR_TRIM : 5;
  unsigned __int16 BITFLD_BGR_ITRIM : 5;
};

/* 232 */
struct __XTAL32M_START_REG
{
  unsigned __int16 BITFLD_XTAL32M_START : 8;
  unsigned __int16 BITFLD_XTAL32M_RAMP : 8;
};

/* 233 */
struct __XTAL32M_TRSTAT_REG
{
  unsigned __int16 BITFLD_XTAL32M_TRSTAT : 8;
};

/* 234 */
struct __XTALRDY_CTRL_REG
{
  unsigned __int16 BITFLD_XTALRDY_CNT : 8;
};

/* 235 */
struct __POR_PIN_REG
{
  unsigned __int16 BITFLD_POR_PIN_SELECT : 4;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_POR_PIN_POLARITY : 1;
};

/* 236 */
struct __POR_TIMER_REG
{
  unsigned __int16 BITFLD_POR_TIME : 7;
};

/* 237 */
struct __PMU_SLEEP_REG
{
  unsigned __int16 BITFLD_BG_REFRESH_INTERVAL : 12;
};

/* 238 */
struct __POWER_CTRL_REG
{
  unsigned __int16 BITFLD_CMP_VBAT_HIGH_NOK_ENABLE : 1;
  unsigned __int16 BITFLD_CMP_VBAT_HIGH_OK_ENABLE : 1;
  unsigned __int16 BITFLD_VBAT_HL_CONNECT : 1;
  unsigned __int16 BITFLD_LDO_CORE_RET_ENABLE : 1;
  unsigned __int16 BITFLD_LDO_CORE_DISABLE : 1;
  unsigned __int16 BITFLD_LDO_LOW_CTRL_REG : 2;
  unsigned __int16 BITFLD_LDO_VREF_HOLD_FORCE : 1;
  unsigned __int16 BITFLD_CP_DISABLE : 1;
  unsigned __int16 BITFLD_POR_VBAT_LOW_DISABLE : 1;
  unsigned __int16 BITFLD_POR_VBAT_LOW_HYST_SEL : 1;
  unsigned __int16 BITFLD_POR_VBAT_LOW_HYST_DIS : 1;
  unsigned __int16 BITFLD_POR_VBAT_HIGH_DISABLE : 1;
  unsigned __int16 BITFLD_POR_VBAT_HIGH_HYST_SEL : 1;
  unsigned __int16 BITFLD_POR_VBAT_HIGH_HYST_DIS : 1;
  unsigned __int16 BITFLD_VBAT_HL_CONNECT_MODE : 1;
};

/* 239 */
struct __DCDC_CTRL_REG
{
  unsigned __int16 BITFLD_DCDC_ENABLE : 1;
  unsigned __int16 BITFLD_DCDC_CLK_DIV : 2;
  unsigned __int16 BITFLD_DCDC_TIMEOUT : 3;
  unsigned __int16 BITFLD_DCDC_OK_CLR_CNT : 2;
  unsigned __int16 BITFLD_DCDC_ILIM_MIN : 4;
  unsigned __int16 BITFLD_DCDC_ILIM_MAX : 4;
};

/* 240 */
struct __HWR_CTRL_REG
{
  unsigned __int16 BITFLD_DISABLE_HWR : 1;
};

/* 241 */
struct __RESET_STAT_REG
{
  unsigned __int16 BITFLD_PORESET_STAT : 1;
  unsigned __int16 BITFLD_HWRESET_STAT : 1;
  unsigned __int16 BITFLD_SWRESET_STAT : 1;
  unsigned __int16 BITFLD_WDOGRESET_STAT : 1;
};

/* 242 */
struct __RAM_LPMX_REG
{
  unsigned __int16 BITFLD_RAMx_LPMX : 3;
};

/* 243 */
struct __PAD_LATCH_REG
{
  unsigned __int16 BITFLD_PAD_LATCH_EN : 1;
};

/* 244 */
struct __HIBERN_CTRL_REG
{
  unsigned __int16 BITFLD_HIBERNATION_ENABLE : 1;
  unsigned __int16 BITFLD_HIBERN_WKUP_POLARITY : 1;
  unsigned __int16 BITFLD_HIBERN_WKUP_MASK : 5;
};

/* 245 */
struct __DMA0_A_STARTL_REG
{
  unsigned __int16 BITFLD_DMA0_A_STARTL : 16;
};

/* 246 */
struct __DMA0_A_STARTH_REG
{
  unsigned __int16 BITFLD_DMA0_A_STARTH : 16;
};

/* 247 */
struct __DMA0_B_STARTL_REG
{
  unsigned __int16 BITFLD_DMA0_B_STARTL : 16;
};

/* 248 */
struct __DMA0_B_STARTH_REG
{
  unsigned __int16 BITFLD_DMA0_B_STARTH : 16;
};

/* 249 */
struct __DMA0_INT_REG
{
  unsigned __int16 BITFLD_DMA0_INT : 16;
};

/* 250 */
struct __DMA0_LEN_REG
{
  unsigned __int16 BITFLD_DMA0_LEN : 16;
};

/* 251 */
struct __DMA0_CTRL_REG
{
  unsigned __int16 BITFLD_DMA_ON : 1;
  unsigned __int16 BITFLD_BW : 2;
  unsigned __int16 BITFLD_IRQ_ENABLE : 1;
  unsigned __int16 BITFLD_DREQ_MODE : 1;
  unsigned __int16 BITFLD_BINC : 1;
  unsigned __int16 BITFLD_AINC : 1;
  unsigned __int16 BITFLD_CIRCULAR : 1;
  unsigned __int16 BITFLD_DMA_PRIO : 3;
  unsigned __int16 BITFLD_DMA_IDLE : 1;
  unsigned __int16 BITFLD_DMA_INIT : 1;
  unsigned __int16 BITFLD_REQ_SENSE : 1;
};

/* 252 */
struct __DMA0_IDX_REG
{
  unsigned __int16 BITFLD_DMA0_IDX : 16;
};

/* 253 */
struct __DMA1_A_STARTL_REG
{
  unsigned __int16 BITFLD_DMA1_A_STARTL : 16;
};

/* 254 */
struct __DMA1_A_STARTH_REG
{
  unsigned __int16 BITFLD_DMA1_A_STARTH : 16;
};

/* 255 */
struct __DMA1_B_STARTL_REG
{
  unsigned __int16 BITFLD_DMA1_B_STARTL : 16;
};

/* 256 */
struct __DMA1_B_STARTH_REG
{
  unsigned __int16 BITFLD_DMA1_B_STARTH : 16;
};

/* 257 */
struct __DMA1_INT_REG
{
  unsigned __int16 BITFLD_DMA1_INT : 16;
};

/* 258 */
struct __DMA1_LEN_REG
{
  unsigned __int16 BITFLD_DMA1_LEN : 16;
};

/* 259 */
struct __DMA1_CTRL_REG
{
  unsigned __int16 BITFLD_DMA_ON : 1;
  unsigned __int16 BITFLD_BW : 2;
  unsigned __int16 BITFLD_IRQ_ENABLE : 1;
  unsigned __int16 BITFLD_DREQ_MODE : 1;
  unsigned __int16 BITFLD_BINC : 1;
  unsigned __int16 BITFLD_AINC : 1;
  unsigned __int16 BITFLD_CIRCULAR : 1;
  unsigned __int16 BITFLD_DMA_PRIO : 3;
  unsigned __int16 BITFLD_DMA_IDLE : 1;
  unsigned __int16 BITFLD_DMA_INIT : 1;
  unsigned __int16 BITFLD_REQ_SENSE : 1;
};

/* 260 */
struct __DMA1_IDX_REG
{
  unsigned __int16 BITFLD_DMA1_IDX : 16;
};

/* 261 */
struct __DMA2_A_STARTL_REG
{
  unsigned __int16 BITFLD_DMA2_A_STARTL : 16;
};

/* 262 */
struct __DMA2_A_STARTH_REG
{
  unsigned __int16 BITFLD_DMA2_A_STARTH : 16;
};

