hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 263 */
struct __DMA2_B_STARTL_REG
{
  unsigned __int16 BITFLD_DMA2_B_STARTL : 16;
};

/* 264 */
struct __DMA2_B_STARTH_REG
{
  unsigned __int16 BITFLD_DMA2_B_STARTH : 16;
};

/* 265 */
struct __DMA2_INT_REG
{
  unsigned __int16 BITFLD_DMA2_INT : 16;
};

/* 266 */
struct __DMA2_LEN_REG
{
  unsigned __int16 BITFLD_DMA2_LEN : 16;
};

/* 267 */
struct __DMA2_CTRL_REG
{
  unsigned __int16 BITFLD_DMA_ON : 1;
  unsigned __int16 BITFLD_BW : 2;
  unsigned __int16 BITFLD_IRQ_ENABLE : 1;
  unsigned __int16 BITFLD_DREQ_MODE : 1;
  unsigned __int16 BITFLD_BINC : 1;
  unsigned __int16 BITFLD_AINC : 1;
  unsigned __int16 BITFLD_CIRCULAR : 1;
  unsigned __int16 BITFLD_DMA_PRIO : 3;
  unsigned __int16 BITFLD_DMA_IDLE : 1;
  unsigned __int16 BITFLD_DMA_INIT : 1;
  unsigned __int16 BITFLD_REQ_SENSE : 1;
};

/* 268 */
struct __DMA2_IDX_REG
{
  unsigned __int16 BITFLD_DMA2_IDX : 16;
};

/* 269 */
struct __DMA3_A_STARTL_REG
{
  unsigned __int16 BITFLD_DMA3_A_STARTL : 16;
};

/* 270 */
struct __DMA3_A_STARTH_REG
{
  unsigned __int16 BITFLD_DMA3_A_STARTH : 16;
};

/* 271 */
struct __DMA3_B_STARTL_REG
{
  unsigned __int16 BITFLD_DMA3_B_STARTL : 16;
};

/* 272 */
struct __DMA3_B_STARTH_REG
{
  unsigned __int16 BITFLD_DMA3_B_STARTH : 16;
};

/* 273 */
struct __DMA3_INT_REG
{
  unsigned __int16 BITFLD_DMA3_INT : 16;
};

/* 274 */
struct __DMA3_LEN_REG
{
  unsigned __int16 BITFLD_DMA3_LEN : 16;
};

/* 275 */
struct __DMA3_CTRL_REG
{
  unsigned __int16 BITFLD_DMA_ON : 1;
  unsigned __int16 BITFLD_BW : 2;
  unsigned __int16 BITFLD_IRQ_ENABLE : 1;
  unsigned __int16 BITFLD_DREQ_MODE : 1;
  unsigned __int16 BITFLD_BINC : 1;
  unsigned __int16 BITFLD_AINC : 1;
  unsigned __int16 BITFLD_CIRCULAR : 1;
  unsigned __int16 BITFLD_DMA_PRIO : 3;
  unsigned __int16 BITFLD_DMA_IDLE : 1;
  unsigned __int16 BITFLD_DMA_INIT : 1;
  unsigned __int16 BITFLD_REQ_SENSE : 1;
};

/* 276 */
struct __DMA3_IDX_REG
{
  unsigned __int16 BITFLD_DMA3_IDX : 16;
};

/* 277 */
struct __DMA_REQ_MUX_REG
{
  unsigned __int16 BITFLD_DMA01_SEL : 4;
  unsigned __int16 BITFLD_DMA23_SEL : 4;
  unsigned __int16 _anon_0 : 4;
};

/* 278 */
struct __DMA_INT_STATUS_REG
{
  unsigned __int16 BITFLD_DMA_IRQ_CH0 : 1;
  unsigned __int16 BITFLD_DMA_IRQ_CH1 : 1;
  unsigned __int16 BITFLD_DMA_IRQ_CH2 : 1;
  unsigned __int16 BITFLD_DMA_IRQ_CH3 : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 _anon_2 : 1;
  unsigned __int16 _anon_3 : 1;
};

/* 279 */
struct __DMA_CLEAR_INT_REG
{
  unsigned __int16 BITFLD_DMA_RST_IRQ_CH0 : 1;
  unsigned __int16 BITFLD_DMA_RST_IRQ_CH1 : 1;
  unsigned __int16 BITFLD_DMA_RST_IRQ_CH2 : 1;
  unsigned __int16 BITFLD_DMA_RST_IRQ_CH3 : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 _anon_2 : 1;
  unsigned __int16 _anon_3 : 1;
};

/* 280 */
struct __GP_ADC_CTRL2_REG
{
  unsigned __int16 BITFLD_GP_ADC_ATTN : 2;
  unsigned __int16 BITFLD_GP_ADC_I20U : 1;
  unsigned __int16 BITFLD_GP_ADC_OFFS_SH_EN : 1;
  unsigned __int16 BITFLD_GP_ADC_OFFS_SH_CM : 2;
  unsigned __int16 BITFLD_GP_ADC_CONV_NRS : 3;
  unsigned __int16 BITFLD_GP_ADC_SMPL_TIME : 4;
  unsigned __int16 BITFLD_GP_ADC_STORE_DEL : 3;
};

/* 281 */
struct __GP_ADC_CTRL3_REG
{
  unsigned __int16 BITFLD_GP_ADC_EN_DEL : 8;
  unsigned __int16 BITFLD_GP_ADC_INTERVAL : 8;
};

/* 282 */
struct __GP_ADC_OFFP_REG
{
  unsigned __int16 BITFLD_GP_ADC_OFFP : 10;
};

/* 283 */
struct __GP_ADC_OFFN_REG
{
  unsigned __int16 BITFLD_GP_ADC_OFFN : 10;
};

/* 284 */
struct __GP_ADC_TRIM_REG
{
  unsigned __int16 BITFLD_GP_ADC_OFFS_SH_VREF : 4;
  unsigned __int16 BITFLD_GP_ADC_LDO_LEVEL : 3;
};

/* 285 */
struct __GP_ADC_CLEAR_INT_REG
{
  unsigned __int16 BITFLD_GP_ADC_CLR_INT : 16;
};

/* 286 */
struct __GP_ADC_RESULT_REG
{
  unsigned __int16 BITFLD_GP_ADC_VAL : 16;
};

/* 287 */
struct __P0_DATA_REG
{
  unsigned __int16 BITFLD_P0_DATA : 12;
};

/* 288 */
struct __P0_SET_DATA_REG
{
  unsigned __int16 BITFLD_P0_SET : 12;
};

/* 289 */
struct __P0_RESET_DATA_REG
{
  unsigned __int16 BITFLD_P0_RESET : 12;
};

/* 290 */
struct __P00_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 291 */
struct __P01_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 292 */
struct __P02_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 293 */
struct __P03_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 294 */
struct __P04_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 295 */
struct __P05_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 296 */
struct __P06_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 297 */
struct __P07_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 298 */
struct __P08_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 299 */
struct __P09_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 300 */
struct __P010_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

/* 301 */
struct __P011_MODE_REG
{
  unsigned __int16 BITFLD_PID : 5;
  unsigned __int16 _anon_0 : 3;
  unsigned __int16 BITFLD_PUPD : 2;
};

