hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 302 */
struct __PAD_WEAK_CTRL_REG
{
  unsigned __int16 BITFLD_PAD_LOW_DRV : 12;
};

/* 303 */
struct __SET_FREEZE_REG
{
  unsigned __int16 BITFLD_FRZ_WKUPTIM : 1;
  unsigned __int16 BITFLD_FRZ_SWTIM : 1;
  unsigned __int16 BITFLD_FRZ_BLETIM : 1;
  unsigned __int16 BITFLD_FRZ_WDOG : 1;
  unsigned __int16 BITFLD_FRZ_DMA : 1;
};

/* 304 */
struct __RESET_FREEZE_REG
{
  unsigned __int16 BITFLD_FRZ_WKUPTIM : 1;
  unsigned __int16 BITFLD_FRZ_SWTIM : 1;
  unsigned __int16 BITFLD_FRZ_BLETIM : 1;
  unsigned __int16 BITFLD_FRZ_WDOG : 1;
  unsigned __int16 BITFLD_FRZ_DMA : 1;
};

/* 305 */
struct __DEBUG_REG
{
  unsigned __int16 BITFLD_DEBUGS_FREEZE_EN : 1;
};

/* 306 */
struct __GP_STATUS_REG
{
  unsigned __int16 BITFLD_CAL_PHASE : 1;
  unsigned __int16 _anon_0 : 1;
};

/* 307 */
struct __GP_CONTROL_REG
{
  unsigned __int16 BITFLD_BLE_WAKEUP_REQ : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_BLE_WAKEUP_LP_IRQ : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 BITFLD_CPU_DMA_BUS_PRIO : 1;
  unsigned __int16 BITFLD_BLE_TIMER_DATA_CTRL : 2;
};

/* 308 */
struct __BLE_TIMER_REG
{
  unsigned __int16 BITFLD_BLE_TIMER_DATA : 10;
};

/* 309 */
struct __I2C_CON_REG
{
  unsigned __int16 BITFLD_I2C_MASTER_MODE : 1;
  unsigned __int16 BITFLD_I2C_SPEED : 2;
  unsigned __int16 BITFLD_I2C_10BITADDR_SLAVE : 1;
  unsigned __int16 BITFLD_I2C_10BITADDR_MASTER : 1;
  unsigned __int16 BITFLD_I2C_RESTART_EN : 1;
  unsigned __int16 BITFLD_I2C_SLAVE_DISABLE : 1;
};

/* 310 */
struct __I2C_TAR_REG
{
  unsigned __int16 BITFLD_IC_TAR : 10;
  unsigned __int16 BITFLD_GC_OR_START : 1;
  unsigned __int16 BITFLD_SPECIAL : 1;
};

/* 311 */
struct __I2C_SAR_REG
{
  unsigned __int16 BITFLD_IC_SAR : 10;
};

/* 312 */
struct __I2C_DATA_CMD_REG
{
  unsigned __int16 BITFLD_DAT : 8;
  unsigned __int16 BITFLD_I2C_CMD : 1;
  unsigned __int16 BITFLD_I2C_STOP : 1;
  unsigned __int16 BITFLD_I2C_RESTART : 1;
};

/* 313 */
struct __I2C_SS_SCL_HCNT_REG
{
  unsigned __int16 BITFLD_IC_SS_SCL_HCNT : 16;
};

/* 314 */
struct __I2C_SS_SCL_LCNT_REG
{
  unsigned __int16 BITFLD_IC_SS_SCL_LCNT : 16;
};

/* 315 */
struct __I2C_FS_SCL_HCNT_REG
{
  unsigned __int16 BITFLD_IC_FS_SCL_HCNT : 16;
};

/* 316 */
struct __I2C_FS_SCL_LCNT_REG
{
  unsigned __int16 BITFLD_IC_FS_SCL_LCNT : 16;
};

/* 317 */
struct __I2C_INTR_STAT_REG
{
  unsigned __int16 BITFLD_R_RX_UNDER : 1;
  unsigned __int16 BITFLD_R_RX_OVER : 1;
  unsigned __int16 BITFLD_R_RX_FULL : 1;
  unsigned __int16 BITFLD_R_TX_OVER : 1;
  unsigned __int16 BITFLD_R_TX_EMPTY : 1;
  unsigned __int16 BITFLD_R_RD_REQ : 1;
  unsigned __int16 BITFLD_R_TX_ABRT : 1;
  unsigned __int16 BITFLD_R_RX_DONE : 1;
  unsigned __int16 BITFLD_R_ACTIVITY : 1;
  unsigned __int16 BITFLD_R_STOP_DET : 1;
  unsigned __int16 BITFLD_R_START_DET : 1;
  unsigned __int16 BITFLD_R_GEN_CALL : 1;
};

/* 318 */
struct __I2C_INTR_MASK_REG
{
  unsigned __int16 BITFLD_M_RX_UNDER : 1;
  unsigned __int16 BITFLD_M_RX_OVER : 1;
  unsigned __int16 BITFLD_M_RX_FULL : 1;
  unsigned __int16 BITFLD_M_TX_OVER : 1;
  unsigned __int16 BITFLD_M_TX_EMPTY : 1;
  unsigned __int16 BITFLD_M_RD_REQ : 1;
  unsigned __int16 BITFLD_M_TX_ABRT : 1;
  unsigned __int16 BITFLD_M_RX_DONE : 1;
  unsigned __int16 BITFLD_M_ACTIVITY : 1;
  unsigned __int16 BITFLD_M_STOP_DET : 1;
  unsigned __int16 BITFLD_M_START_DET : 1;
  unsigned __int16 BITFLD_M_GEN_CALL : 1;
};

/* 319 */
struct __I2C_RAW_INTR_STAT_REG
{
  unsigned __int16 BITFLD_RX_UNDER : 1;
  unsigned __int16 BITFLD_RX_OVER : 1;
  unsigned __int16 BITFLD_RX_FULL : 1;
  unsigned __int16 BITFLD_TX_OVER : 1;
  unsigned __int16 BITFLD_TX_EMPTY : 1;
  unsigned __int16 BITFLD_RD_REQ : 1;
  unsigned __int16 BITFLD_TX_ABRT : 1;
  unsigned __int16 BITFLD_RX_DONE : 1;
  unsigned __int16 BITFLD_ACTIVITY : 1;
  unsigned __int16 BITFLD_STOP_DET : 1;
  unsigned __int16 BITFLD_START_DET : 1;
  unsigned __int16 BITFLD_GEN_CALL : 1;
};

/* 320 */
struct __I2C_RX_TL_REG
{
  unsigned __int16 BITFLD_RX_TL : 5;
};

/* 321 */
struct __I2C_TX_TL_REG
{
  unsigned __int16 BITFLD_RX_TL : 5;
};

/* 322 */
struct __I2C_CLR_INTR_REG
{
  unsigned __int16 BITFLD_CLR_INTR : 1;
};

/* 323 */
struct __I2C_CLR_RX_UNDER_REG
{
  unsigned __int16 BITFLD_CLR_RX_UNDER : 1;
};

/* 324 */
struct __I2C_CLR_RX_OVER_REG
{
  unsigned __int16 BITFLD_CLR_RX_OVER : 1;
};

/* 325 */
struct __I2C_CLR_TX_OVER_REG
{
  unsigned __int16 BITFLD_CLR_TX_OVER : 1;
};

/* 326 */
struct __I2C_CLR_RD_REQ_REG
{
  unsigned __int16 BITFLD_CLR_RD_REQ : 1;
};

/* 327 */
struct __I2C_CLR_TX_ABRT_REG
{
  unsigned __int16 BITFLD_CLR_TX_ABRT : 1;
};

/* 328 */
struct __I2C_CLR_RX_DONE_REG
{
  unsigned __int16 BITFLD_CLR_RX_DONE : 1;
};

/* 329 */
struct __I2C_CLR_ACTIVITY_REG
{
  unsigned __int16 BITFLD_CLR_ACTIVITY : 1;
};

/* 330 */
struct __I2C_CLR_STOP_DET_REG
{
  unsigned __int16 BITFLD_CLR_STOP_DET : 1;
};

/* 331 */
struct __I2C_CLR_START_DET_REG
{
  unsigned __int16 BITFLD_CLR_START_DET : 1;
};

/* 332 */
struct __I2C_CLR_GEN_CALL_REG
{
  unsigned __int16 BITFLD_CLR_GEN_CALL : 1;
};

/* 333 */
struct __I2C_ENABLE_REG
{
  unsigned __int16 BITFLD_CTRL_ENABLE : 1;
  unsigned __int16 BITFLD_I2C_ABORT : 1;
};

/* 334 */
struct __I2C_STATUS_REG
{
  unsigned __int16 BITFLD_I2C_ACTIVITY : 1;
  unsigned __int16 BITFLD_TFNF : 1;
  unsigned __int16 BITFLD_TFE : 1;
  unsigned __int16 BITFLD_RFNE : 1;
  unsigned __int16 BITFLD_RFF : 1;
  unsigned __int16 BITFLD_MST_ACTIVITY : 1;
  unsigned __int16 BITFLD_SLV_ACTIVITY : 1;
};

/* 335 */
struct __I2C_TXFLR_REG
{
  unsigned __int16 BITFLD_TXFLR : 6;
};

/* 336 */
struct __I2C_RXFLR_REG
{
  unsigned __int16 BITFLD_RXFLR : 6;
};

/* 337 */
struct __I2C_SDA_HOLD_REG
{
  unsigned __int16 BITFLD_IC_SDA_HOLD : 16;
};

/* 338 */
struct __I2C_TX_ABRT_SOURCE_REG
{
  unsigned __int16 BITFLD_ABRT_7B_ADDR_NOACK : 1;
  unsigned __int16 BITFLD_ABRT_10ADDR1_NOACK : 1;
  unsigned __int16 BITFLD_ABRT_10ADDR2_NOACK : 1;
  unsigned __int16 BITFLD_ABRT_TXDATA_NOACK : 1;
  unsigned __int16 BITFLD_ABRT_GCALL_NOACK : 1;
  unsigned __int16 BITFLD_ABRT_GCALL_READ : 1;
  unsigned __int16 BITFLD_ABRT_HS_ACKDET : 1;
  unsigned __int16 BITFLD_ABRT_SBYTE_ACKDET : 1;
  unsigned __int16 BITFLD_ABRT_HS_NORSTRT : 1;
  unsigned __int16 BITFLD_ABRT_SBYTE_NORSTRT : 1;
  unsigned __int16 BITFLD_ABRT_10B_RD_NORSTRT : 1;
  unsigned __int16 BITFLD_ABRT_MASTER_DIS : 1;
  unsigned __int16 BITFLD_ARB_LOST : 1;
  unsigned __int16 BITFLD_ABRT_SLVFLUSH_TXFIFO : 1;
  unsigned __int16 BITFLD_ABRT_SLV_ARBLOST : 1;
  unsigned __int16 BITFLD_ABRT_SLVRD_INTX : 1;
};

/* 339 */
struct __I2C_DMA_CR_REG
{
  unsigned __int16 BITFLD_RDMAE : 1;
  unsigned __int16 BITFLD_TDMAE : 1;
};

/* 340 */
struct __I2C_DMA_TDLR_REG
{
  unsigned __int16 BITFLD_DMATDL : 5;
};

/* 341 */
struct __I2C_DMA_RDLR_REG
{
  unsigned __int16 BITFLD_DMARDL : 5;
};

