hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 342 */
struct __I2C_SDA_SETUP_REG
{
  unsigned __int16 BITFLD_SDA_SETUP : 8;
};

/* 343 */
struct __I2C_ACK_GENERAL_CALL_REG
{
  unsigned __int16 BITFLD_ACK_GEN_CALL : 1;
};

/* 344 */
struct __I2C_ENABLE_STATUS_REG
{
  unsigned __int16 BITFLD_IC_EN : 1;
  unsigned __int16 BITFLD_SLV_DISABLED_WHILE_BUSY : 1;
  unsigned __int16 BITFLD_SLV_RX_DATA_LOST : 1;
};

/* 345 */
struct __I2C_IC_FS_SPKLEN_REG
{
  unsigned __int16 BITFLD_IC_FS_SPKLEN : 8;
};

/* 346 */
struct __I2C_COMP_PARAM1_REG
{
  unsigned __int16 BITFLD_IC_COMP_PARAM1 : 16;
};

/* 347 */
struct __I2C_COMP_PARAM2_REG
{
  unsigned __int16 BITFLD_IC_COMP_PARAM2 : 16;
};

/* 348 */
struct __I2C_COMP_VERSION_REG
{
  unsigned __int16 BITFLD_IC_COMP_VERSION : 16;
};

/* 349 */
struct __I2C_COMP2_VERSION
{
  unsigned __int16 BITFLD_IC_COMP2_VERSION : 16;
};

/* 350 */
struct __I2C_COMP_TYPE_REG
{
  unsigned __int16 BITFLD_IC_COMP_TYPE : 16;
};

/* 351 */
struct __I2C_COMP_TYPE2_REG
{
  unsigned __int16 BITFLD_IC_COMP2_TYPE : 16;
};

/* 352 */
struct __GPIO_IRQ0_IN_SEL_REG
{
  unsigned __int16 BITFLD_KBRD_IRQ0_SEL : 4;
  unsigned __int16 _anon_0 : 2;
};

/* 353 */
struct __GPIO_IRQ1_IN_SEL_REG
{
  unsigned __int16 BITFLD_KBRD_IRQ1_SEL : 4;
  unsigned __int16 _anon_0 : 2;
};

/* 354 */
struct __GPIO_IRQ2_IN_SEL_REG
{
  unsigned __int16 BITFLD_KBRD_IRQ2_SEL : 4;
  unsigned __int16 _anon_0 : 2;
};

/* 355 */
struct __GPIO_IRQ3_IN_SEL_REG
{
  unsigned __int16 BITFLD_KBRD_IRQ3_SEL : 4;
  unsigned __int16 _anon_0 : 2;
};

/* 356 */
struct __GPIO_IRQ4_IN_SEL_REG
{
  unsigned __int16 BITFLD_KBRD_IRQ4_SEL : 4;
  unsigned __int16 _anon_0 : 2;
};

/* 357 */
struct __GPIO_DEBOUNCE_REG
{
  unsigned __int16 BITFLD_DEB_VALUE : 6;
  unsigned __int16 BITFLD_DEB_ENABLE0 : 1;
  unsigned __int16 BITFLD_DEB_ENABLE1 : 1;
  unsigned __int16 BITFLD_DEB_ENABLE2 : 1;
  unsigned __int16 BITFLD_DEB_ENABLE3 : 1;
  unsigned __int16 BITFLD_DEB_ENABLE4 : 1;
  unsigned __int16 BITFLD_DEB_ENABLE_KBRD : 1;
};

/* 358 */
struct __GPIO_RESET_IRQ_REG
{
  unsigned __int16 BITFLD_RESET_GPIO0_IRQ : 1;
  unsigned __int16 BITFLD_RESET_GPIO1_IRQ : 1;
  unsigned __int16 BITFLD_RESET_GPIO2_IRQ : 1;
  unsigned __int16 BITFLD_RESET_GPIO3_IRQ : 1;
  unsigned __int16 BITFLD_RESET_GPIO4_IRQ : 1;
  unsigned __int16 BITFLD_RESET_KBRD_IRQ : 1;
};

/* 359 */
struct __GPIO_INT_LEVEL_CTRL_REG
{
  unsigned __int16 BITFLD_INPUT_LEVEL0 : 1;
  unsigned __int16 BITFLD_INPUT_LEVEL1 : 1;
  unsigned __int16 BITFLD_INPUT_LEVEL2 : 1;
  unsigned __int16 BITFLD_INPUT_LEVEL3 : 1;
  unsigned __int16 BITFLD_INPUT_LEVEL4 : 1;
  unsigned __int16 BITFLD_EDGE_LEVELn0 : 1;
  unsigned __int16 BITFLD_EDGE_LEVELn1 : 1;
  unsigned __int16 BITFLD_EDGE_LEVELn2 : 1;
  unsigned __int16 BITFLD_EDGE_LEVELn3 : 1;
  unsigned __int16 BITFLD_EDGE_LEVELn4 : 1;
};

/* 360 */
struct __KBRD_IRQ_IN_SEL0_REG
{
  unsigned __int16 BITFLD_KBRD_P00_EN : 1;
  unsigned __int16 BITFLD_KBRD_P01_EN : 1;
  unsigned __int16 BITFLD_KBRD_P02_EN : 1;
  unsigned __int16 BITFLD_KBRD_P03_EN : 1;
  unsigned __int16 BITFLD_KBRD_P04_EN : 1;
  unsigned __int16 BITFLD_KBRD_P05_EN : 1;
  unsigned __int16 BITFLD_KBRD_P06_EN : 1;
  unsigned __int16 BITFLD_KBRD_P07_EN : 1;
  unsigned __int16 BITFLD_KBRD_P08_EN : 1;
  unsigned __int16 BITFLD_KBRD_P09_EN : 1;
  unsigned __int16 BITFLD_KBRD_P10_EN : 1;
  unsigned __int16 BITFLD_KBRD_P11_EN : 1;
};

/* 361 */
struct __KBRD_CTRL_REG
{
  unsigned __int16 BITFLD_KEY_REPEAT : 6;
  unsigned __int16 BITFLD_KBRD_LEVEL : 1;
  unsigned __int16 BITFLD_KBRD_REL : 1;
};

/* 362 */
struct __OTPC_MODE_REG
{
  unsigned __int32 BITFLD_OTPC_MODE_MODE : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_OTPC_MODE_USE_TST_ROW : 1;
  unsigned __int32 BITFLD_OTPC_MODE_HT_MARG_EN : 1;
  unsigned __int32 BITFLD_OTPC_MODE_PRG_SEL : 2;
};

/* 363 */
struct __OTPC_STAT_REG
{
  unsigned __int32 BITFLD_OTPC_STAT_PRDY : 1;
  unsigned __int32 BITFLD_OTPC_STAT_PBUF_EMPTY : 1;
  unsigned __int32 BITFLD_OTPC_STAT_MRDY : 1;
};

/* 364 */
struct __OTPC_PADDR_REG
{
  unsigned __int32 BITFLD_OTPC_PADDR : 13;
};

/* 365 */
struct __OTPC_PWORD_REG
{
  unsigned __int32 BITFLD_OTPC_PWORD : 32;
};

/* 366 */
struct __OTPC_TIM1_REG
{
  unsigned __int32 BITFLD_OTPC_TIM1_CC_T_1US : 7;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_OTPC_TIM1_CC_T_20NS : 2;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_OTPC_TIM1_CC_T_RD : 3;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 BITFLD_OTPC_TIM1_US_T_PL : 4;
  unsigned __int32 BITFLD_OTPC_TIM1_US_T_CS : 4;
  unsigned __int32 BITFLD_OTPC_TIM1_US_T_CSP : 7;
};

/* 367 */
struct __OTPC_TIM2_REG
{
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_PW : 5;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_PWI : 3;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_PPR : 7;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_PPS : 5;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_VDS : 3;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_PPH : 5;
  unsigned __int32 BITFLD_OTPC_TIM2_US_T_SAS : 2;
  unsigned __int32 BITFLD_OTPC_TIM2_US_ADD_CC_EN : 1;
};

/* 368 */
struct __OTPC_AHBADR_REG
{
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_OTPC_AHBADR : 14;
};

/* 369 */
struct __OTPC_CELADR_REG
{
  unsigned __int32 BITFLD_OTPC_CELADR : 13;
};

/* 370 */
struct __OTPC_NWORDS_REG
{
  unsigned __int32 BITFLD_OTPC_NWORDS : 13;
};

/* 371 */
struct __QDEC_CTRL_REG
{
  unsigned __int16 BITFLD_QDEC_IRQ_ENABLE : 1;
  unsigned __int16 BITFLD_QDEC_EVENT_CNT_CLR : 1;
  unsigned __int16 BITFLD_QDEC_IRQ_STATUS : 1;
  unsigned __int16 BITFLD_QDEC_IRQ_THRES : 8;
};

/* 372 */
struct __QDEC_XCNT_REG
{
  unsigned __int16 BITFLD_QDEC_X_CNT : 16;
};

/* 373 */
struct __QDEC_YCNT_REG
{
  unsigned __int16 BITFLD_QDEC_Y_CNT : 16;
};

/* 374 */
struct __QDEC_CLOCKDIV_REG
{
  unsigned __int16 BITFLD_QDEC_CLOCKDIV : 10;
  unsigned __int16 BITFLD_QDEC_PRESCALER_EN : 1;
};

/* 375 */
struct __QDEC_CTRL2_REG
{
  unsigned __int16 BITFLD_QDEC_CHX_PORT_SEL : 3;
  unsigned __int16 BITFLD_QDEC_CHY_PORT_SEL : 3;
  unsigned __int16 BITFLD_QDEC_CHZ_PORT_SEL : 3;
  unsigned __int16 BITFLD_QDEC_CHX_EVENT_MODE : 1;
  unsigned __int16 BITFLD_QDEC_CHY_EVENT_MODE : 1;
  unsigned __int16 BITFLD_QDEC_CHZ_EVENT_MODE : 1;
};

/* 376 */
struct __QDEC_ZCNT_REG
{
  unsigned __int16 BITFLD_QDEC_Z_CNT : 16;
};

/* 377 */
struct __QDEC_EVENT_CNT_REG
{
  unsigned __int16 BITFLD_QDEC_EVENT_CNT : 8;
};

