hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 378 */
struct __RTC_CONTROL_REG
{
  unsigned __int32 BITFLD_RTC_TIME_DISABLE : 1;
  unsigned __int32 BITFLD_RTC_CAL_DISABLE : 1;
};

/* 379 */
struct __RTC_HOUR_MODE_REG
{
  unsigned __int32 BITFLD_RTC_HMS : 1;
};

/* 380 */
struct __RTC_TIME_REG
{
  unsigned __int32 BITFLD_RTC_TIME_H_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_H_T : 4;
  unsigned __int32 BITFLD_RTC_TIME_S_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_S_T : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_RTC_TIME_M_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_M_T : 3;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_RTC_TIME_HR_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_HR_T : 2;
  unsigned __int32 BITFLD_RTC_TIME_PM : 1;
  unsigned __int32 BITFLD_RTC_TIME_CH : 1;
};

/* 381 */
struct __RTC_CALENDAR_REG
{
  unsigned __int32 BITFLD_RTC_DAY : 3;
  unsigned __int32 BITFLD_RTC_CAL_M_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_M_T : 1;
  unsigned __int32 BITFLD_RTC_CAL_D_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_D_T : 2;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_RTC_CAL_Y_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_Y_T : 4;
  unsigned __int32 BITFLD_RTC_CAL_C_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_C_T : 2;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_RTC_CAL_CH : 1;
};

/* 382 */
struct __RTC_TIME_ALARM_REG
{
  unsigned __int32 BITFLD_RTC_TIME_H_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_H_T : 4;
  unsigned __int32 BITFLD_RTC_TIME_S_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_S_T : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_RTC_TIME_M_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_M_T : 3;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_RTC_TIME_HR_U : 4;
  unsigned __int32 BITFLD_RTC_TIME_HR_T : 2;
  unsigned __int32 BITFLD_RTC_TIME_PM : 1;
};

/* 383 */
struct __RTC_CALENDAR_ALARM_REG
{
  unsigned __int32 _anon_0 : 3;
  unsigned __int32 BITFLD_RTC_CAL_M_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_M_T : 1;
  unsigned __int32 BITFLD_RTC_CAL_D_U : 4;
  unsigned __int32 BITFLD_RTC_CAL_D_T : 2;
};

/* 384 */
struct __RTC_ALARM_ENABLE_REG
{
  unsigned __int32 BITFLD_RTC_ALARM_HOS_EN : 1;
  unsigned __int32 BITFLD_RTC_ALARM_SEC_EN : 1;
  unsigned __int32 BITFLD_RTC_ALARM_MIN_EN : 1;
  unsigned __int32 BITFLD_RTC_ALARM_HOUR_EN : 1;
  unsigned __int32 BITFLD_RTC_ALARM_DATE_EN : 1;
  unsigned __int32 BITFLD_RTC_ALARM_MNTH_EN : 1;
};

/* 385 */
struct __RTC_EVENT_FLAGS_REG
{
  unsigned __int32 BITFLD_RTC_EVENT_HOS : 1;
  unsigned __int32 BITFLD_RTC_EVENT_SEC : 1;
  unsigned __int32 BITFLD_RTC_EVENT_MIN : 1;
  unsigned __int32 BITFLD_RTC_EVENT_HOUR : 1;
  unsigned __int32 BITFLD_RTC_EVENT_DATE : 1;
  unsigned __int32 BITFLD_RTC_EVENT_MNTH : 1;
  unsigned __int32 BITFLD_RTC_EVENT_ALRM : 1;
};

/* 386 */
struct __RTC_INTERRUPT_ENABLE_REG
{
  unsigned __int32 BITFLD_RTC_HOS_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_SEC_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_MIN_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_HOUR_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_DATE_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_MNTH_INT_EN : 1;
  unsigned __int32 BITFLD_RTC_ALRM_INT_EN : 1;
};

/* 387 */
struct __RTC_INTERRUPT_DISABLE_REG
{
  unsigned __int32 BITFLD_RTC_HOS_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_SEC_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_MIN_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_HOUR_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_DATE_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_MNTH_INT_DIS : 1;
  unsigned __int32 BITFLD_RTC_ALRM_INT_DIS : 1;
};

/* 388 */
struct __RTC_INTERRUPT_MASK_REG
{
  unsigned __int32 BITFLD_RTC_HOS_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_SEC_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_MIN_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_HOUR_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_DATE_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_MNTH_INT_MSK : 1;
  unsigned __int32 BITFLD_RTC_ALRM_INT_MSK : 1;
};

/* 389 */
struct __RTC_STATUS_REG
{
  unsigned __int32 BITFLD_RTC_VALID_TIME : 1;
  unsigned __int32 BITFLD_RTC_VALID_CAL : 1;
  unsigned __int32 BITFLD_RTC_VALID_TIME_ALM : 1;
  unsigned __int32 BITFLD_RTC_VALID_CAL_ALM : 1;
};

/* 390 */
struct __RTC_KEEP_RTC_REG
{
  unsigned __int32 BITFLD_RTC_KEEP : 1;
};

/* 391 */
struct __SPI_CTRL_REG
{
  unsigned __int16 BITFLD_SPI_EN : 1;
  unsigned __int16 BITFLD_SPI_TX_EN : 1;
  unsigned __int16 BITFLD_SPI_RX_EN : 1;
  unsigned __int16 BITFLD_SPI_DMA_TX_EN : 1;
  unsigned __int16 BITFLD_SPI_DMA_RX_EN : 1;
  unsigned __int16 BITFLD_SPI_FIFO_RESET : 1;
  unsigned __int16 BITFLD_SPI_CAPTURE_AT_NEXT_EDGE : 1;
  unsigned __int16 BITFLD_SPI_SWAP_BYTES : 1;
};

/* 392 */
struct __SPI_CONFIG_REG
{
  unsigned __int16 BITFLD_SPI_MODE : 2;
  unsigned __int16 BITFLD_SPI_WORD_LENGTH : 5;
  unsigned __int16 BITFLD_SPI_SLAVE_EN : 1;
};

/* 393 */
struct __SPI_CLOCK_REG
{
  unsigned __int16 BITFLD_SPI_CLK_DIV : 7;
  unsigned __int16 BITFLD_SPI_MASTER_CLK_MODE : 1;
};

/* 394 */
struct __SPI_FIFO_CONFIG_REG
{
  unsigned __int16 BITFLD_SPI_TX_TL : 4;
  unsigned __int16 BITFLD_SPI_RX_TL : 4;
};

/* 395 */
struct __SPI_IRQ_MASK_REG
{
  unsigned __int16 BITFLD_SPI_IRQ_MASK_TX_EMPTY : 1;
  unsigned __int16 BITFLD_SPI_IRQ_MASK_RX_FULL : 1;
};

/* 396 */
struct __SPI_STATUS_REG
{
  unsigned __int16 BITFLD_SPI_STATUS_TX_EMPTY : 1;
  unsigned __int16 BITFLD_SPI_STATUS_RX_FULL : 1;
};

/* 397 */
struct __SPI_FIFO_STATUS_REG
{
  unsigned __int16 BITFLD_SPI_RX_FIFO_LEVEL : 6;
  unsigned __int16 BITFLD_SPI_TX_FIFO_LEVEL : 6;
  unsigned __int16 BITFLD_SPI_STATUS_RX_EMPTY : 1;
  unsigned __int16 BITFLD_SPI_STATUS_TX_FULL : 1;
  unsigned __int16 BITFLD_SPI_RX_FIFO_OVFL : 1;
  unsigned __int16 BITFLD_SPI_TRANSACTION_ACTIVE : 1;
};

/* 398 */
struct __SPI_FIFO_READ_REG
{
  unsigned __int16 BITFLD_SPI_FIFO_READ : 16;
};

/* 399 */
struct __SPI_FIFO_WRITE_REG
{
  unsigned __int16 BITFLD_SPI_FIFO_WRITE : 16;
};

/* 400 */
struct __SPI_CS_CONFIG_REG
{
  unsigned __int16 BITFLD_SPI_CS_SELECT : 3;
};

/* 401 */
struct __SPI_FIFO_HIGH_REG
{
  unsigned __int16 BITFLD_SPI_FIFO_HIGH : 16;
};

