hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 402 */
struct __SPI_TXBUFFER_FORCE_L_REG
{
  unsigned __int16 BITFLD_SPI_TXBUFFER_FORCE_L : 16;
};

/* 403 */
struct __SPI_TXBUFFER_FORCE_H_REG
{
  unsigned __int16 BITFLD_SPI_TXBUFFER_FORCE_H : 16;
};

/* 404 */
struct __TIMER0_CTRL_REG
{
  unsigned __int16 BITFLD_TIM0_CTRL : 1;
  unsigned __int16 BITFLD_TIM0_CLK_SEL : 1;
  unsigned __int16 BITFLD_TIM0_CLK_DIV : 1;
  unsigned __int16 BITFLD_PWM_MODE : 1;
};

/* 405 */
struct __TIMER0_ON_REG
{
  unsigned __int16 BITFLD_TIM0_ON : 16;
};

/* 406 */
struct __TIMER0_RELOAD_M_REG
{
  unsigned __int16 BITFLD_TIM0_M : 16;
};

/* 407 */
struct __TIMER0_RELOAD_N_REG
{
  unsigned __int16 BITFLD_TIM0_N : 16;
};

/* 408 */
struct __TRIPLE_PWM_FREQUENCY
{
  unsigned __int16 BITFLD_PWM_FREQ : 14;
};

/* 409 */
struct __PWM2_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 410 */
struct __PWM3_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 411 */
struct __PWM4_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 412 */
struct __PWM5_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 413 */
struct __PWM6_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 414 */
struct __PWM7_START_CYCLE
{
  unsigned __int16 BITFLD_START_CYCLE : 14;
};

/* 415 */
struct __PWM2_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 416 */
struct __PWM3_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 417 */
struct __PWM4_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 418 */
struct __PWM5_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 419 */
struct __PWM6_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 420 */
struct __PWM7_END_CYCLE
{
  unsigned __int16 BITFLD_END_CYCLE : 14;
};

/* 421 */
struct __TRIPLE_PWM_CTRL_REG
{
  unsigned __int16 BITFLD_TRIPLE_PWM_ENABLE : 1;
  unsigned __int16 BITFLD_SW_PAUSE_EN : 1;
  unsigned __int16 BITFLD_HW_PAUSE_EN : 1;
  unsigned __int16 BITFLD_TRIPLE_PWM_CLK_SEL : 1;
};

/* 422 */
struct __TIMER1_CTRL_REG
{
  unsigned __int32 BITFLD_TIMER1_RELOAD : 11;
  unsigned __int32 BITFLD_TIMER1_ENABLE : 1;
  unsigned __int32 BITFLD_TIMER1_COUNT_DOWN_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IRQ_EN : 1;
  unsigned __int32 BITFLD_TIMER1_FREE_RUN_MODE_EN : 1;
  unsigned __int32 BITFLD_TIMER1_USE_SYS_CLK : 1;
  unsigned __int32 BITFLD_TIMER1_CLK_EN : 1;
};

/* 423 */
struct __TIMER1_CAPTURE_REG
{
  unsigned __int32 BITFLD_TIMER1_GPIO1_CONF : 4;
  unsigned __int32 BITFLD_TIMER1_IN1_EVENT_FALL_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN1_COUNT_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN1_IRQ_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN1_PERIOD_MAX : 6;
  unsigned __int32 BITFLD_TIMER1_IN1_STAMP_TYPE : 1;
  unsigned __int32 BITFLD_TIMER1_GPIO2_CONF : 4;
  unsigned __int32 BITFLD_TIMER1_IN2_EVENT_FALL_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN2_COUNT_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN2_IRQ_EN : 1;
  unsigned __int32 BITFLD_TIMER1_IN2_PERIOD_MAX : 6;
  unsigned __int32 BITFLD_TIMER1_IN2_STAMP_TYPE : 1;
};

/* 424 */
struct __TIMER1_STATUS_REG
{
  unsigned __int32 BITFLD_TIMER1_TIMER_VALUE : 11;
  unsigned __int32 BITFLD_TIMER1_TIMER_EVENT : 1;
  unsigned __int32 BITFLD_TIMER1_IN1_EVENT : 1;
  unsigned __int32 BITFLD_TIMER1_IN2_EVENT : 1;
  unsigned __int32 BITFLD_TIMER1_IN1_OVRFLW : 1;
  unsigned __int32 BITFLD_TIMER1_IN2_OVRFLW : 1;
};

/* 425 */
struct __TIMER1_CAPCNT1_VALUE_REG
{
  unsigned __int32 BITFLD_TIMER1_CAPCNT1_VALUE : 11;
  unsigned __int32 BITFLD_TIMER1_CAPCNT1_RTC_HIGH : 11;
};

/* 426 */
struct __TIMER1_CAPCNT2_VALUE_REG
{
  unsigned __int32 BITFLD_TIMER1_CAPCNT2_VALUE : 11;
  unsigned __int32 BITFLD_TIMER1_CAPCNT2_RTC_HIGH : 11;
};

/* 427 */
struct __TIMER1_CLR_EVENT_REG
{
  unsigned __int32 BITFLD_TIMER1_CLR_TIMER_EVENT : 1;
  unsigned __int32 BITFLD_TIMER1_CLR_IN1_EVENT : 1;
  unsigned __int32 BITFLD_TIMER1_CLR_IN2_EVENT : 1;
};

/* 428 */
struct __UART_RBR_THR_DLL_REG
{
  unsigned __int16 BITFLD_RBR_THR_DLL : 8;
};

/* 429 */
struct __UART_IER_DLH_REG
{
  unsigned __int16 BITFLD_ERBFI_dlh0 : 1;
  unsigned __int16 BITFLD_ETBEI_dlh1 : 1;
  unsigned __int16 BITFLD_ELSI_dhl2 : 1;
  unsigned __int16 BITFLD_EDSSI_dlh3 : 1;
  unsigned __int16 BITFLD_dlh6_4 : 3;
  unsigned __int16 BITFLD_PTIME_dlh7 : 1;
};

/* 430 */
struct __UART_IIR_FCR_REG
{
  unsigned __int16 BITFLD_UART_IID0_FIFOE : 1;
  unsigned __int16 BITFLD_UART_IID1_RFIFOE : 1;
  unsigned __int16 BITFLD_UART_IID2_XFIFOR : 1;
  unsigned __int16 BITFLD_UART_IID3_DMAM : 1;
  unsigned __int16 BITFLD_UART_TET : 2;
  unsigned __int16 BITFLD_UART_FIFOSE_RT : 2;
};

/* 431 */
struct __UART_LCR_REG
{
  unsigned __int16 BITFLD_UART_DLS : 2;
  unsigned __int16 BITFLD_UART_STOP : 1;
  unsigned __int16 BITFLD_UART_PEN : 1;
  unsigned __int16 BITFLD_UART_EPS : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_UART_BC : 1;
  unsigned __int16 BITFLD_UART_DLAB : 1;
};

/* 432 */
struct __UART_MCR_REG
{
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_UART_RTS : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 _anon_2 : 1;
  unsigned __int16 BITFLD_UART_LB : 1;
  unsigned __int16 BITFLD_UART_AFCE : 1;
  unsigned __int16 _anon_3 : 1;
};

/* 433 */
struct __UART_LSR_REG
{
  unsigned __int16 BITFLD_UART_DR : 1;
  unsigned __int16 BITFLD_UART_OE : 1;
  unsigned __int16 BITFLD_UART_PE : 1;
  unsigned __int16 BITFLD_UART_FE : 1;
  unsigned __int16 BITFLD_UART_BI : 1;
  unsigned __int16 BITFLD_UART_THRE : 1;
  unsigned __int16 BITFLD_UART_TEMT : 1;
  unsigned __int16 BITFLD_UART_RFE : 1;
};

/* 434 */
struct __UART_MSR_REG
{
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 _anon_1 : 3;
  unsigned __int16 BITFLD_UART_CTS : 1;
};

/* 435 */
struct __UART_SCR_REG
{
  unsigned __int16 BITFLD_UART_SCRATCH_PAD : 8;
};

/* 436 */
struct __UART_SRBR_STHR0_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 437 */
struct __UART_SRBR_STHR1_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

