hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 438 */
struct __UART_SRBR_STHR2_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 439 */
struct __UART_SRBR_STHR3_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 440 */
struct __UART_SRBR_STHR4_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 441 */
struct __UART_SRBR_STHR5_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 442 */
struct __UART_SRBR_STHR6_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 443 */
struct __UART_SRBR_STHR7_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 444 */
struct __UART_SRBR_STHR8_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 445 */
struct __UART_SRBR_STHR9_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 446 */
struct __UART_SRBR_STHR10_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 447 */
struct __UART_SRBR_STHR11_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 448 */
struct __UART_SRBR_STHR12_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 449 */
struct __UART_SRBR_STHR13_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 450 */
struct __UART_SRBR_STHR14_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 451 */
struct __UART_SRBR_STHR15_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 452 */
struct __UART_FAR_REG
{
  unsigned __int16 BITFLD_UART_FAR : 1;
};

/* 453 */
struct __UART_USR_REG
{
  unsigned __int16 BITFLD_UART_BUSY : 1;
  unsigned __int16 BITFLD_UART_TFNF : 1;
  unsigned __int16 BITFLD_UART_TFE : 1;
  unsigned __int16 BITFLD_UART_RFNE : 1;
  unsigned __int16 BITFLD_UART_RFF : 1;
};

/* 454 */
struct __UART_TFL_REG
{
  unsigned __int16 BITFLD_UART_TRANSMIT_FIFO_LEVEL : 5;
};

/* 455 */
struct __UART_RFL_REG
{
  unsigned __int16 BITFLD_UART_RECEIVE_FIFO_LEVEL : 5;
};

/* 456 */
struct __UART_SRR_REG
{
  unsigned __int16 BITFLD_UART_UR : 1;
  unsigned __int16 BITFLD_UART_RFR : 1;
  unsigned __int16 BITFLD_UART_XFR : 1;
};

/* 457 */
struct __UART_SRTS_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_REQUEST_TO_SEND : 1;
};

/* 458 */
struct __UART_SBCR_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_BREAK_CONTROL : 1;
};

/* 459 */
struct __UART_SDMAM_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_DMA_MODE : 1;
};

/* 460 */
struct __UART_SFE_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_FIFO_ENABLE : 1;
};

/* 461 */
struct __UART_SRT_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_RCVR_TRIGGER : 2;
};

/* 462 */
struct __UART_STET_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_TX_EMPTY_TRIGGER : 2;
};

/* 463 */
struct __UART_HTX_REG
{
  unsigned __int16 BITFLD_UART_HALT_TX : 1;
};

/* 464 */
struct __UART_DMASA_REG
{
  unsigned __int16 BITFLD_DMASA : 1;
};

/* 465 */
struct __UART_DLF_REG
{
  unsigned __int16 BITFLD_UART_DLF : 4;
};

/* 466 */
struct __UART_UCV_REG
{
  unsigned __int16 BITFLD_UCV : 16;
};

/* 467 */
struct __UART_UCV_HIGH_REG
{
  unsigned __int16 BITFLD_UCV : 16;
};

/* 468 */
struct __UART_CTR_REG
{
  unsigned __int16 BITFLD_CTR : 16;
};

/* 469 */
struct __UART_CTR_HIGH_REG
{
  unsigned __int16 BITFLD_CTR : 16;
};

/* 470 */
struct __UART2_RBR_THR_DLL_REG
{
  unsigned __int16 BITFLD_RBR_THR_DLL : 8;
};

/* 471 */
struct __UART2_IER_DLH_REG
{
  unsigned __int16 BITFLD_ERBFI_dlh0 : 1;
  unsigned __int16 BITFLD_ETBEI_dlh1 : 1;
  unsigned __int16 BITFLD_ELSI_dhl2 : 1;
  unsigned __int16 BITFLD_EDSSI_dlh3 : 1;
  unsigned __int16 BITFLD_dlh6_4 : 3;
  unsigned __int16 BITFLD_PTIME_dlh7 : 1;
};

/* 472 */
struct __UART2_IIR_FCR_REG
{
  unsigned __int16 BITFLD_UART_IID0_FIFOE : 1;
  unsigned __int16 BITFLD_UART_IID1_RFIFOE : 1;
  unsigned __int16 BITFLD_UART_IID2_XFIFOR : 1;
  unsigned __int16 BITFLD_UART_IID3_DMAM : 1;
  unsigned __int16 BITFLD_UART_TET : 2;
  unsigned __int16 BITFLD_UART_FIFOSE_RT : 2;
};

/* 473 */
struct __UART2_LCR_REG
{
  unsigned __int16 BITFLD_UART_DLS : 2;
  unsigned __int16 BITFLD_UART_STOP : 1;
  unsigned __int16 BITFLD_UART_PEN : 1;
  unsigned __int16 BITFLD_UART_EPS : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_UART_BC : 1;
  unsigned __int16 BITFLD_UART_DLAB : 1;
};

/* 474 */
struct __UART2_MCR_REG
{
  unsigned __int16 _anon_0 : 4;
  unsigned __int16 BITFLD_UART_LB : 1;
};

/* 475 */
struct __UART2_LSR_REG
{
  unsigned __int16 BITFLD_UART_DR : 1;
  unsigned __int16 BITFLD_UART_OE : 1;
  unsigned __int16 BITFLD_UART_PE : 1;
  unsigned __int16 BITFLD_UART_FE : 1;
  unsigned __int16 BITFLD_UART_BI : 1;
  unsigned __int16 BITFLD_UART_THRE : 1;
  unsigned __int16 BITFLD_UART_TEMT : 1;
  unsigned __int16 BITFLD_UART_RFE : 1;
};

/* 476 */
struct __UART2_SCR_REG
{
  unsigned __int16 BITFLD_UART_SCRATCH_PAD : 8;
};

/* 477 */
struct __UART2_SRBR_STHR0_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 478 */
struct __UART2_SRBR_STHR1_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 479 */
struct __UART2_SRBR_STHR2_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 480 */
struct __UART2_SRBR_STHR3_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 481 */
struct __UART2_SRBR_STHR4_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 482 */
struct __UART2_SRBR_STHR5_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 483 */
struct __UART2_SRBR_STHR6_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 484 */
struct __UART2_SRBR_STHR7_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 485 */
struct __UART2_SRBR_STHR8_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 486 */
struct __UART2_SRBR_STHR9_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 487 */
struct __UART2_SRBR_STHR10_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 488 */
struct __UART2_SRBR_STHR11_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 489 */
struct __UART2_SRBR_STHR12_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 490 */
struct __UART2_SRBR_STHR13_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 491 */
struct __UART2_SRBR_STHR14_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

/* 492 */
struct __UART2_SRBR_STHR15_REG
{
  unsigned __int16 BITFLD_SRBR_STHRx : 8;
};

