hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 493 */
struct __UART2_FAR_REG
{
  unsigned __int16 BITFLD_UART_FAR : 1;
};

/* 494 */
struct __UART2_USR_REG
{
  unsigned __int16 BITFLD_UART_BUSY : 1;
  unsigned __int16 BITFLD_UART_TFNF : 1;
  unsigned __int16 BITFLD_UART_TFE : 1;
  unsigned __int16 BITFLD_UART_RFNE : 1;
  unsigned __int16 BITFLD_UART_RFF : 1;
};

/* 495 */
struct __UART2_TFL_REG
{
  unsigned __int16 BITFLD_UART_TRANSMIT_FIFO_LEVEL : 5;
};

/* 496 */
struct __UART2_RFL_REG
{
  unsigned __int16 BITFLD_UART_RECEIVE_FIFO_LEVEL : 5;
};

/* 497 */
struct __UART2_SRR_REG
{
  unsigned __int16 BITFLD_UART_UR : 1;
  unsigned __int16 BITFLD_UART_RFR : 1;
  unsigned __int16 BITFLD_UART_XFR : 1;
};

/* 498 */
struct __UART2_SBCR_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_BREAK_CONTROL : 1;
};

/* 499 */
struct __UART2_SDMAM_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_DMA_MODE : 1;
};

/* 500 */
struct __UART2_SFE_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_FIFO_ENABLE : 1;
};

/* 501 */
struct __UART2_SRT_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_RCVR_TRIGGER : 2;
};

/* 502 */
struct __UART2_STET_REG
{
  unsigned __int16 BITFLD_UART_SHADOW_TX_EMPTY_TRIGGER : 2;
};

/* 503 */
struct __UART2_HTX_REG
{
  unsigned __int16 BITFLD_UART_HALT_TX : 1;
};

/* 504 */
struct __UART2_DMASA_REG
{
  unsigned __int16 BITFLD_DMASA : 1;
};

/* 505 */
struct __UART2_DLF_REG
{
  unsigned __int16 BITFLD_UART_DLF : 4;
};

/* 506 */
struct __UART2_UCV_REG
{
  unsigned __int16 BITFLD_UCV : 16;
};

/* 507 */
struct __UART2_UCV_HIGH_REG
{
  unsigned __int16 BITFLD_UCV : 16;
};

/* 508 */
struct __UART2_CTR_REG
{
  unsigned __int16 BITFLD_CTR : 16;
};

/* 509 */
struct __UART2_CTR_HIGH_REG
{
  unsigned __int16 BITFLD_CTR : 16;
};

/* 510 */
struct __CHIP_ID1_REG
{
  unsigned __int16 BITFLD_CHIP_ID1 : 8;
};

/* 511 */
struct __CHIP_ID2_REG
{
  unsigned __int16 BITFLD_CHIP_ID2 : 8;
};

/* 512 */
struct __CHIP_ID3_REG
{
  unsigned __int16 BITFLD_CHIP_ID3 : 8;
};

/* 513 */
struct __CHIP_ID4_REG
{
  unsigned __int16 BITFLD_CHIP_ID4 : 8;
};

/* 514 */
struct __CHIP_SWC_REG
{
  unsigned __int16 BITFLD_CHIP_SWC : 4;
};

/* 515 */
struct __CHIP_REVISION_REG
{
  unsigned __int16 BITFLD_CHIP_REVISION : 8;
};

/* 516 */
struct __CHIP_TEST1_REG
{
  unsigned __int16 BITFLD_CHIP_LAYOUT_REVISION : 8;
};

/* 517 */
struct __CHIP_TEST2_REG
{
  unsigned __int16 BITFLD_CHIP_METAL_OPTION : 4;
};

/* 518 */
struct __WATCHDOG_REG
{
  unsigned __int16 BITFLD_WDOG_VAL : 8;
  unsigned __int16 BITFLD_WDOG_VAL_NEG : 1;
  unsigned __int16 BITFLD_WDOG_WEN : 7;
};

/* 519 */
struct __WATCHDOG_CTRL_REG
{
  unsigned __int16 BITFLD_NMI_RST : 1;
  unsigned __int16 _anon_0 : 1;
};

/* 520 */
struct __WKUP_CTRL_REG
{
  unsigned __int16 BITFLD_WKUP_DEB_VALUE : 6;
  unsigned __int16 BITFLD_WKUP_SFT_KEYHIT : 1;
  unsigned __int16 BITFLD_WKUP_ENABLE_IRQ : 1;
  unsigned __int16 BITFLD_WKUP2_ENABLE_IRQ : 1;
};

/* 521 */
struct __WKUP_COMPARE_REG
{
  unsigned __int16 BITFLD_WKUP_COMPARE : 8;
};

/* 522 */
struct __WKUP_IRQ_STATUS_REG
{
  unsigned __int16 BITFLD_WKUP_IRQ_STATUS : 1;
  unsigned __int16 BITFLD_WKUP2_IRQ_STATUS : 1;
  unsigned __int16 BITFLD_WKUP_CNTR_RST : 1;
  unsigned __int16 BITFLD_WKUP2_CNTR_RST : 1;
};

/* 523 */
struct __WKUP_COUNTER_REG
{
  unsigned __int16 BITFLD_EVENT_VALUE : 8;
  unsigned __int16 BITFLD_EVENT2_VALUE : 8;
};

/* 524 */
struct __WKUP_SELECT_GPIO_REG
{
  unsigned __int16 BITFLD_WKUP_SELECT_GPIO : 12;
};

/* 525 */
struct __WKUP2_SELECT_GPIO_REG
{
  unsigned __int16 BITFLD_WKUP2_SELECT_GPIO : 12;
};

/* 526 */
struct __WKUP_POL_GPIO_REG
{
  unsigned __int16 BITFLD_WKUP_POL_GPIO : 12;
};

/* 527 */
struct __WKUP2_POL_GPIO_REG
{
  unsigned __int16 BITFLD_WKUP2_POL_GPIO : 12;
};

/* 528 */
struct __BLE_ADVCHMAP_REG
{
  unsigned __int32 BITFLD_ADVCHMAP : 3;
};

/* 529 */
struct __RF_ATTR_REG
{
  unsigned __int32 _anon_0 : 3;
  unsigned __int32 BITFLD_IFF_POLARITY : 1;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 _anon_3 : 2;
  unsigned __int32 BITFLD_RF_BIAS : 4;
  unsigned __int32 BITFLD_TIA_BIAS : 1;
  unsigned __int32 _anon_4 : 11;
  unsigned __int32 BITFLD_PA_POWER_SETTING : 4;
};

/* 530 */
struct __RF_RADIO_INIT_REG
{
  unsigned __int32 BITFLD_RADIO_LDO_EN : 1;
  unsigned __int32 BITFLD_RADIO_LDO_EN_SEL : 1;
  unsigned __int32 BITFLD_RADIO_LDO_EN_WR : 1;
  unsigned __int32 BITFLD_ADPLLDIG_PWR_SW1_EN : 1;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_EN_SEL : 1;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_EN_WR : 1;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_ADPLLDIG_HRESET_N : 1;
  unsigned __int32 BITFLD_ADPLLDIG_HCLK_EN : 1;
  unsigned __int32 _anon_1 : 6;
  unsigned __int32 BITFLD_RADIO_REGS_RDY : 1;
  unsigned __int32 BITFLD_ADPLLDIG_HCLK_DIS : 1;
  unsigned __int32 _anon_2 : 6;
  unsigned __int32 BITFLD_RADIO_INIT_AUTOCLEAR : 1;
};

/* 531 */
struct __RF_LDO_STATUS_REG
{
  unsigned __int32 BITFLD_RADIO_LDO_EN_RD : 1;
  unsigned __int32 BITFLD_RADIO_LDO_ZERO_EN_RD : 1;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_EN_RD : 1;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_ZERO_EN_RD : 1;
  unsigned __int32 BITFLD_ldo_dco_en_rd : 1;
  unsigned __int32 BITFLD_ldo_dtc_en_rd : 1;
  unsigned __int32 BITFLD_ldo_radio_vref_hold_rd : 1;
  unsigned __int32 BITFLD_ldo_dco_vref_hold_rd : 1;
  unsigned __int32 BITFLD_ldo_dtc_vref_hold_rd : 1;
};

/* 532 */
struct __RF_ADPLLDIG_CTRL_REG
{
  unsigned __int32 BITFLD_OPENLOOP_RDY_SEL : 1;
  unsigned __int32 BITFLD_OPENLOOP_RDY_WR : 1;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_PWR_SW_TIM_CTRL : 3;
};

/* 533 */
struct __RF_AGC_EXT_LUT_REG
{
  unsigned __int32 BITFLD_AGC_EXT_LUT : 10;
};

/* 534 */
struct __RF_CALSTATE_REG
{
  unsigned __int32 BITFLD_CALSTATE : 4;
};

/* 535 */
struct __RF_CAL_CTRL_REG
{
  unsigned __int32 BITFLD_SO_CAL : 1;
  unsigned __int32 BITFLD_EO_CAL : 1;
  unsigned __int32 BITFLD_RF_CAL_CTRL_SPARE : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DC_OFFSET_CAL_DIS : 1;
};

/* 536 */
struct __RF_IRQ_CTRL_REG
{
  unsigned __int32 BITFLD_EO_CAL_CLEAR : 1;
};

/* 537 */
struct __RF_ADCI_DC_OFFSET_REG
{
  unsigned __int32 BITFLD_ADC_OFFP_I_RD : 9;
  unsigned __int32 BITFLD_ADC_OFFN_I_RD : 9;
};

/* 538 */
struct __RF_ADCQ_DC_OFFSET_REG
{
  unsigned __int32 BITFLD_ADC_OFFP_Q_RD : 9;
  unsigned __int32 BITFLD_ADC_OFFN_Q_RD : 9;
};

