hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 539 */
struct __RF_SPARE_REG
{
  unsigned __int32 BITFLD_RF_SPARE_BITS : 16;
  unsigned __int32 BITFLD_RF_SPARE_BITS_HV : 8;
  unsigned __int32 BITFLD_RF_SPARE_IN : 4;
  unsigned __int32 BITFLD_RF_SPARE_IN_EN : 1;
};

/* 540 */
struct __RF_IFF_CTRL_REG
{
  unsigned __int32 BITFLD_IF_CAL_TRIM : 2;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_IF_MUTE : 1;
  unsigned __int32 BITFLD_IFF_DCOC_DAC_DIS : 1;
  unsigned __int32 BITFLD_RF_IFF_CTRL_SPARE : 6;
  unsigned __int32 BITFLD_IFF_COMPLEX_DIS : 1;
  unsigned __int32 BITFLD_IFF_DCOC_DAC_REFCUR_CTRL : 2;
};

/* 541 */
struct __RF_ADC_CTRL1_REG
{
  unsigned __int32 BITFLD_ADC_DC_OFFSET_SEL : 1;
  unsigned __int32 _anon_0 : 12;
  unsigned __int32 BITFLD_ADC_MUTE : 1;
  unsigned __int32 BITFLD_ADC_SIGN : 1;
};

/* 542 */
struct __RF_ADC_CTRL2_REG
{
  unsigned __int32 BITFLD_ADC_OFFP_I_WR : 9;
  unsigned __int32 BITFLD_ADC_OFFN_I_WR : 9;
};

/* 543 */
struct __RF_ADC_CTRL3_REG
{
  unsigned __int32 BITFLD_ADC_OFFP_Q_WR : 9;
  unsigned __int32 BITFLD_ADC_OFFN_Q_WR : 9;
};

/* 544 */
struct __RF_PA_CTRL_REG
{
  unsigned __int32 BITFLD_TRIM_DUTY_POS : 3;
  unsigned __int32 BITFLD_TRIM_DUTY_NEG : 3;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_PA_RAMP_STEP_SPEED : 2;
};

/* 545 */
struct __RF_LDO_VREF_SEL_REG
{
  unsigned __int32 BITFLD_RF_LDO_RADIO_VREF_SEL : 1;
  unsigned __int32 BITFLD_RF_LDO_DTC_VREF_SEL : 1;
  unsigned __int32 BITFLD_RF_LDO_DCO_VREF_SEL : 1;
};

/* 546 */
struct __RF_MIXER_CTRL1_REG
{
  unsigned __int32 BITFLD_MIXER_IP2_DAC_I_TRIM : 9;
  unsigned __int32 _anon_0 : 7;
  unsigned __int32 BITFLD_MIXER_IP2_DAC_Q_TRIM : 9;
};

/* 547 */
struct __RF_MIXER_CTRL2_REG
{
  unsigned __int32 BITFLD_MIX_CAL_CAP_WR_1M : 4;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_MIX_CAL_CAP_WR_2M : 4;
  unsigned __int32 _anon_1 : 4;
  unsigned __int32 BITFLD_MIX_CAL_SELECT : 1;
};

/* 548 */
struct __RF_IO_CTRL_REG
{
  unsigned __int32 BITFLD_RFIO_TUNE_CAP_TRIM_RX : 4;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_RFIO_TUNE_CAP_TRIM_TX : 4;
};

/* 549 */
struct __RF_LNA_CTRL1_REG
{
  unsigned __int32 BITFLD_LNA_TRIM_GAIN0_HP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN1_HP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN2_HP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN3_HP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN4_HP : 5;
};

/* 550 */
struct __RF_LNA_CTRL2_REG
{
  unsigned __int32 BITFLD_LNA_TRIM_GAIN0_LP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN1_LP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN2_LP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN3_LP : 5;
  unsigned __int32 BITFLD_LNA_TRIM_GAIN4_LP : 5;
};

/* 551 */
struct __RF_LNA_CTRL3_REG
{
  unsigned __int32 BITFLD_LNA_TRIM_CASC : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_LNA_MODE_GAIN0_LP : 2;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_LNA_MODE_GAIN1_LP : 2;
  unsigned __int32 _anon_2 : 2;
  unsigned __int32 BITFLD_LNA_MODE_GAIN2_LP : 2;
  unsigned __int32 _anon_3 : 2;
  unsigned __int32 BITFLD_LNA_MODE_GAIN3_LP : 2;
  unsigned __int32 _anon_4 : 2;
  unsigned __int32 BITFLD_LNA_MODE_GAIN4_LP : 2;
  unsigned __int32 _anon_5 : 2;
  unsigned __int32 BITFLD_LNA_SPARE : 2;
};

/* 552 */
struct __RF_ADPLLDIG_RFMON_CTRL_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_SYNC_CLK_INV : 1;
  unsigned __int32 BITFLD_ADPLLDIG_RFMON_MUX_SEL : 3;
  unsigned __int32 BITFLD_ADPLLDIG_RFMON_SPARE : 4;
};

/* 553 */
struct __RF_RDP_CTRL_REG
{
  unsigned __int32 BITFLD_RDP_RFCU_SEL : 1;
  unsigned __int32 BITFLD_RDP_MOD_SEL1 : 1;
  unsigned __int32 BITFLD_RDP_MOD_SEL2 : 2;
  unsigned __int32 BITFLD_RDP_MOD_RATE : 2;
};

/* 554 */
struct __RF_RFCU_CTRL_REG
{
  unsigned __int32 BITFLD_RF_RFCU_CLK_DIV : 1;
};

/* 555 */
struct __RF_OVERRULE_REG
{
  unsigned __int32 BITFLD_TX_EN_OVR : 2;
  unsigned __int32 BITFLD_RX_EN_OVR : 2;
};

/* 556 */
struct __RF_DIAGIRQ_CTRL_REG
{
  unsigned __int32 BITFLD_DIAG_BUS0_IRQ_MASK : 1;
  unsigned __int32 BITFLD_DIAG_BUS0_SEL : 2;
  unsigned __int32 BITFLD_DIAG_BUS0_BIT_SEL : 3;
  unsigned __int32 BITFLD_DIAG_BUS0_EDGE_SEL : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DIAG_BUS1_IRQ_MASK : 1;
  unsigned __int32 BITFLD_DIAG_BUS1_SEL : 2;
  unsigned __int32 BITFLD_DIAG_BUS1_BIT_SEL : 3;
  unsigned __int32 BITFLD_DIAG_BUS1_EDGE_SEL : 1;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_DIAG_BUS2_IRQ_MASK : 1;
  unsigned __int32 BITFLD_DIAG_BUS2_SEL : 2;
  unsigned __int32 BITFLD_DIAG_BUS2_BIT_SEL : 3;
  unsigned __int32 BITFLD_DIAG_BUS2_EDGE_SEL : 1;
  unsigned __int32 _anon_2 : 1;
  unsigned __int32 BITFLD_DIAG_BUS3_IRQ_MASK : 1;
  unsigned __int32 BITFLD_DIAG_BUS3_SEL : 2;
  unsigned __int32 BITFLD_DIAG_BUS3_BIT_SEL : 3;
  unsigned __int32 BITFLD_DIAG_BUS3_EDGE_SEL : 1;
};

/* 557 */
struct __RF_DIAGIRQ_STAT_REG
{
  unsigned __int32 BITFLD_DIAGIRQ_STAT : 4;
};

/* 558 */
struct __RF_LDO_CTRL_REG
{
  unsigned __int32 BITFLD_LDO_RADIO_LEVEL : 3;
  unsigned __int32 BITFLD_LDO_RADIO_CONT_ENABLE : 1;
  unsigned __int32 BITFLD_LDO_DTC_LEVEL : 3;
  unsigned __int32 BITFLD_LDO_DTC_CONT_ENABLE : 1;
  unsigned __int32 BITFLD_LDO_DCO_LEVEL : 3;
  unsigned __int32 BITFLD_LDO_DCO_CONT_ENABLE : 1;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_LDO_VREF_SMPL_TIME : 5;
  unsigned __int32 _anon_1 : 3;
  unsigned __int32 BITFLD_LDO_RADIO_HOLD_OVR_VAL : 1;
  unsigned __int32 BITFLD_LDO_RADIO_HOLD_OVR_EN : 1;
  unsigned __int32 BITFLD_LDO_DTC_HOLD_OVR_VAL : 1;
  unsigned __int32 BITFLD_LDO_DTC_HOLD_OVR_EN : 1;
  unsigned __int32 BITFLD_LDO_DCO_HOLD_OVR_VAL : 1;
  unsigned __int32 BITFLD_LDO_DCO_HOLD_OVR_EN : 1;
};

/* 559 */
struct __RF_ENABLE_CONFIG0_REG
{
  unsigned __int32 BITFLD_RFIO_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_LDO_EN_DCF_TX : 5;
};

/* 560 */
struct __RF_ENABLE_CONFIG1_REG
{
  unsigned __int32 BITFLD_PA_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_PA_LDO_EN_DCF_TX : 5;
};

/* 561 */
struct __RF_ENABLE_CONFIG2_REG
{
  unsigned __int32 BITFLD_LNA_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_LNA_LDO_EN_DCF_TX : 5;
};

/* 562 */
struct __RF_ENABLE_CONFIG3_REG
{
  unsigned __int32 BITFLD_MIX_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_MIX_LDO_EN_DCF_TX : 5;
};

