hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 563 */
struct __RF_ENABLE_CONFIG4_REG
{
  unsigned __int32 BITFLD_IFF_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_IFF_LDO_EN_DCF_TX : 5;
};

/* 564 */
struct __RF_ENABLE_CONFIG5_REG
{
  unsigned __int32 BITFLD_IFFADC_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_IFFADC_LDO_EN_DCF_TX : 5;
};

/* 565 */
struct __RF_ENABLE_CONFIG6_REG
{
  unsigned __int32 BITFLD_ADPLL_TDC_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_TDC_LDO_EN_DCF_TX : 5;
};

/* 566 */
struct __RF_ENABLE_CONFIG7_REG
{
  unsigned __int32 BITFLD_ADPLL_DTC_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_DTC_LDO_EN_DCF_TX : 5;
};

/* 567 */
struct __RF_ENABLE_CONFIG8_REG
{
  unsigned __int32 BITFLD_ADPLL_DCO_LDO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_DCO_LDO_EN_DCF_TX : 5;
};

/* 568 */
struct __RF_ENABLE_CONFIG9_REG
{
  unsigned __int32 BITFLD_LDO_ZERO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_LDO_ZERO_EN_DCF_TX : 5;
};

/* 569 */
struct __RF_ENABLE_CONFIG10_REG
{
  unsigned __int32 BITFLD_LNA_LDO_ZERO_DCF_RX : 5;
  unsigned __int32 BITFLD_LNA_LDO_ZERO_DCF_TX : 5;
};

/* 570 */
struct __RF_ENABLE_CONFIG11_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_LDO_ACTIVERDY_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_ACTIVERDY_DCF_TX : 5;
};

/* 571 */
struct __RF_ENABLE_CONFIG12_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_LDO_LP_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_LDO_LP_DCF_TX : 5;
};

/* 572 */
struct __RF_ENABLE_CONFIG13_REG
{
  unsigned __int32 BITFLD_RFIO_RX_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_RX_EN_DCF_TX : 5;
};

/* 573 */
struct __RF_ENABLE_CONFIG14_REG
{
  unsigned __int32 BITFLD_RFIO_TX_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_TX_EN_DCF_TX : 5;
};

/* 574 */
struct __RF_ENABLE_CONFIG15_REG
{
  unsigned __int32 BITFLD_RFIO_TX_HARM_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_TX_HARM_EN_DCF_TX : 5;
};

/* 575 */
struct __RF_ENABLE_CONFIG16_REG
{
  unsigned __int32 BITFLD_RFIO_BIAS_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_BIAS_EN_DCF_TX : 5;
};

/* 576 */
struct __RF_ENABLE_CONFIG17_REG
{
  unsigned __int32 BITFLD_RFIO_BIAS_SH_OPEN_DCF_RX : 5;
  unsigned __int32 BITFLD_RFIO_BIAS_SH_OPEN_DCF_TX : 5;
};

/* 577 */
struct __RF_ENABLE_CONFIG18_REG
{
  unsigned __int32 BITFLD_PA_RAMP_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_PA_RAMP_EN_DCF_TX : 5;
};

/* 578 */
struct __RF_ENABLE_CONFIG19_REG
{
  unsigned __int32 BITFLD_PA_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_PA_EN_DCF_TX : 5;
};

/* 579 */
struct __RF_ENABLE_CONFIG20_REG
{
  unsigned __int32 BITFLD_LNA_CORE_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_LNA_CORE_EN_DCF_TX : 5;
};

/* 580 */
struct __RF_ENABLE_CONFIG21_REG
{
  unsigned __int32 BITFLD_LNA_CGM_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_LNA_CGM_EN_DCF_TX : 5;
};

/* 581 */
struct __RF_ENABLE_CONFIG22_REG
{
  unsigned __int32 BITFLD_MIX_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_MIX_EN_DCF_TX : 5;
};

/* 582 */
struct __RF_ENABLE_CONFIG23_REG
{
  unsigned __int32 BITFLD_MIX_BIAS_SH_OPEN_DCF_RX : 5;
  unsigned __int32 BITFLD_MIX_BIAS_SH_OPEN_DCF_TX : 5;
};

/* 583 */
struct __RF_ENABLE_CONFIG24_REG
{
  unsigned __int32 BITFLD_IFF_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_IFF_EN_DCF_TX : 5;
};

/* 584 */
struct __RF_ENABLE_CONFIG25_REG
{
  unsigned __int32 BITFLD_IFF_BIAS_SH_OPEN_DCF_RX : 5;
  unsigned __int32 BITFLD_IFF_BIAS_SH_OPEN_DCF_TX : 5;
};

/* 585 */
struct __RF_ENABLE_CONFIG26_REG
{
  unsigned __int32 BITFLD_ADC_CLK_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADC_CLK_EN_DCF_TX : 5;
};

/* 586 */
struct __RF_ENABLE_CONFIG27_REG
{
  unsigned __int32 BITFLD_ADC_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADC_EN_DCF_TX : 5;
};

/* 587 */
struct __RF_ENABLE_CONFIG28_REG
{
  unsigned __int32 BITFLD_ADPLL_DCO_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_DCO_EN_DCF_TX : 5;
};

/* 588 */
struct __RF_ENABLE_CONFIG29_REG
{
  unsigned __int32 BITFLD_ADPLL_CLK_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_CLK_EN_DCF_TX : 5;
};

/* 589 */
struct __RF_ENABLE_CONFIG30_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_RST_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_RST_DCF_TX : 5;
};

/* 590 */
struct __RF_ENABLE_CONFIG31_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_EN_DCF_TX : 5;
};

/* 591 */
struct __RF_ENABLE_CONFIG32_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_RX_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_RX_EN_DCF_TX : 5;
};

/* 592 */
struct __RF_ENABLE_CONFIG33_REG
{
  unsigned __int32 BITFLD_ADPLLDIG_PAIN_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLLDIG_PAIN_EN_DCF_TX : 5;
};

/* 593 */
struct __RF_ENABLE_CONFIG34_REG
{
  unsigned __int32 BITFLD_ADPLL_LOBUF_PA_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_LOBUF_PA_EN_DCF_TX : 5;
};

/* 594 */
struct __RF_ENABLE_CONFIG35_REG
{
  unsigned __int32 BITFLD_CAL_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_CAL_EN_DCF_TX : 5;
};

/* 595 */
struct __RF_ENABLE_CONFIG36_REG
{
  unsigned __int32 BITFLD_DEM_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_DEM_EN_DCF_TX : 5;
};

/* 596 */
struct __RF_ENABLE_CONFIG37_REG
{
  unsigned __int32 BITFLD_DEM_DC_PARCAL_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE_DEM_DC_PARCAL_DCF_TX : 5;
};

/* 597 */
struct __RF_ENABLE_CONFIG38_REG
{
  unsigned __int32 BITFLD_DEM_AGC_UNFREEZE_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX : 5;
};

/* 598 */
struct __RF_ENABLE_CONFIG39_REG
{
  unsigned __int32 BITFLD_DEM_SIGDETECT_EN_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE_DEM_SIGDETECT_EN_DCF_TX : 5;
};

/* 599 */
struct __RF_ENABLE_CONFIG40_REG
{
  unsigned __int32 BITFLD_PHY_RDY4BS_DCF_RX : 5;
  unsigned __int32 BITFLD_PHY_RDY4BS_DCF_TX : 5;
};

/* 600 */
struct __RF_ENABLE_CONFIG41_REG
{
  unsigned __int32 BITFLD_ADPLL_RDY_FOR_DIV_DCF_RX : 5;
  unsigned __int32 BITFLD_ADPLL_RDY_FOR_DIV_DCF_TX : 5;
};

/* 601 */
struct __RF_ENABLE_CONFIG42_REG
{
  unsigned __int32 BITFLD_SPARE1_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE1_DCF_TX : 5;
};

/* 602 */
struct __RF_ENABLE_CONFIG43_REG
{
  unsigned __int32 BITFLD_SPARE2_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE2_DCF_TX : 5;
};

/* 603 */
struct __RF_ENABLE_CONFIG44_REG
{
  unsigned __int32 BITFLD_SPARE3_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE3_DCF_TX : 5;
};

/* 604 */
struct __RF_ENABLE_CONFIG45_REG
{
  unsigned __int32 BITFLD_SPARE4_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE4_DCF_TX : 5;
};

/* 605 */
struct __RF_ENABLE_CONFIG46_REG
{
  unsigned __int32 BITFLD_SPARE5_DCF_RX : 5;
  unsigned __int32 BITFLD_SPARE5_DCF_TX : 5;
};

