hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 606 */
struct __RF_CNTRL_TIMER_1_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 607 */
struct __RF_CNTRL_TIMER_2_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 608 */
struct __RF_CNTRL_TIMER_3_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 609 */
struct __RF_CNTRL_TIMER_4_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 610 */
struct __RF_CNTRL_TIMER_5_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 611 */
struct __RF_CNTRL_TIMER_6_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 612 */
struct __RF_CNTRL_TIMER_7_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 613 */
struct __RF_CNTRL_TIMER_8_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 614 */
struct __RF_CNTRL_TIMER_9_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 615 */
struct __RF_CNTRL_TIMER_10_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 616 */
struct __RF_CNTRL_TIMER_11_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 617 */
struct __RF_CNTRL_TIMER_12_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 618 */
struct __RF_CNTRL_TIMER_13_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 619 */
struct __RF_CNTRL_TIMER_14_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 620 */
struct __RF_CNTRL_TIMER_15_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 621 */
struct __RF_CNTRL_TIMER_16_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 622 */
struct __RF_CNTRL_TIMER_17_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 623 */
struct __RF_CNTRL_TIMER_18_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 624 */
struct __RF_CNTRL_TIMER_19_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 625 */
struct __RF_CNTRL_TIMER_20_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 626 */
struct __RF_CNTRL_TIMER_21_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 627 */
struct __RF_CNTRL_TIMER_22_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 628 */
struct __RF_CNTRL_TIMER_23_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 629 */
struct __RF_CNTRL_TIMER_24_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 630 */
struct __RF_CNTRL_TIMER_25_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 631 */
struct __RF_CNTRL_TIMER_26_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 632 */
struct __RF_CNTRL_TIMER_27_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 633 */
struct __RF_CNTRL_TIMER_28_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 634 */
struct __RF_CNTRL_TIMER_29_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 635 */
struct __RF_CNTRL_TIMER_30_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 636 */
struct __RF_CNTRL_TIMER_31_REG
{
  unsigned __int32 BITFLD_SET_OFFSET : 8;
  unsigned __int32 BITFLD_RESET_OFFSET : 8;
};

/* 637 */
struct __RF_ALWAYS_EN1_REG
{
  unsigned __int32 BITFLD_ALW_EN_RFIO_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_PA_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_LNA_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_MIX_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_IFF_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_IFFADC_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_TDC_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_DTC_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_DCO_LDO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_LDO_ZERO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_LNA_LDO_ZERO : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLLDIG_LDO_ACTIVERDY : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLLDIG_LDO_LP : 1;
  unsigned __int32 BITFLD_ALW_EN_RFIO_RX_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_RFIO_TX_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_RFIO_TX_HARM_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_RFIO_BIAS_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_RFIO_BIAS_SH_OPEN : 1;
  unsigned __int32 BITFLD_ALW_EN_PA_RAMP_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_PA_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_LNA_CORE_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_LNA_CGM_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_MIX_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_MIX_BIAS_SH_OPEN : 1;
  unsigned __int32 BITFLD_ALW_EN_IFF_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_IFF_BIAS_SH_OPEN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADC_CLK_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADC_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_DCO_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_CLK_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLLDIG_RST : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLLDIG_EN : 1;
};

/* 638 */
struct __RF_ALWAYS_EN2_REG
{
  unsigned __int32 BITFLD_ALW_EN_ADPLLDIG_RX_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_PAIN_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_LOBUF_PA_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_CAL_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_DEM_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_DEM_DC_PARCAL_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_DEM_AGC_UNFREEZE_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_DEM_SIGDETECT_EN : 1;
  unsigned __int32 BITFLD_ALW_EN_PHY_RDY4BS : 1;
  unsigned __int32 BITFLD_ALW_EN_ADPLL_RDY_FOR_DIV : 1;
  unsigned __int32 BITFLD_ALW_EN_SPARE1 : 1;
  unsigned __int32 BITFLD_ALW_EN_SPARE2 : 1;
  unsigned __int32 BITFLD_ALW_EN_SPARE3 : 1;
  unsigned __int32 BITFLD_ALW_EN_SPARE4 : 1;
  unsigned __int32 BITFLD_ALW_EN_SPARE5 : 1;
};

/* 639 */
struct __RF_PORT_EN_REG
{
  unsigned __int32 BITFLD_RF_PORT0_RX : 1;
  unsigned __int32 BITFLD_RF_PORT0_TX : 1;
  unsigned __int32 BITFLD_RF_PORT1_RX : 1;
  unsigned __int32 BITFLD_RF_PORT1_TX : 1;
  unsigned __int32 BITFLD_RF_PORT2_RX : 1;
  unsigned __int32 BITFLD_RF_PORT2_TX : 1;
  unsigned __int32 BITFLD_RF_PORT3_RX : 1;
  unsigned __int32 BITFLD_RF_PORT3_TX : 1;
  unsigned __int32 BITFLD_RF_PORT4_RX : 1;
  unsigned __int32 BITFLD_RF_PORT4_TX : 1;
};

