hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 640 */
struct __RF_PORT_POL_REG
{
  unsigned __int32 BITFLD_RF_PORT0_POL : 1;
  unsigned __int32 BITFLD_RF_PORT1_POL : 1;
  unsigned __int32 BITFLD_RF_PORT2_POL : 1;
  unsigned __int32 BITFLD_RF_PORT3_POL : 1;
  unsigned __int32 BITFLD_RF_PORT4_POL : 1;
};

/* 641 */
struct __RF_DEM_CTRL_REG
{
  unsigned __int32 BITFLD_EQUAL_EN : 1;
  unsigned __int32 BITFLD_BLE_DDC_EN : 1;
  unsigned __int32 BITFLD_IQCORR_EN : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_AGC_USE_GPIO_IN : 1;
  unsigned __int32 BITFLD_IQ_TO_GPIO_EN : 1;
};

/* 642 */
struct __RF_AGC_LUT_0123_REG
{
  unsigned __int32 BITFLD_VGA2_GAIN0 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN0 : 3;
  unsigned __int32 BITFLD_LNA_GAIN0 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN1 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN1 : 3;
  unsigned __int32 BITFLD_LNA_GAIN1 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN2 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN2 : 3;
  unsigned __int32 BITFLD_LNA_GAIN2 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN3 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN3 : 3;
  unsigned __int32 BITFLD_LNA_GAIN3 : 3;
};

/* 643 */
struct __RF_AGC_LUT_4567_REG
{
  unsigned __int32 BITFLD_VGA2_GAIN4 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN4 : 3;
  unsigned __int32 BITFLD_LNA_GAIN4 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN5 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN5 : 3;
  unsigned __int32 BITFLD_LNA_GAIN5 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN6 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN6 : 3;
  unsigned __int32 BITFLD_LNA_GAIN6 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN7 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN7 : 3;
  unsigned __int32 BITFLD_LNA_GAIN7 : 3;
};

/* 644 */
struct __RF_AGC_LUT_89AB_REG
{
  unsigned __int32 BITFLD_VGA2_GAIN8 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN8 : 3;
  unsigned __int32 BITFLD_LNA_GAIN8 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN9 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN9 : 3;
  unsigned __int32 BITFLD_LNA_GAIN9 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN10 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN10 : 3;
  unsigned __int32 BITFLD_LNA_GAIN10 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN11 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN11 : 3;
  unsigned __int32 BITFLD_LNA_GAIN11 : 3;
};

/* 645 */
struct __RF_AGC_LUT_CDEF_REG
{
  unsigned __int32 BITFLD_VGA2_GAIN12 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN12 : 3;
  unsigned __int32 BITFLD_LNA_GAIN12 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN13 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN13 : 3;
  unsigned __int32 BITFLD_LNA_GAIN13 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN14 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN14 : 3;
  unsigned __int32 BITFLD_LNA_GAIN14 : 3;
  unsigned __int32 BITFLD_VGA2_GAIN15 : 2;
  unsigned __int32 BITFLD_VGA1_GAIN15 : 3;
  unsigned __int32 BITFLD_LNA_GAIN15 : 3;
};

/* 646 */
struct __RF_AGC_CTRL1_REG
{
  unsigned __int32 BITFLD_AGC_TH_LOW : 7;
  unsigned __int32 BITFLD_AGC_TH_HIGH : 7;
  unsigned __int32 BITFLD_AGC_TH2_HIGH : 7;
  unsigned __int32 BITFLD_AGC_MODE : 2;
};

/* 647 */
struct __RF_AGC_CTRL2_REG
{
  unsigned __int32 BITFLD_FASTAGC_EN : 1;
  unsigned __int32 BITFLD_FASTAGC_STEPS : 2;
  unsigned __int32 BITFLD_FASTAGC_WAIT : 2;
  unsigned __int32 BITFLD_AGCINC_WAIT : 2;
  unsigned __int32 BITFLD_AGCDEC_WAIT : 2;
  unsigned __int32 BITFLD_AGC_MAX_SETTING : 4;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_AGCSETTING_SEL : 1;
  unsigned __int32 BITFLD_AGCSETTING_WR : 4;
  unsigned __int32 BITFLD_EN_FRZ_GAIN : 1;
};

/* 648 */
struct __RF_AFC_CTRL_REG
{
  unsigned __int32 BITFLD_AFC_MODE : 4;
  unsigned __int32 BITFLD_PAD_MODE : 2;
  unsigned __int32 BITFLD_APD_MODE : 3;
  unsigned __int32 BITFLD_AFC_SYNCF_DIRECT : 1;
};

/* 649 */
struct __RF_DC_OFFSET_CTRL1_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DCOFFSET_I_WR : 8;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_DCOFFSET_Q_WR : 8;
};

/* 650 */
struct __RF_DC_OFFSET_CTRL2_REG
{
  unsigned __int32 BITFLD_DCOFFSET_SEL : 1;
  unsigned __int32 BITFLD_DCPARCAL_EN : 1;
  unsigned __int32 BITFLD_DCNSTEP : 3;
  unsigned __int32 BITFLD_DCFULLNGAIN : 3;
  unsigned __int32 BITFLD_DCPARCAL_INIT : 2;
  unsigned __int32 BITFLD_DCVGA1SCALE_EN : 1;
  unsigned __int32 BITFLD_DCPARNGAIN : 3;
  unsigned __int32 BITFLD_DCPAR_MULT_STEPS_EN : 1;
  unsigned __int32 BITFLD_DCPAR_DCF_EN : 1;
  unsigned __int32 BITFLD_DCOC_RESULT_LNAGAIN0_LUT : 2;
  unsigned __int32 BITFLD_DCOC_RESULT_LNAGAIN1_LUT : 2;
  unsigned __int32 BITFLD_DCOC_RESULT_LNAGAIN2_LUT : 2;
  unsigned __int32 BITFLD_DCOC_RESULT_LNAGAIN345_LUT : 2;
};

/* 651 */
struct __RF_DC_OFFSET_CTRL3_REG
{
  unsigned __int32 BITFLD_DCBETA_I : 8;
  unsigned __int32 BITFLD_DCBETA_Q : 8;
};

/* 652 */
struct __RF_DC_OFFSET_CTRL4_REG
{
  unsigned __int32 BITFLD_DCAGCSETTING_FULL0 : 4;
  unsigned __int32 BITFLD_DCAGCSETTING_FULL1 : 4;
  unsigned __int32 BITFLD_DCAGCSETTING_FULL2 : 4;
  unsigned __int32 BITFLD_DCAGCSETTING_FULL3 : 4;
};

/* 653 */
struct __RF_AGC_RESULT_REG
{
  unsigned __int32 BITFLD_AFC_RD : 8;
  unsigned __int32 BITFLD_AGCSETTING_RD : 4;
};

/* 654 */
struct __RF_RSSI_RESULT_REG
{
  unsigned __int32 BITFLD_RSSI_LATCHED_RD : 10;
  unsigned __int32 BITFLD_RSSI_AVG_RD : 10;
};

/* 655 */
struct __RF_DEM_ATTR_REG
{
  unsigned __int32 BITFLD_AFC_POLE1 : 2;
  unsigned __int32 BITFLD_AFC_POLE2 : 2;
  unsigned __int32 BITFLD_RXDATA_INV : 1;
  unsigned __int32 BITFLD_DEM_HSI_POL : 1;
  unsigned __int32 BITFLD_MATCH0101_TH : 4;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_AGC_SPEED8M_EN : 1;
  unsigned __int32 BITFLD_DCOC_SPEED8M_EN : 1;
  unsigned __int32 BITFLD_DCPOLE : 2;
  unsigned __int32 BITFLD_RSSI_TH : 6;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_RFADC_CLK_PHASE : 2;
  unsigned __int32 BITFLD_ADDR_TIMEOUT_X2 : 1;
};

/* 656 */
struct __RF_RSSI_COMP_CTRL_REG
{
  unsigned __int32 BITFLD_RSSI_COMP0 : 4;
  unsigned __int32 BITFLD_RSSI_COMP1 : 4;
  unsigned __int32 BITFLD_RSSI_COMP2 : 4;
  unsigned __int32 BITFLD_RSSI_COMP3 : 4;
  unsigned __int32 BITFLD_RSSI_COMP4 : 4;
};

/* 657 */
struct __RF_DEM_TESTMODE_REG
{
  unsigned __int32 BITFLD_DEM_RFMON_SOURCE : 4;
  unsigned __int32 BITFLD_DEM_GPADC_MUX_SEL : 3;
  unsigned __int32 BITFLD_DEM_RFMON_TRIGGER : 2;
};

/* 658 */
struct __RF_DEM_IQCORRECT_REG
{
  unsigned __int32 BITFLD_IQCORR_BETA : 8;
  unsigned __int32 BITFLD_IQCORR_ALPHA : 8;
};

/* 659 */
struct __RF_PAD_CNT_CTRL_REG
{
  unsigned __int32 BITFLD_PAD_POS_LIMIT : 7;
  unsigned __int32 BITFLD_PAD_NEG_LIMIT : 7;
  unsigned __int32 BITFLD_PAD_CLEAR_COUNT : 1;
};

