hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 660 */
struct __RF_PAD_CNT_RESULT_REG
{
  unsigned __int32 BITFLD_PAD_POS_CNT_RD : 8;
  unsigned __int32 BITFLD_PAD_NEG_CNT_RD : 8;
};

/* 661 */
struct __RF_DC_OFFSET_RESULT_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 662 */
struct __RF_DC_OFFSET_FULL_RES_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 663 */
struct __RF_DC_OFFSET_MPAR_RES0_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 664 */
struct __RF_DC_OFFSET_MPAR_RES1_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 665 */
struct __RF_DC_OFFSET_MPAR_RES2_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 666 */
struct __RF_DC_OFFSET_MPAR_RES3_REG
{
  unsigned __int32 BITFLD_DCOFFSET_I_RD : 9;
  unsigned __int32 BITFLD_DCOFFSET_Q_RD : 9;
};

/* 667 */
struct __ADPLL_ATTR_CTRL_REG
{
  unsigned __int32 BITFLD_PWR_MODE_RX : 1;
  unsigned __int32 BITFLD_PWR_MODE_TX : 1;
};

/* 668 */
struct __ADPLL_CN_CTRL_REG
{
  unsigned __int32 BITFLD_CN : 7;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_CS : 1;
  unsigned __int32 _anon_1 : 6;
  unsigned __int32 BITFLD_SGN : 1;
  unsigned __int32 BITFLD_CH0 : 13;
};

/* 669 */
struct __ADPLL_FIF_CTRL1_REG
{
  unsigned __int32 BITFLD_FIFRX_1M : 14;
};

/* 670 */
struct __ADPLL_FIF_CTRL2_REG
{
  unsigned __int32 BITFLD_FIFRX_OFFSET : 14;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_FIFTX : 14;
};

/* 671 */
struct __ADPLL_KDCO_CAL_CTRL1_REG
{
  unsigned __int32 BITFLD_KDCOHFIC_1M : 8;
  unsigned __int32 BITFLD_KDCOLF_IN_1M : 8;
};

/* 672 */
struct __ADPLL_KDCO_CAL_CTRL2_REG
{
  unsigned __int32 BITFLD_KMOD_ALPHA_1M : 5;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 _anon_2 : 8;
  unsigned __int32 BITFLD_KDCOCN_IC : 7;
  unsigned __int32 _anon_3 : 1;
  unsigned __int32 BITFLD_TKDCOCAL : 3;
  unsigned __int32 BITFLD_KDCOLFCALEN : 1;
  unsigned __int32 BITFLD_KDCOCALRX : 1;
  unsigned __int32 BITFLD_KDCOCALTX : 1;
  unsigned __int32 BITFLD_KDCOESTDEV : 2;
};

/* 673 */
struct __ADPLL_KDTCTDC_CAL_CTRL1_REG
{
  unsigned __int32 BITFLD_KDTC_ALPHA : 6;
  unsigned __int32 BITFLD_KTDC_IN : 9;
  unsigned __int32 BITFLD_KDTC_PIPELINE_BYPASS : 1;
  unsigned __int32 BITFLD_KDTCCN_IC : 7;
  unsigned __int32 BITFLD_KDTCIC : 9;
};

/* 674 */
struct __ADPLL_KDTCTDC_CAL_CTRL2_REG
{
  unsigned __int32 BITFLD_KDTCCALEN : 1;
  unsigned __int32 BITFLD_KDTCCALMOD : 1;
  unsigned __int32 BITFLD_KDTCCALMOD1P : 1;
  unsigned __int32 BITFLD_KDTCCAL_INV : 1;
  unsigned __int32 BITFLD_KDTCCALLG : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_KTDCCALEN : 1;
  unsigned __int32 BITFLD_PHRDLY : 2;
  unsigned __int32 BITFLD_TKDTCCAL : 4;
  unsigned __int32 BITFLD_PHRDLY_EXTRA : 1;
};

/* 675 */
struct __ADPLL_DCOAMP_CAL_CTRL_REG
{
  unsigned __int32 BITFLD_KCOARSE : 3;
  unsigned __int32 BITFLD_KMEDIUM : 3;
  unsigned __int32 BITFLD_AMPCALEN : 1;
  unsigned __int32 BITFLD_DCOAMPTM : 1;
  unsigned __int32 _anon_0 : 8;
  unsigned __int32 BITFLD_DCOAMPIC_HP_RX : 4;
  unsigned __int32 BITFLD_DCOAMPIC_HP_TX : 4;
  unsigned __int32 BITFLD_DCOAMPIC_LP_RX : 4;
  unsigned __int32 BITFLD_DCOAMPIC_LP_TX : 4;
};

/* 676 */
struct __ADPLL_TXMOD_CTRL_REG
{
  unsigned __int32 BITFLD_BT_SEL : 1;
  unsigned __int32 BITFLD_TX_DATA_INV : 1;
  unsigned __int32 BITFLD_MOD_INDEX : 2;
  unsigned __int32 BITFLD_EO_PACKET_DIS : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_TX_MODE : 2;
  unsigned __int32 BITFLD_INV_CKMODEXT : 1;
};

/* 677 */
struct __ADPLL_SDMOD_CTRL_REG
{
  unsigned __int32 BITFLD_SDMMODERX : 3;
  unsigned __int32 BITFLD_SDMMODETX : 3;
};

/* 678 */
struct __ADPLL_LF_CTRL1_REG
{
  unsigned __int32 BITFLD_FINETAU : 5;
  unsigned __int32 BITFLD_FINEK : 5;
  unsigned __int32 BITFLD_FINEKZ : 6;
};

/* 679 */
struct __ADPLL_LF_CTRL2_REG
{
  unsigned __int32 BITFLD_MODTAU_TUNE : 6;
  unsigned __int32 BITFLD_MODK_TUNE : 6;
  unsigned __int32 BITFLD_MODTAU : 6;
  unsigned __int32 BITFLD_MODK : 6;
  unsigned __int32 BITFLD_MODKZ : 6;
  unsigned __int32 BITFLD_RST_TAU_EN : 1;
};

/* 680 */
struct __ADPLL_ANA_CTRL_REG
{
  unsigned __int32 BITFLD_TDC_DTCIN_EN : 1;
  unsigned __int32 BITFLD_TDC_CKVIN_EN : 1;
  unsigned __int32 BITFLD_TDC_INV : 1;
  unsigned __int32 BITFLD_INV_CKTDC : 1;
  unsigned __int32 BITFLD_INV_CKPHV : 1;
  unsigned __int32 BITFLD_INV_CKDCOMOD : 1;
  unsigned __int32 BITFLD_EN_CKDCOMOD : 1;
  unsigned __int32 BITFLD_TGLDETEN : 1;
  unsigned __int32 BITFLD_DTCOFFSET : 7;
  unsigned __int32 BITFLD_DTC_EN : 1;
  unsigned __int32 BITFLD_TDC_OFFSET : 6;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_VPASETTLE : 2;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_DTC_LDO_DMY : 2;
};

/* 681 */
struct __ADPLL_DIV_CTRL_REG
{
  unsigned __int32 BITFLD_FBDIV_EN : 1;
  unsigned __int32 BITFLD_RXDIV_FB_EN_RX : 1;
  unsigned __int32 BITFLD_RXDIV_FB_EN_TX : 1;
  unsigned __int32 _anon_0 : 5;
  unsigned __int32 BITFLD_RXDIV_TRIM : 9;
  unsigned __int32 BITFLD_TXDIV_TRIM : 9;
};

/* 682 */
struct __ADPLL_INIT_CTRL_REG
{
  unsigned __int32 BITFLD_DCOCOARSEIC : 4;
  unsigned __int32 BITFLD_DCOMEDIUMIC : 3;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_DCOFINEIC : 6;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_DCOMODIC : 13;
};

/* 683 */
struct __ADPLL_FSM_CTRL_REG
{
  unsigned __int32 BITFLD_TCOARSE : 4;
  unsigned __int32 BITFLD_TMEDIUM : 4;
  unsigned __int32 BITFLD_TFINE : 4;
  unsigned __int32 BITFLD_TMOD : 4;
  unsigned __int32 BITFLD_TPASETTLE : 4;
  unsigned __int32 BITFLD_TSETTLE : 4;
  unsigned __int32 BITFLD_TVPASETTLE : 6;
};

/* 684 */
struct __ADPLL_MON_CTRL_REG
{
  unsigned __int32 BITFLD_TFREQMEAS : 5;
  unsigned __int32 BITFLD_TMREN : 1;
  unsigned __int32 BITFLD_ENRFMEAS : 1;
  unsigned __int32 BITFLD_RFMEAS_MODE : 1;
  unsigned __int32 BITFLD_HOLD_STATE : 4;
  unsigned __int32 _anon_0 : 4;
  unsigned __int32 BITFLD_QUALMONMOD : 2;
  unsigned __int32 BITFLD_QUALMONWND : 6;
  unsigned __int32 BITFLD_QUALMONTRHLD : 6;
  unsigned __int32 BITFLD_QUALMONFRCEN : 1;
};

/* 685 */
struct __ADPLL_MISC_CTRL_REG
{
  unsigned __int32 BITFLD_DLYFCWDT : 2;
  unsigned __int32 BITFLD_RESDLY : 2;
  unsigned __int32 BITFLD_MODDLY : 2;
  unsigned __int32 BITFLD_ENRESIDUE : 1;
  unsigned __int32 BITFLD_ENFCWMOD : 1;
  unsigned __int32 BITFLD_PHR_FRAC_PRESET_VAL : 16;
};

/* 686 */
struct __ADPLL_OVERRULE_CTRL1_REG
{
  unsigned __int32 BITFLD_OVR_ACTIVE_SEL : 1;
  unsigned __int32 BITFLD_OVR_ACTIVE_WR : 1;
  unsigned __int32 BITFLD_OVR_RXBIT_SEL : 1;
  unsigned __int32 BITFLD_OVR_RXBIT_WR : 1;
  unsigned __int32 BITFLD_OVR_ENPAIN_SEL : 1;
  unsigned __int32 BITFLD_OVR_ENPAIN_WR : 1;
  unsigned __int32 BITFLD_OVR_SRESETN_SEL : 1;
  unsigned __int32 BITFLD_OVR_SRESETN_WR : 1;
  unsigned __int32 BITFLD_OVR_VPAEN_SEL : 1;
  unsigned __int32 BITFLD_OVR_VPAEN_WR : 1;
  unsigned __int32 BITFLD_OVR_RDYFORDIV_SEL : 1;
  unsigned __int32 BITFLD_OVR_RDYFORDIV_WR : 1;
  unsigned __int32 BITFLD_OVR_DCOAMPHOLD_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOAMPHOLD_WR : 1;
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_OVR_DCOAMP_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOAMP_WR : 4;
  unsigned __int32 _anon_1 : 3;
  unsigned __int32 BITFLD_OVR_DTC_OH_SEL : 1;
  unsigned __int32 BITFLD_OVR_DTC_OH_WR : 7;
};

