hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 687 */
struct __ADPLL_OVERRULE_CTRL2_REG
{
  unsigned __int32 BITFLD_OVR_DCOCOARSE_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOCOARSE_WR : 4;
  unsigned __int32 _anon_0 : 3;
  unsigned __int32 BITFLD_OVR_DCOMEDIUM_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOMEDIUM_WR : 3;
  unsigned __int32 _anon_1 : 4;
  unsigned __int32 BITFLD_OVR_DCOFINE_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOFINE_WR : 6;
  unsigned __int32 BITFLD_OVR_DCOMOD_SEL : 1;
  unsigned __int32 BITFLD_OVR_DCOMOD_WR : 8;
};

/* 688 */
struct __ADPLL_OVERRULE_CTRL3_REG
{
  unsigned __int32 BITFLD_OVR_RXDIV_EN_SEL : 1;
  unsigned __int32 BITFLD_OVR_RXDIV_EN_WR : 1;
  unsigned __int32 BITFLD_OVR_TXDIV_EN_SEL : 1;
  unsigned __int32 BITFLD_OVR_TXDIV_EN_WR : 1;
  unsigned __int32 BITFLD_OVR_FBDIV_EN_SEL : 1;
  unsigned __int32 BITFLD_OVR_FBDIV_EN_WR : 1;
  unsigned __int32 BITFLD_OVR_RXDIV_FB_EN_SEL : 1;
  unsigned __int32 BITFLD_OVR_RXDIV_FB_EN_WR : 1;
};

/* 689 */
struct __ADPLL_RFPT_CTRL_REG
{
  unsigned __int32 BITFLD_RFPT_MUX : 4;
  unsigned __int32 BITFLD_INV_CKRFPT : 1;
  unsigned __int32 BITFLD_RFPT_RATE : 1;
  unsigned __int32 _anon_0 : 1;
};

/* 690 */
struct __ADPLL_ANATST_CTRL_REG
{
  unsigned __int32 BITFLD_ANATSTEN : 16;
  unsigned __int32 BITFLD_ANATSTSPARE : 16;
};

/* 691 */
struct __ADPLL_ACC_CTRL_REG
{
  unsigned __int32 BITFLD_CLIP_MOD_TUNE_0_RX : 13;
  unsigned __int32 _anon_0 : 3;
  unsigned __int32 BITFLD_CLIP_MOD_TUNE_0_TX : 13;
  unsigned __int32 _anon_1 : 2;
  unsigned __int32 BITFLD_EN_CMF_AVG : 1;
};

/* 692 */
struct __ADPLL_FREQMEAS_RD_REG
{
  unsigned __int32 BITFLD_FREQDIFF : 23;
  unsigned __int32 BITFLD_PHVSA1 : 1;
  unsigned __int32 BITFLD_PHVSA0 : 1;
  unsigned __int32 BITFLD_TDCBUB : 1;
  unsigned __int32 BITFLD_QUALMONDET : 1;
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_MEASDONE_OUT : 1;
};

/* 693 */
struct __ADPLL_DCO_RD_REG
{
  unsigned __int32 BITFLD_DCOCOARSE : 4;
  unsigned __int32 BITFLD_DCOMEDIUM : 3;
  unsigned __int32 BITFLD_DCOFINE : 6;
  unsigned __int32 BITFLD_DCOMOD : 13;
  unsigned __int32 BITFLD_DCOAMP : 4;
};

/* 694 */
struct __ADPLL_KDCO_RD_REG
{
  unsigned __int32 BITFLD_KDCO_HF_INT : 8;
  unsigned __int32 BITFLD_KDCO_HF_OUT : 8;
  unsigned __int32 BITFLD_KDCOCN : 7;
  unsigned __int32 BITFLD_CAL_KDCOCAL : 1;
};

/* 695 */
struct __ADPLL_KDTC_RD_REG
{
  unsigned __int32 BITFLD_KDTC_OUT : 9;
  unsigned __int32 BITFLD_KDTCCN : 7;
  unsigned __int32 BITFLD_KDTC_ALPHA_COMP : 9;
  unsigned __int32 BITFLD_CAL_KDTCCAL : 1;
};

/* 696 */
struct __ADPLL_TUNESTATE_RD_REG
{
  unsigned __int32 BITFLD_TUNE_STATE : 4;
  unsigned __int32 BITFLD_TMRVAL : 10;
};

/* 697 */
struct __ADPLL_PLLFCWDT_RD_REG
{
  unsigned __int32 BITFLD_PLLFCWDT : 23;
};

/* 698 */
struct __ADPLL_ANATST_RD_REG
{
  unsigned __int32 BITFLD_ANATSTSPARE_IN : 16;
};

/* 699 */
struct __PATCH_VALID_REG
{
  unsigned __int32 BITFLD_PATCH_VALID : 22;
};

/* 700 */
struct __PATCH_ADDR0_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 701 */
struct __PATCH_ADDR1_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 702 */
struct __PATCH_ADDR2_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 703 */
struct __PATCH_ADDR3_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 704 */
struct __PATCH_ADDR4_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 705 */
struct __PATCH_ADDR5_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 706 */
struct __PATCH_ADDR6_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 707 */
struct __PATCH_ADDR7_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 708 */
struct __PATCH_ADDR8_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 709 */
struct __PATCH_ADDR9_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 710 */
struct __PATCH_ADDR10_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 711 */
struct __PATCH_ADDR11_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 712 */
struct __PATCH_ADDR12_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 713 */
struct __PATCH_ADDR13_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 714 */
struct __PATCH_ADDR14_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 715 */
struct __PATCH_ADDR15_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 716 */
struct __PATCH_ADDR16_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

