hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 717 */
struct __PATCH_ADDR17_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 718 */
struct __PATCH_ADDR18_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 719 */
struct __PATCH_ADDR19_REG
{
  unsigned __int32 _anon_0 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_C : 17;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 720 */
struct __PATCH_ADDR20_REG
{
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_PATCH_ADDR_D : 16;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 721 */
struct __PATCH_DATA20_REG
{
  unsigned __int32 BITFLD_PATCH_DATA : 32;
};

/* 722 */
struct __PATCH_ADDR21_REG
{
  unsigned __int32 _anon_0 : 2;
  unsigned __int32 BITFLD_PATCH_ADDR_D : 16;
  unsigned __int32 _anon_1 : 1;
  unsigned __int32 BITFLD_PATCH_ADDR_19 : 1;
};

/* 723 */
struct __PATCH_DATA21_REG
{
  unsigned __int32 BITFLD_PATCH_DATA : 32;
};

/* 724 */
struct __CLK_XTAL32K_REG
{
  unsigned __int16 BITFLD_XTAL32K_ENABLE : 1;
  unsigned __int16 BITFLD_XTAL32K_RBIAS : 2;
  unsigned __int16 BITFLD_XTAL32K_CUR : 4;
  unsigned __int16 BITFLD_XTAL32K_DISABLE_AMPREG : 1;
  unsigned __int16 BITFLD_XTAL32K_XTAL1_BIAS_DISABLE : 1;
};

/* 725 */
struct __ANA_STATUS_REG
{
  unsigned __int16 BITFLD_LDO_CORE_OK : 1;
  unsigned __int16 BITFLD_LDO_LOW_OK : 1;
  unsigned __int16 BITFLD_DCDC_OK : 1;
  unsigned __int16 BITFLD_COMP_VBAT_HIGH_OK : 1;
  unsigned __int16 BITFLD_COMP_VBAT_HIGH_NOK : 1;
  unsigned __int16 BITFLD_BANDGAP_OK : 1;
  unsigned __int16 BITFLD_POR_VBAT_LOW : 1;
  unsigned __int16 BITFLD_POR_VBAT_HIGH : 1;
  unsigned __int16 BITFLD_BOOST_SELECTED : 1;
  unsigned __int16 BITFLD_LDO_XTAL_OK : 1;
  unsigned __int16 BITFLD_LDO_GPADC_OK : 1;
  unsigned __int16 BITFLD_FORCE_RUNNING : 1;
  unsigned __int16 BITFLD_CLKLESS_WAKEUP_STAT : 1;
};

/* 726 */
struct __XTALRDY_STAT_REG
{
  unsigned __int16 BITFLD_XTALRDY_STAT : 8;
};

/* 727 */
struct __XTAL32M_CTRL0_REG
{
  unsigned __int16 BITFLD_DCBLOCK_ENABLE : 1;
  unsigned __int16 BITFLD_CORE_AMPL_REG_NULLBIAS : 1;
  unsigned __int16 BITFLD_CORE_CUR_SET : 3;
  unsigned __int16 BITFLD_CORE_AMPL_TRIM : 3;
  unsigned __int16 BITFLD_XTAL32M_SPARE : 2;
};

/* 728 */
struct __POWER_LEVEL_REG
{
  unsigned __int16 BITFLD_LDO_CORE_LEVEL : 1;
  unsigned __int16 BITFLD_LDO_LOW_TRIM : 3;
  unsigned __int16 BITFLD_LDO_XTAL_TRIM : 3;
  unsigned __int16 BITFLD_LDO_CORE_RET_CUR_TRIM : 2;
  unsigned __int16 BITFLD_DCDC_LEVEL : 2;
  unsigned __int16 BITFLD_DCDC_TRIM : 3;
};

/* 729 */
struct __DCDC_TEST1_REG
{
  unsigned __int16 BITFLD_DCDC_FORCE_IDLE : 1;
  unsigned __int16 BITFLD_DCDC_FORCE_TRIG : 1;
  unsigned __int16 BITFLD_DCDC_SW_TST : 2;
  unsigned __int16 BITFLD_DCDC_FORCE_COMP_CLK : 1;
  unsigned __int16 BITFLD_DCDC_FORCE_COMP_TRIM : 1;
  unsigned __int16 BITFLD_DCDC_FORCE_ILIM : 1;
  unsigned __int16 BITFLD_DCDC_COMP_CLK_VAL : 1;
  unsigned __int16 BITFLD_DCDC_ILIM_VAL : 4;
  unsigned __int16 BITFLD_DCDC_DIG_TST_SEL : 3;
};

/* 730 */
struct __DCDC_TEST2_REG
{
  unsigned __int16 BITFLD_DCDC_COMP_TRIM_VAL : 6;
};

/* 731 */
struct __DCDC_STATUS1_REG
{
  unsigned __int16 BITFLD_DCDC_VDCDC_OK : 1;
  unsigned __int16 BITFLD_DCDC_ENABLED : 1;
  unsigned __int16 BITFLD_DCDC_STARTUP_COMPLETE : 1;
  unsigned __int16 BITFLD_DCDC_BOOST_MODE : 1;
  unsigned __int16 BITFLD_DCDC_ILIM : 4;
  unsigned __int16 BITFLD_DCDC_VOUT_OK : 1;
  unsigned __int16 BITFLD_DCDC_VOUT_NOK : 1;
  unsigned __int16 BITFLD_DCDC_SW_STATE : 2;
  unsigned __int16 BITFLD_DCDC_FSM_STATE : 4;
};

/* 732 */
struct __DCDC_STATUS2_REG
{
  unsigned __int16 BITFLD_DCDC_COMP_N_CONT : 1;
  unsigned __int16 BITFLD_DCDC_COMP_N_DYN_N : 1;
  unsigned __int16 BITFLD_DCDC_COMP_N_DYN_P : 1;
  unsigned __int16 BITFLD_DCDC_COMP_P_CONT : 1;
  unsigned __int16 BITFLD_DCDC_COMP_P_DYN_N : 1;
  unsigned __int16 BITFLD_DCDC_COMP_P_DYN_P : 1;
  unsigned __int16 BITFLD_DCDC_TIMEOUT_NSW : 1;
  unsigned __int16 BITFLD_DCDC_TIMEOUT_PSW : 1;
  unsigned __int16 BITFLD_DCDC_COMP_TRIM : 6;
};

/* 733 */
struct __POWER_AON_CTRL_REG
{
  unsigned __int16 BITFLD_VBAT_HL_CONNECT_RES_CTRL : 2;
  unsigned __int16 BITFLD_POR_VBAT_LOW_RST_MASK : 1;
  unsigned __int16 BITFLD_POR_VBAT_HIGH_RST_MASK : 1;
  unsigned __int16 BITFLD_RC32K_HIGH_SPEED_FORCE : 1;
  unsigned __int16 BITFLD_RC32K_LOW_SPEED_FORCE : 1;
  unsigned __int16 BITFLD_CHARGE_VBAT_DISABLE : 1;
  unsigned __int16 BITFLD_BOOST_MODE_FORCE : 2;
  unsigned __int16 BITFLD_CMP_VCONT_SLP_DISABLE : 1;
  unsigned __int16 BITFLD_LDO_RET_TRIM : 4;
  unsigned __int16 BITFLD_FORCE_RUNNING_COMP_DIS : 1;
};

/* 734 */
struct __GP_DATA_REG
{
  unsigned __int16 BITFLD_SW_GP_DATA : 4;
  unsigned __int16 BITFLD_DISABLE_CLAMP_OVERRULE : 1;
  unsigned __int16 BITFLD_FORCE_RCX_VREF : 1;
  unsigned __int16 BITFLD_FORCE_RCX_VDD : 1;
  unsigned __int16 BITFLD_P03_P04_FILT_DIS : 1;
};

/* 735 */
struct __TEST_VDD_REG
{
  unsigned __int16 BITFLD_TEST_VDD : 1;
  unsigned __int16 BITFLD_LDOS_DISABLE : 1;
};

/* 736 */
struct __GP_ADC_CTRL_REG
{
  unsigned __int16 BITFLD_GP_ADC_EN : 1;
  unsigned __int16 BITFLD_GP_ADC_START : 1;
  unsigned __int16 BITFLD_GP_ADC_CONT : 1;
  unsigned __int16 BITFLD_GP_ADC_DMA_EN : 1;
  unsigned __int16 BITFLD_GP_ADC_INT : 1;
  unsigned __int16 BITFLD_GP_ADC_MINT : 1;
  unsigned __int16 BITFLD_GP_ADC_SE : 1;
  unsigned __int16 BITFLD_GP_ADC_MUTE : 1;
  unsigned __int16 BITFLD_GP_ADC_SIGN : 1;
  unsigned __int16 BITFLD_GP_ADC_CHOP : 1;
  unsigned __int16 BITFLD_GP_ADC_LDO_HOLD : 1;
  unsigned __int16 BITFLD_GP_ADC_OFFS_SH_GAIN_SEL : 1;
  unsigned __int16 BITFLD_DIE_TEMP_EN : 1;
};

