hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 737 */
struct __GP_ADC_SEL_REG
{
  unsigned __int16 BITFLD_GP_ADC_SEL_N : 3;
  unsigned __int16 BITFLD_GP_ADC_SEL_N_TST : 1;
  unsigned __int16 BITFLD_GP_ADC_SEL_P : 3;
  unsigned __int16 BITFLD_GP_ADC_SEL_P_TST : 1;
};

/* 738 */
struct __SCAN_OBSERVE_REG
{
  unsigned __int16 BITFLD_SCAN_FEEDBACK_MUX : 16;
};

/* 739 */
struct __TEST_CTRL_REG
{
  unsigned __int16 BITFLD_SHOW_CLOCKS : 1;
  unsigned __int16 BITFLD_SHOW_POWER : 1;
  unsigned __int16 BITFLD_SHOW_DCDC : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_XTAL32M_CAP_TEST_EN : 1;
  unsigned __int16 BITFLD_LDO_CORE_CAP_BYPASS : 1;
  unsigned __int16 BITFLD_LDO_CORE_DUMMY_LOAD_ENABLE : 1;
  unsigned __int16 _anon_1 : 2;
  unsigned __int16 BITFLD_CP_CAP_BIAS_TRIM : 2;
  unsigned __int16 BITFLD_ADPLL_SCAN_TEST_EN : 1;
  unsigned __int16 BITFLD_ADPLL_SCAN_COMP_EN : 1;
};

/* 740 */
struct __TEST_CTRL2_REG
{
  unsigned __int16 BITFLD_ANA_TEST_OUT_SEL : 10;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_ANA_TEST_OUT_TO_PIN : 1;
  unsigned __int16 BITFLD_ANA_TEST_OUT_PARAM : 4;
};

/* 741 */
struct __TEST_CTRL3_REG
{
  unsigned __int16 BITFLD_RF_TEST_OUT_SEL : 6;
  unsigned __int16 BITFLD_ENABLE_RFPT : 1;
  unsigned __int16 BITFLD_RF_TEST_OUT_PARAM : 6;
  unsigned __int16 BITFLD_RF_TEST_OUT_TO_PIN : 1;
};

/* 742 */
struct __TEST_CTRL4_REG
{
  unsigned __int16 BITFLD_RF_TEST_IN_SEL : 4;
  unsigned __int16 _anon_0 : 4;
  unsigned __int16 BITFLD_RF_TEST_IN_PARAM : 5;
  unsigned __int16 BITFLD_RF_TEST_IN_TO_PIN : 1;
};

/* 743 */
struct __XTAL32M_TESTCTRL0_REG
{
  unsigned __int16 BITFLD_SPIKE_FLT_DISABLE : 1;
  unsigned __int16 BITFLD_OSC_TRIM_OPEN_DISABLE : 1;
  unsigned __int16 BITFLD_DIFFBUF_BYPASS : 1;
  unsigned __int16 BITFLD_DCBLOCK_LV_MODE : 1;
  unsigned __int16 BITFLD_CORE_XTAL_DISCHARGE : 1;
  unsigned __int16 BITFLD_CORE_MAX_CURRENT : 1;
  unsigned __int16 BITFLD_CORE_I2V_TO_TESTBUS_10X : 1;
  unsigned __int16 BITFLD_CORE_I2V_TO_TESTBUS : 1;
  unsigned __int16 BITFLD_CORE_HOLD_AMP_REG_OVERRIDE : 2;
  unsigned __int16 BITFLD_CORE_GM_CURRENT : 1;
  unsigned __int16 BITFLD_CORE_FREQ_TRIM_SW2_AMP : 3;
  unsigned __int16 BITFLD_BIAS_SAH_HOLD_OVERRIDE : 2;
};

/* 744 */
struct __XTAL32M_TESTCTRL1_REG
{
  unsigned __int16 BITFLD_DISABLE_TM_CLK : 1;
  unsigned __int16 BITFLD_LDO_VREF_HOLD_OVERRIDE : 1;
  unsigned __int16 BITFLD_VARICAP_TEST_ENABLE : 1;
  unsigned __int16 BITFLD_VARICAP_TEST_SEL_XTAL : 1;
  unsigned __int16 BITFLD_PROG_VREF_SEL : 1;
  unsigned __int16 BITFLD_RFCLK_ADPLL_TO_GPIO : 1;
  unsigned __int16 BITFLD_RFCLK_ADC_TO_GPIO : 1;
  unsigned __int16 BITFLD_RFCLK_SEL_ADPLL_ADC_TO_GPIO : 1;
  unsigned __int16 BITFLD_OSC_TRIM_CAP_BIAS : 1;
};

/* 745 */
struct __BIST_CTRL_REG
{
  unsigned __int16 BITFLD_RAM_BIST_CONFIG : 2;
  unsigned __int16 BITFLD_ROMBIST_ENABLE : 1;
  unsigned __int16 BITFLD_SYSRAM12_BIST_ENABLE : 1;
  unsigned __int16 _anon_0 : 1;
  unsigned __int16 BITFLD_ROM_BIST_BUSY : 1;
  unsigned __int16 _anon_1 : 1;
  unsigned __int16 BITFLD_SYSRAM3_BIST_FAIL : 1;
  unsigned __int16 BITFLD_SYSRAM3_BIST_BUSY : 1;
  unsigned __int16 _anon_2 : 1;
  unsigned __int16 BITFLD_SYSRAM12_BIST_FAIL : 1;
  unsigned __int16 BITFLD_SYSRAM12_BIST_BUSY : 1;
  unsigned __int16 BITFLD_RAM_BIST_PATTERN : 2;
  unsigned __int16 BITFLD_SYSRAM3_BIST_ENABLE : 1;
};

/* 746 */
struct __ROMBIST_RESULTL_REG
{
  unsigned __int16 BITFLD_ROMBIST_RESULTL : 16;
};

/* 747 */
struct __ROMBIST_RESULTH_REG
{
  unsigned __int16 BITFLD_ROMBIST_RESULTH : 16;
};

/* 748 */
struct __MEM_CTRL_REG
{
  unsigned __int16 BITFLD_ROM_MARGIN_CTRL : 4;
  unsigned __int16 BITFLD_ROM_MARGIN_EN : 1;
  unsigned __int16 BITFLD_RAM_DST : 1;
  unsigned __int16 BITFLD_RAM_MARGIN : 2;
  unsigned __int16 BITFLD_ARB1_AHB_WR_BUFF : 1;
  unsigned __int16 BITFLD_ARB1_AHB2_WR_BUFF : 1;
  unsigned __int16 BITFLD_ARB2_AHB_WR_BUFF : 1;
  unsigned __int16 BITFLD_ARB2_AHB2_WR_BUFF : 1;
};

/* 749 */
struct __RFMON_CTRL_REG
{
  unsigned __int16 BITFLD_RFMON_PACK_EN : 1;
  unsigned __int16 BITFLD_RFMON_CIRC_EN : 1;
};

/* 750 */
struct __RFMON_ADDR_REG
{
  unsigned __int16 _anon_0 : 2;
  unsigned __int16 BITFLD_RFMON_ADDR : 14;
};

/* 751 */
struct __RFMON_LEN_REG
{
  unsigned __int16 BITFLD_RFMON_LEN : 14;
};

/* 752 */
struct __RFMON_STAT_REG
{
  unsigned __int16 BITFLD_RFMON_ACTIVE : 1;
  unsigned __int16 BITFLD_RFMON_OFLOW_STK : 1;
};

/* 753 */
struct __RFMON_CRV_ADDR_REG
{
  unsigned __int16 _anon_0 : 2;
  unsigned __int16 BITFLD_RFMON_CRV_ADDR : 14;
};

/* 754 */
struct __RFMON_CRV_LEN_REG
{
  unsigned __int16 BITFLD_RFMON_CRV_LEN : 14;
};

/* 755 */
struct __CLK_RTCDIV_REG
{
  unsigned __int32 BITFLD_RTC_DIV_FRAC : 10;
  unsigned __int32 BITFLD_RTC_DIV_INT : 9;
  unsigned __int32 BITFLD_RTC_DIV_DENOM : 1;
  unsigned __int32 BITFLD_RTC_DIV_ENABLE : 1;
  unsigned __int32 BITFLD_RTC_RESET_REQ : 1;
};

/* 756 */
struct hci_change_uart_pins_action_dialog_cmd
{
  uint8_t tx_port;
  uint8_t tx_pin;
  uint8_t rx_port;
  uint8_t rx_pin;
};

/* 757 */
struct hci_change_uart_pins_action_dialog_cmd_cmp_evt
{
  uint16_t status;
};

/* 758 */
struct hci_register_rw_dialog_cmd
{
  uint8_t operation;
  uint32_t addr;
  uint32_t data;
};

/* 759 */
struct hci_register_rw_dialog_cmd_cmp_evt
{
  uint8_t operation;
  uint8_t reserved;
  uint32_t data;
};

/* 760 */
enum $466636C3164ED2AA712617FD837800E9 : __int8
{
  CMD__REGISTER_RW_OP_READ_REG32 = 0x0,
  CMD__REGISTER_RW_OP_WRITE_REG32 = 0x1,
  CMD__REGISTER_RW_OP_READ_REG16 = 0x2,
  CMD__REGISTER_RW_OP_WRITE_REG16 = 0x3,
};

/* 761 */
struct hci_tx_start_continue_test_dialog_cmd
{
  uint8_t frequency;
  uint8_t payload_type;
};

/* 762 */
struct hci_otp_rw_dialog_cmd
{
  uint8_t operation;
  uint8_t data[6];
};

/* 763 */
struct hci_otp_rw_dialog_cmd_cmp_evt
{
  uint8_t operation;
  uint8_t data[6];
};

/* 764 */
enum $B80D95A80997F9506D6F7AD09FCD7140 : __int8
{
  CMD__OTP_OP_RD_XTRIM = 0x0,
  CMD__OTP_OP_WR_XTRIM = 0x1,
  CMD__OTP_OP_RD_BDADDR = 0x2,
  CMD__OTP_OP_WR_BDADDR = 0x3,
  CMD__OTP_OP_RE_XTRIM = 0x4,
  CMD__OTP_OP_WE_XTRIM = 0x5,
};

/* 765 */
struct hci_xtal_trim_dialog_cmd
{
  uint8_t operation;
  uint8_t trim_LSB;
  uint8_t trim_MSB;
};

/* 766 */
struct hci_xtal_trim_dialog_cmd_cmp_evt
{
  uint16_t trim_value;
};

