hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 767 */
enum $D577D9937A394EBE5F6C00D7EE4E620B : __int8
{
  CMD__XTRIM_OP_RD = 0x0,
  CMD__XTRIM_OP_WR = 0x1,
  CMD__XTRIM_OP_EN = 0x2,
  CMD__XTRIM_OP_INC = 0x3,
  CMD__XTRIM_OP_DEC = 0x4,
  CMD__XTRIM_OP_DIS = 0x5,
  CMD__XTRIM_OP_CALTEST = 0x6,
  CMD__XTRIM_OP_CAL = 0x7,
};

/* 768 */
struct hci_start_prod_rx_dialog_cmd
{
  uint8_t frequency;
};

/* 769 */
struct hci_end_prod_rx_dialog_cmd_cmp_evt
{
  uint16_t rp;
  uint16_t rp_SYNC_error;
  uint16_t rp_CRC_error;
  uint16_t RSSI;
};

/* 770 */
struct hci_unmodulated_on_dialog_cmd
{
  uint8_t operation;
  uint8_t frequency;
};

/* 771 */
enum $2008E1676ACC4C579779B87F1EB090C9 : __int8
{
  UNMODULATED_CMD_MODE_OFF = 0x4F,
  UNMODULATED_CMD_MODE_TX = 0x54,
  UNMODULATED_CMD_MODE_RX = 0x52,
};

/* 772 */
struct hci_tx_test_dialog_cmd
{
  uint8_t frequency;
  uint8_t data_length;
  uint8_t payload_type;
  uint8_t NpacketsLSB;
  uint8_t NpacketsMSB;
};

/* 773 */
struct hci_sleep_test_dialog_cmd
{
  uint8_t sleep_mode;
  uint8_t mins_to_sleep;
  uint8_t seconds_to_sleep;
};

/* 774 */
enum $B2D324AACB570A0167DEB3BB0E7735A9 : __int8
{
  CMD__SLEEP_MODE_ACTIVE = 0x0,
  CMD__SLEEP_MODE_EXTENDED = 0x1,
  CMD__SLEEP_MODE_DEEP = 0x2,
};

/* 775 */
struct hci_rdtest_dialog_cmd
{
  uint8_t operation;
  uint16_t data;
};

/* 776 */
enum $F0B99D9267E12F8A7553B01C2ED1CF76 : __int8
{
  RDTESTER_INIT = 0x0,
  RDTESTER_UART_CONNECT = 0x1,
  RDTESTER_UART_LOOPBACK = 0x2,
  RDTESTER_VBAT_CNTRL = 0x3,
  RDTESTER_VPP_CNTRL = 0x4,
  RDTESTER_RST_PULSE = 0x5,
  RDTESTER_UART_PULSE = 0x6,
  RDTESTER_XTAL_PULSE = 0x7,
  RDTESTER_PULSE_WIDTH = 0x8,
};

/* 777 */
struct __attribute__((aligned(2))) hci_otp_read_dialog_cmd
{
  uint16_t address;
  uint8_t num_of_words;
};

/* 778 */
struct hci_otp_read_dialog_cmd_cmp_evt
{
  uint8_t status;
  uint8_t num_of_words;
  uint8_t wordbyte[240];
};

/* 779 */
struct __attribute__((aligned(2))) hci_otp_write_dialog_cmd
{
  uint16_t start_addr;
  uint8_t num_of_words;
  uint8_t wordbyte[240];
};

/* 780 */
struct hci_otp_write_dialog_cmd_cmp_evt
{
  uint8_t status;
  uint8_t num_of_words;
};

/* 781 */
struct hci_sensor_test_dialog_cmd
{
  uint8_t interface;
  uint8_t rw;
  uint8_t spi_clk_or_i2c_port;
  uint8_t spi_clk_or_i2c_pin;
  uint8_t spi_di_or_i2c_sda_port;
  uint8_t spi_di_or_i2c_sda_pin;
  uint8_t spi_do_port;
  uint8_t spi_do_pin;
  uint8_t spi_cs_port;
  uint8_t spi_cs_pin;
  uint8_t register_address;
  uint8_t register_data_write;
  uint8_t i2c_slave_address;
  uint8_t int_gpio_check;
  uint8_t int_port;
  uint8_t int_pin;
  uint8_t pins_voltage_level;
};

/* 782 */
struct hci_sensor_test_dialog_cmd_cmp_evt
{
  uint16_t data;
};

/* 783 */
struct hci_gpio_set_dialog_cmd
{
  uint8_t gpio_pad;
  uint8_t mode;
  uint8_t gpio_lvl;
  uint8_t val;
  uint8_t pwm;
  uint8_t duty_cycle;
};

/* 784 */
struct hci_gpio_set_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 785 */
struct hci_gpio_read_dialog_cmd
{
  uint8_t gpio_pad;
};

/* 786 */
struct hci_gpio_read_dialog_cmd_cmp_evt
{
  uint8_t data;
};

/* 787 */
struct hci_uart_loop_dialog_cmd
{
  uint8_t data[100];
};

/* 788 */
struct hci_uart_loop_dialog_cmd_cmp_evt
{
  uint8_t data[100];
};

/* 789 */
struct hci_uart_baud_dialog_cmd
{
  uint8_t data;
};

/* 790 */
struct hci_uart_baud_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 791 */
struct hci_gpio_wd_dialog_cmd
{
  uint8_t gpio_pad;
  uint8_t gpio_lvl;
};

/* 792 */
struct hci_gpio_wd_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 793 */
struct hci_ext32khz_test_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 794 */
struct hci_sleep_clk_sel_dialog_cmd
{
  uint8_t sleep_clk;
};

/* 795 */
struct hci_sleep_clk_sel_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 796 */
struct hci_platform_reset_cmd_cmp_evt
{
  uint8_t error;
};

/* 797 */
struct hci_set_tx_power_dialog_cmd
{
  uint8_t data;
};

/* 798 */
struct hci_set_tx_power_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 799 */
struct hci_configure_test_mode_dialog_cmd
{
  uint8_t data;
};

/* 800 */
struct hci_configure_test_mode_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 801 */
struct hci_set_reset_mode_dialog_cmd
{
  uint8_t reset_mode;
};

/* 802 */
struct hci_set_reset_mode_dialog_cmd_cmp_evt
{
  uint8_t error;
};

/* 803 */
enum $63ACFEF8C523619207440F8E6DB55571 : __int16
{
  HCI_CUSTOM_ACTION_CMD_OPCODE = 0xFE00,
  HCI_SLEEP_TEST_CMD_OPCODE = 0xFE01,
  HCI_XTAL_TRIM_CMD_OPCODE = 0xFE02,
  HCI_OTP_RW_CMD_OPCODE = 0xFE03,
  HCI_OTP_READ_CMD_OPCODE = 0xFE04,
  HCI_OTP_WRITE_CMD_OPCODE = 0xFE05,
  HCI_REGISTER_RW_CMD_OPCODE = 0xFE06,
  HCI_AUDIO_TEST_CMD_OPCODE = 0xFE07,
  HCI_FIRMWARE_VERSION_GET_CMD_OPCODE = 0xFE08,
  HCI_CHANGE_UART_PINS_ACTION_CMD_OPCODE = 0xFE09,
  HCI_RDTESTER_CMD_OPCODE = 0xFE0A,
  HCI_TX_TEST_CMD_OPCODE = 0xFE0B,
  HCI_START_PROD_RX_TEST_CMD_OPCODE = 0xFE0C,
  HCI_END_PROD_RX_TEST_CMD_OPCODE = 0xFE0D,
  HCI_UNMODULATED_ON_CMD_OPCODE = 0xFE0E,
  HCI_TX_START_CONTINUE_TEST_CMD_OPCODE = 0xFE0F,
  HCI_TX_END_CONTINUE_TEST_CMD_OPCODE = 0xFE10,
  HCI_SENSOR_TEST_CMD_OPCODE = 0xFE11,
  HCI_GPIO_SET_CMD_OPCODE = 0xFE12,
  HCI_GPIO_READ_CMD_OPCODE = 0xFE13,
  HCI_UART_LOOP_CMD_OPCODE = 0xFE14,
  HCI_UART_BAUD_CMD_OPCODE = 0xFE15,
  HCI_EXT32KHz_TEST_CMD_OPCODE = 0xFE16,
  HCI_GPIO_WD_CMD_OPCODE = 0xFE17,
  HCI_SLEEP_CLK_SEL_CMD_OPCODE = 0xFE18,
  HCI_RANGE_EXT_EN_CMD_OPCODE = 0xFE19,
  HCI_ADC_VBAT_CMD_OPCODE = 0xFE1A,
  HCI_SET_TX_POWER_CMD_OPCODE = 0xFE1B,
  HCI_CONFIGURE_TEST_MODE_CMD_OPCODE = 0xFE1C,
  HCI_PLATFORM_RESET_CMD_OPCODE = 0xFE1D,
  HCI_RESET_MODE_CMD_OPCODE = 0xFE1E,
  HCI_VS_LAST_DIALOG_CMD_OPCODE = 0xFE1F,
};

/* 804 */
struct hci_adc_vbat_dialog_cmd
{
  uint8_t vbat_type;
};

/* 805 */
struct hci_adc_vbat_dialog_cmd_cmp_evt
{
  uint16_t vbat_lvl;
};

