hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 806 */
struct hci_custom_action_dialog_cmd
{
  uint8_t inputData;
};

/* 807 */
struct hci_custom_action_dialog_cmd_cmp_evt
{
  uint32_t returnData;
};

/* 808 */
struct hci_firmware_version_get_dialog_cmd_cmp_evt
{
  uint8_t ble_ver_len;
  uint8_t app_ver_len;
  unsigned __int8 ble_ver[32];
  unsigned __int8 app_ver[32];
};

/* 809 */
enum $0EF2724D3535E567100C7FF35643E526 : __int8
{
  LK_CNTL_OGF = 0x1,
  LK_POL_OGF = 0x2,
  CNTLR_BB_OGF = 0x3,
  INFO_PAR_OGF = 0x4,
  STAT_PAR_OGF = 0x5,
  TEST_OGF = 0x6,
  LE_CNTLR_OGF = 0x8,
  VS_OGF = 0x3F,
  MAX_OGF = 0x40,
};

/* 810 */
enum hci_evt_mask_page : __int8
{
  HCI_PAGE_0 = 0x0,
  HCI_PAGE_1 = 0x1,
  HCI_PAGE_2 = 0x2,
  HCI_PAGE_DFT = 0x3,
};

/* 811 */
struct __attribute__((aligned(2))) hci_acl_data_rx
{
  uint16_t conhdl;
  uint8_t pb_bc_flag;
  uint16_t length;
  uint8_t rx_hdl;
};

/* 812 */
struct __attribute__((aligned(2))) hci_acl_data_tx
{
  uint16_t conhdl;
  uint8_t pb_bc_flag;
  uint16_t length;
  co_buf_tx_node *desc;
  uint8_t *buffer;
  uint16_t index;
  uint8_t desc_cnt;
};

/* 813 */
struct hci_basic_conhdl_cmd
{
  uint16_t conhdl;
};

/* 814 */
struct hci_basic_bd_addr_cmd
{
  bd_addr bd_addr;
};

/* 815 */
struct hci_accept_con_req_cmd
{
  bd_addr bd_addr;
  uint8_t role;
};

/* 816 */
struct hci_accept_sync_con_req_cmd
{
  bd_addr bd_addr;
  uint32_t tx_bw;
  uint32_t rx_bw;
  uint16_t max_lat;
  uint16_t vx_set;
  uint8_t retx_eff;
  uint16_t pkt_type;
};

/* 817 */
struct __attribute__((aligned(2))) hci_enh_accept_sync_con_cmd
{
  bd_addr bd_addr;
  uint32_t tx_bw;
  uint32_t rx_bw;
  uint8_t tx_cod_fmt[5];
  uint8_t rx_cod_fmt[5];
  uint16_t tx_cod_fr_sz;
  uint16_t rx_cod_fr_sz;
  uint32_t in_bw;
  uint32_t out_bw;
  uint8_t in_cod_fmt[5];
  uint8_t out_cod_fmt[5];
  uint16_t in_cod_data_sz;
  uint16_t out_cod_data_sz;
  uint8_t in_data_fmt;
  uint8_t out_data_fmt;
  uint8_t in_msb_pos;
  uint8_t out_msb_pos;
  uint8_t in_data_path;
  uint8_t out_data_path;
  uint8_t in_tr_unit_sz;
  uint8_t out_tr_unit_sz;
  uint16_t max_lat;
  uint16_t packet_type;
  uint8_t retx_eff;
};

/* 818 */
struct hci_reject_con_req_cmd
{
  bd_addr bd_addr;
  uint8_t reason;
};

/* 819 */
struct hci_reject_sync_con_req_cmd
{
  bd_addr bd_addr;
  uint8_t reason;
};

/* 820 */
struct hci_lk_req_reply_cmd
{
  bd_addr bd_addr;
  ltk key;
};

/* 821 */
struct hci_pin_code_req_reply_cmd
{
  bd_addr bd_addr;
  uint8_t pin_len;
  pin_code pin;
};

/* 822 */
struct hci_switch_role_cmd
{
  bd_addr bd_addr;
  uint8_t role;
};

/* 823 */
struct hci_flow_spec_cmd
{
  uint16_t conhdl;
  uint8_t flags;
  uint8_t flow_dir;
  uint8_t serv_type;
  uint32_t tk_rate;
  uint32_t tk_buf_sz;
  uint32_t pk_bw;
  uint32_t acc_lat;
};

/* 824 */
struct __attribute__((aligned(2))) hci_enh_flush_cmd
{
  uint16_t conhdl;
  uint8_t pkt_type;
};

/* 825 */
struct hci_rd_auto_flush_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t flush_to;
};

/* 826 */
struct hci_wr_auto_flush_to_cmd
{
  uint16_t conhdl;
  uint16_t flush_to;
};

/* 827 */
struct hci_chg_con_pkt_type_cmd
{
  uint16_t conhdl;
  uint16_t pkt_type;
};

/* 828 */
struct hci_rd_link_pol_stg_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t lnk_policy;
};

/* 829 */
struct hci_wr_link_pol_stg_cmd
{
  uint16_t conhdl;
  uint16_t lnk_policy;
};

/* 830 */
struct hci_sniff_mode_cmd
{
  uint16_t conhdl;
  uint16_t max_int;
  uint16_t min_int;
  uint16_t attempt;
  uint16_t timeout;
};

/* 831 */
struct hci_sniff_sub_cmd
{
  uint16_t conhdl;
  uint16_t max_lat;
  uint16_t min_rem_to;
  uint16_t min_loc_to;
};

/* 832 */
struct __attribute__((aligned(2))) hci_role_discovery_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t role;
};

/* 833 */
struct hci_rd_fail_contact_cnt_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t fail_cnt;
};

/* 834 */
struct __attribute__((aligned(2))) hci_rd_link_qual_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t quality;
};

/* 835 */
struct __attribute__((aligned(2))) hci_rd_afh_ch_map_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t afh_stat;
  chnl_map afh_map;
};

/* 836 */
struct hci_rd_lmp_hdl_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t lmp_hdl;
  uint32_t rsvd;
};

/* 837 */
struct __attribute__((aligned(2))) hci_rd_rem_ext_feats_cmd
{
  uint16_t conhdl;
  uint8_t pg_nb;
};

/* 838 */
struct __attribute__((aligned(2))) hci_rd_enc_key_size_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t key_sz;
};

/* 839 */
struct __attribute__((aligned(2))) hci_rd_enh_tx_pwr_lvl_cmd
{
  uint16_t conhdl;
  uint8_t type;
};

/* 840 */
struct __attribute__((aligned(2))) hci_rd_enh_tx_pwr_lvl_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t pw_gfsk;
  uint8_t pw_dqpsk;
  uint8_t pw_8dpsk;
};

/* 841 */
struct hci_inq_cmd
{
  lap lap;
  uint8_t inq_len;
  uint8_t nb_rsp;
};

/* 842 */
struct __attribute__((aligned(2))) hci_per_inq_mode_cmd
{
  uint16_t max_per_len;
  uint16_t min_per_len;
  lap lap;
  uint8_t inq_len;
  uint8_t nb_rsp;
};

/* 843 */
struct __attribute__((aligned(2))) hci_create_con_cmd
{
  bd_addr bd_addr;
  uint16_t pkt_type;
  uint8_t page_scan_rep_mode;
  uint8_t rsvd;
  uint16_t clk_off;
  uint8_t switch_en;
};

/* 844 */
struct __attribute__((aligned(2))) hci_disconnect_cmd
{
  uint16_t conhdl;
  uint8_t reason;
};

/* 845 */
struct hci_master_lk_cmd
{
  uint8_t key_flag;
};

/* 846 */
struct __attribute__((aligned(2))) hci_set_con_enc_cmd
{
  uint16_t conhdl;
  uint8_t enc_en;
};

/* 847 */
struct hci_rem_name_req_cmd
{
  bd_addr bd_addr;
  uint8_t page_scan_rep_mode;
  uint8_t rsvd;
  uint16_t clk_off;
};

/* 848 */
struct hci_rem_name_req_cmp_evt
{
  uint8_t status;
  bd_addr bd_addr;
  device_name name;
};

/* 849 */
struct hci_setup_sync_con_cmd
{
  uint16_t conhdl;
  uint32_t tx_bw;
  uint32_t rx_bw;
  uint16_t max_lat;
  uint16_t vx_set;
  uint8_t retx_eff;
  uint16_t pkt_type;
};

