hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 850 */
struct __attribute__((aligned(2))) hci_enh_setup_sync_con_cmd
{
  uint16_t conhdl;
  uint32_t tx_bw;
  uint32_t rx_bw;
  uint8_t tx_cod_fmt[5];
  uint8_t rx_cod_fmt[5];
  uint16_t tx_cod_fr_sz;
  uint16_t rx_cod_fr_sz;
  uint32_t in_bw;
  uint32_t out_bw;
  uint8_t in_cod_fmt[5];
  uint8_t out_cod_fmt[5];
  uint16_t in_cod_data_sz;
  uint16_t out_cod_data_sz;
  uint8_t in_data_fmt;
  uint8_t out_data_fmt;
  uint8_t in_msb_pos;
  uint8_t out_msb_pos;
  uint8_t in_data_path;
  uint8_t out_data_path;
  uint8_t in_tr_unit_sz;
  uint8_t out_tr_unit_sz;
  uint16_t max_lat;
  uint16_t packet_type;
  uint8_t retx_eff;
};

/* 851 */
struct hci_io_cap_req_reply_cmd
{
  bd_addr bd_addr;
  uint8_t io_capa;
  uint8_t oob_data_pres;
  uint8_t auth_req;
};

/* 852 */
struct hci_io_cap_req_neg_reply_cmd
{
  bd_addr bd_addr;
  uint8_t reason;
};

/* 853 */
struct hci_user_passkey_req_reply_cmd
{
  bd_addr bd_addr;
  uint32_t num_val;
};

/* 854 */
struct hci_rem_oob_data_req_reply_cmd
{
  bd_addr bd_addr;
  hash oob_c;
  randomizer oob_r;
};

/* 855 */
struct hci_send_keypress_notif_cmd
{
  bd_addr bd_addr;
  uint8_t notif_type;
};

/* 856 */
struct hci_qos_setup_cmd
{
  uint16_t conhdl;
  uint8_t flags;
  uint8_t serv_type;
  uint32_t tok_rate;
  uint32_t pk_bw;
  uint32_t lat;
  uint32_t del_var;
};

/* 857 */
struct hci_rd_dft_link_pol_stg_cmd_cmp_evt
{
  uint8_t status;
  uint16_t link_pol_stg;
};

/* 858 */
struct hci_wr_dft_link_pol_stg_cmd
{
  uint16_t link_pol_stg;
};

/* 859 */
struct hci_set_evt_mask_cmd
{
  evt_mask event_mask;
};

/* 860 */
struct inq_res_filter_cond_1
{
  devclass class_of_dev;
  devclass class_of_dev_msk;
};

/* 861 */
struct inq_res_filter_cond_2
{
  bd_addr bd_addr;
};

/* 862 */
union hci_inq_filter_cond
{
  uint8_t cond_0_reserved;
  inq_res_filter_cond_1 cond_1;
  inq_res_filter_cond_2 cond_2;
};

/* 863 */
struct inq_res_filter
{
  uint8_t cond_type;
  hci_inq_filter_cond cond;
};

/* 864 */
struct con_set_filter_cond_0
{
  uint8_t auto_accept;
};

/* 865 */
struct con_set_filter_cond_1
{
  devclass class_of_dev;
  devclass class_of_dev_msk;
  uint8_t auto_accept;
};

/* 866 */
struct con_set_filter_cond_2
{
  bd_addr bd_addr;
  uint8_t auto_accept;
};

/* 867 */
union hci_con_filter_cond
{
  con_set_filter_cond_0 cond_0;
  con_set_filter_cond_1 cond_1;
  con_set_filter_cond_2 cond_2;
};

/* 868 */
struct con_set_filter
{
  uint8_t cond_type;
  hci_con_filter_cond cond;
};

/* 869 */
union hci_filter
{
  uint8_t clear_all_filter_reserved;
  inq_res_filter inq_res;
  con_set_filter con_set;
};

/* 870 */
struct hci_set_evt_filter_cmd
{
  uint8_t filter_type;
  hci_filter filter;
};

/* 871 */
struct hci_flush_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 872 */
struct hci_rd_pin_type_cmd_cmp_evt
{
  uint8_t status;
  uint8_t pin_type;
};

/* 873 */
struct hci_wr_pin_type_cmd
{
  uint8_t pin_type;
};

/* 874 */
struct hci_rd_stored_lk_cmd
{
  bd_addr bd_addr;
  uint8_t rd_all_flag;
};

/* 875 */
struct hci_rd_stored_lk_cmd_cmp_evt
{
  uint8_t status;
  uint16_t num_key_max;
  uint16_t num_key_rd;
};

/* 876 */
struct hci_wr_stored_lk_cmd_cmp_evt
{
  uint8_t status;
  uint8_t num_key_wr;
};

/* 877 */
struct hci_del_stored_lk_cmd
{
  bd_addr bd_addr;
  uint8_t del_all_flag;
};

/* 878 */
struct hci_del_stored_lk_cmd_cmp_evt
{
  uint8_t status;
  uint16_t num_key_del;
};

/* 879 */
struct hci_wr_local_name_cmd
{
  device_name name;
};

/* 880 */
struct hci_rd_local_name_cmd_cmp_evt
{
  uint8_t status;
  uint8_t name[248];
};

/* 881 */
struct hci_rd_con_accept_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t con_acc_to;
};

/* 882 */
struct hci_wr_con_accept_to_cmd
{
  uint16_t con_acc_to;
};

/* 883 */
struct hci_rd_page_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t page_to;
};

/* 884 */
struct hci_wr_page_to_cmd
{
  uint16_t page_to;
};

/* 885 */
struct hci_rd_scan_en_cmd_cmp_evt
{
  uint8_t status;
  uint8_t scan_en;
};

/* 886 */
struct hci_wr_scan_en_cmd
{
  uint8_t scan_en;
};

/* 887 */
struct hci_rd_page_scan_act_cmd_cmp_evt
{
  uint8_t status;
  uint16_t page_scan_intv;
  uint16_t page_scan_win;
};

/* 888 */
struct hci_wr_page_scan_act_cmd
{
  uint16_t page_scan_intv;
  uint16_t page_scan_win;
};

/* 889 */
struct hci_rd_inq_scan_act_cmd_cmp_evt
{
  uint8_t status;
  uint16_t inq_scan_intv;
  uint16_t inq_scan_win;
};

/* 890 */
struct hci_wr_inq_scan_act_cmd
{
  uint16_t inq_scan_intv;
  uint16_t inq_scan_win;
};

/* 891 */
struct hci_rd_auth_en_cmd_cmp_evt
{
  uint8_t status;
  uint8_t auth_en;
};

/* 892 */
struct hci_wr_auth_en_cmd
{
  uint8_t auth_en;
};

/* 893 */
struct hci_rd_class_of_dev_cmd_cmp_evt
{
  uint8_t status;
  devclass class_of_dev;
};

/* 894 */
struct hci_wr_class_of_dev_cmd
{
  devclass class_of_dev;
};

/* 895 */
struct hci_rd_voice_stg_cmd_cmp_evt
{
  uint8_t status;
  uint16_t voice_stg;
};

/* 896 */
struct hci_wr_voice_stg_cmd
{
  uint16_t voice_stg;
};

/* 897 */
struct hci_rd_nb_bdcst_retx_cmd_cmp_evt
{
  uint8_t status;
  uint8_t num_bcst_ret;
};

/* 898 */
struct hci_wr_nb_bdcst_retx_cmd
{
  uint8_t num_bcst_ret;
};

/* 899 */
struct hci_rd_sync_flow_cntl_en_cmd_cmp_evt
{
  uint8_t status;
  uint8_t sync_flow;
};

/* 900 */
struct hci_wr_sync_flow_cntl_en_cmd
{
  uint8_t cntl_en;
};

/* 901 */
struct hci_set_ctrl_to_host_flow_ctrl_cmd
{
  uint8_t flow_cntl;
};

/* 902 */
struct hci_host_buf_size_cmd
{
  uint16_t acl_pkt_len;
  uint8_t sync_pkt_len;
  uint16_t nb_acl_pkts;
  uint16_t nb_sync_pkts;
};

/* 903 */
struct hci_host_nb_cmp_pkts_cmd
{
  uint8_t nb_of_hdl;
  uint16_t con_hdl[3];
  uint16_t nb_comp_pkt[3];
};

/* 904 */
struct hci_rd_link_supv_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t lsto_val;
};

/* 905 */
struct hci_wr_link_supv_to_cmd
{
  uint16_t conhdl;
  uint16_t lsto_val;
};

/* 906 */
struct hci_rd_nb_supp_iac_cmd_cmp_evt
{
  uint8_t status;
  uint8_t nb_iac;
};

