hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 907 */
struct hci_rd_curr_iac_lap_cmd_cmp_evt
{
  uint8_t status;
  uint8_t nb_curr_iac;
  lap iac_lap;
};

/* 908 */
struct hci_wr_curr_iac_lap_cmd
{
  uint8_t nb_curr_iac;
  lap iac_lap[84];
};

/* 909 */
struct hci_set_afh_host_ch_class_cmd
{
  chnl_map afh_ch;
};

/* 910 */
struct hci_rd_inq_scan_type_cmd_cmp_evt
{
  uint8_t status;
  uint8_t inq_scan_type;
};

/* 911 */
struct hci_wr_inq_scan_type_cmd
{
  uint8_t inq_scan_type;
};

/* 912 */
struct hci_rd_inq_mode_cmd_cmp_evt
{
  uint8_t status;
  uint8_t inq_mode;
};

/* 913 */
struct hci_wr_inq_mode_cmd
{
  uint8_t inq_mode;
};

/* 914 */
struct hci_rd_page_scan_type_cmd_cmp_evt
{
  uint8_t status;
  uint8_t page_scan_type;
};

/* 915 */
struct hci_wr_page_scan_type_cmd
{
  uint8_t page_scan_type;
};

/* 916 */
struct hci_rd_afh_ch_assess_mode_cmd_cmp_evt
{
  uint8_t status;
  uint8_t afh_ch_ass_mode;
};

/* 917 */
struct hci_wr_afh_ch_assess_mode_cmd
{
  uint8_t afh_ch_ass_mode;
};

/* 918 */
struct hci_rd_ext_inq_rsp_cmd_cmp_evt
{
  uint8_t status;
  uint8_t fec_req;
  eir eir;
};

/* 919 */
struct hci_wr_ext_inq_rsp_cmd
{
  uint8_t fec_req;
  eir eir;
};

/* 920 */
struct hci_rd_sp_mode_cmd_cmp_evt
{
  uint8_t status;
  uint8_t sp_mode;
};

/* 921 */
struct hci_wr_sp_mode_cmd
{
  uint8_t sp_mode;
};

/* 922 */
struct hci_rd_loc_oob_data_cmd_cmp_evt
{
  uint8_t status;
  hash oob_c;
  randomizer oob_r;
};

/* 923 */
struct hci_rd_inq_rsp_tx_pwr_lvl_cmd_cmp_evt
{
  uint8_t status;
  uint8_t tx_pwr;
};

/* 924 */
struct hci_wr_inq_tx_pwr_lvl_cmd
{
  int8_t tx_pwr;
};

/* 925 */
struct hci_rd_dft_err_data_rep_cmd_cmp_evt
{
  uint8_t status;
  uint8_t data;
};

/* 926 */
struct hci_wr_dft_err_data_rep_cmd
{
  uint8_t data;
};

/* 927 */
struct hci_rd_le_host_supp_cmd_cmp_evt
{
  uint8_t status;
  uint8_t le_supported_host;
  uint8_t simultaneous_le_host;
};

/* 928 */
struct hci_wr_le_host_supp_cmd
{
  uint8_t le_supported_host;
  uint8_t simultaneous_le_host;
};

/* 929 */
struct hci_rd_auth_payl_to_cmd
{
  uint16_t conhdl;
};

/* 930 */
struct hci_rd_auth_payl_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t auth_payl_to;
};

/* 931 */
struct hci_rd_ext_page_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t ext_page_to;
};

/* 932 */
struct hci_wr_ext_page_to_cmd
{
  uint16_t ext_page_to;
};

/* 933 */
struct hci_rd_ext_inq_len_cmd_cmp_evt
{
  uint8_t status;
  uint16_t ext_inq_len;
};

/* 934 */
struct hci_wr_ext_inq_len_cmd
{
  uint16_t ext_inq_len;
};

/* 935 */
struct hci_rd_local_ver_info_cmd_cmp_evt
{
  uint8_t status;
  uint8_t hci_ver;
  uint16_t hci_rev;
  uint8_t lmp_ver;
  uint16_t manuf_name;
  uint16_t lmp_subver;
};

/* 936 */
struct hci_rd_local_supp_cmds_cmd_cmp_evt
{
  uint8_t status;
  supp_cmds local_cmds;
};

/* 937 */
struct hci_rd_local_supp_feats_cmd_cmp_evt
{
  uint8_t status;
  features feats;
};

/* 938 */
struct hci_rd_local_ext_feats_cmd
{
  uint8_t page_nb;
};

/* 939 */
struct hci_rd_local_ext_feats_cmd_cmp_evt
{
  uint8_t status;
  uint8_t page_nb;
  uint8_t page_nb_max;
  features ext_feats;
};

/* 940 */
struct hci_rd_buff_size_cmd_cmp_evt
{
  uint8_t status;
  uint16_t hc_data_pk_len;
  uint8_t hc_sync_pk_len;
  uint16_t hc_tot_nb_data_pkts;
  uint16_t hc_tot_nb_sync_pkts;
};

/* 941 */
struct hci_rd_bd_addr_cmd_cmp_evt
{
  uint8_t status;
  bd_addr local_addr;
};

/* 942 */
struct hci_rd_local_supp_codecs_cmd_cmp_evt
{
  uint8_t status;
};

/* 943 */
struct __attribute__((aligned(2))) hci_rd_rssi_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t rssi;
};

/* 944 */
struct __attribute__((aligned(2))) hci_rd_clk_cmd
{
  uint16_t conhdl;
  uint8_t clk_type;
};

/* 945 */
struct __attribute__((aligned(4))) hci_rd_clk_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint32_t clk;
  uint16_t clk_acc;
};

/* 946 */
struct hci_rd_loop_back_mode_cmd_cmp_evt
{
  uint8_t status;
  uint8_t lb_mode;
};

/* 947 */
struct hci_wr_loop_back_mode_cmd
{
  uint8_t lb_mode;
};

/* 948 */
struct hci_wr_sp_dbg_mode_cmd
{
  uint8_t sp_mode;
};

/* 949 */
struct hci_le_set_evt_mask_cmd
{
  evt_mask le_mask;
};

/* 950 */
struct hci_le_set_rand_addr_cmd
{
  bd_addr rand_addr;
};

/* 951 */
struct __attribute__((aligned(2))) hci_le_set_adv_param_cmd
{
  uint16_t adv_intv_min;
  uint16_t adv_intv_max;
  uint8_t adv_type;
  uint8_t own_addr_type;
  uint8_t direct_addr_type;
  bd_addr direct_addr;
  uint8_t adv_chnl_map;
  uint8_t adv_filt_policy;
};

/* 952 */
struct hci_le_set_adv_data_cmd
{
  uint8_t adv_data_len;
  adv_data data;
};

/* 953 */
struct hci_le_set_scan_rsp_data_cmd
{
  uint8_t scan_rsp_data_len;
  scan_rsp_data data;
};

/* 954 */
struct hci_le_set_adv_en_cmd
{
  uint8_t adv_en;
};

/* 955 */
struct hci_le_set_scan_param_cmd
{
  uint8_t scan_type;
  uint16_t scan_intv;
  uint16_t scan_window;
  uint8_t own_addr_type;
  uint8_t scan_filt_policy;
};

/* 956 */
struct hci_le_set_scan_en_cmd
{
  uint8_t scan_en;
  uint8_t filter_duplic_en;
};

/* 957 */
struct hci_le_create_con_cmd
{
  uint16_t scan_intv;
  uint16_t scan_window;
  uint8_t init_filt_policy;
  uint8_t peer_addr_type;
  bd_addr peer_addr;
  uint8_t own_addr_type;
  uint16_t con_intv_min;
  uint16_t con_intv_max;
  uint16_t con_latency;
  uint16_t superv_to;
  uint16_t ce_len_min;
  uint16_t ce_len_max;
};

/* 958 */
struct hci_le_add_dev_to_wlst_cmd
{
  uint8_t dev_addr_type;
  bd_addr dev_addr;
};

/* 959 */
struct hci_le_rmv_dev_from_wlst_cmd
{
  uint8_t dev_addr_type;
  bd_addr dev_addr;
};

/* 960 */
struct hci_le_set_host_ch_class_cmd
{
  le_chnl_map chmap;
};

/* 961 */
struct hci_le_rx_test_cmd
{
  uint8_t rx_freq;
};

/* 962 */
struct hci_le_tx_test_cmd
{
  uint8_t tx_freq;
  uint8_t test_data_len;
  uint8_t pk_payload_type;
};

/* 963 */
struct hci_le_enc_cmd
{
  ltk key;
  uint8_t plain_data[16];
};

/* 964 */
struct hci_le_con_update_cmd
{
  uint16_t conhdl;
  uint16_t con_intv_min;
  uint16_t con_intv_max;
  uint16_t con_latency;
  uint16_t superv_to;
  uint16_t ce_len_min;
  uint16_t ce_len_max;
};

/* 965 */
struct hci_le_start_enc_cmd
{
  uint16_t conhdl;
  rand_nb nb;
  uint16_t enc_div;
  ltk ltk;
};

/* 966 */
struct hci_le_ltk_req_reply_cmd
{
  uint16_t conhdl;
  ltk ltk;
};

