hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 967 */
struct hci_le_rem_con_param_req_reply_cmd
{
  uint16_t conhdl;
  uint16_t interval_min;
  uint16_t interval_max;
  uint16_t latency;
  uint16_t timeout;
  uint16_t min_ce_len;
  uint16_t max_ce_len;
};

/* 968 */
struct __attribute__((aligned(2))) hci_le_rem_con_param_req_neg_reply_cmd
{
  uint16_t conhdl;
  uint8_t reason;
};

/* 969 */
struct hci_le_set_data_length_cmd
{
  uint16_t conhdl;
  uint16_t tx_octets;
  uint16_t tx_time;
};

/* 970 */
struct hci_le_write_suggested_default_data_length_cmd
{
  uint16_t suggested_tx_octets;
  uint16_t suggested_tx_time;
};

/* 971 */
struct hci_le_add_dev_to_rslv_list_cmd
{
  uint8_t identity_address_type;
  uint8_t identity_address[6];
  uint8_t peer_irk[16];
  uint8_t local_irk[16];
};

/* 972 */
struct hci_le_dev_from_rslv_list_cmd
{
  uint8_t identity_address_type;
  uint8_t identity_address[6];
};

/* 973 */
struct hci_le_set_addr_resol_en_cmd
{
  uint8_t address_resolution_enable;
};

/* 974 */
struct hci_le_set_rslv_priv_addr_to_cmd
{
  uint16_t rpa_timeout;
};

/* 975 */
struct hci_le_set_privacy_mode_cmd
{
  uint8_t identity_address_type;
  uint8_t identity_address[6];
  uint8_t privacy_mode;
};

/* 976 */
struct hci_inq_cmp_evt
{
  uint8_t status;
};

/* 977 */
struct hci_inq_res_evt
{
  uint8_t nb_rsp;
  bd_addr bd_addr;
  uint8_t page_scan_rep_mode;
  uint8_t reserved1;
  uint8_t reserved2;
  devclass class_of_dev;
  uint16_t clk_off;
};

/* 978 */
struct __attribute__((aligned(2))) hci_inq_res_with_rssi_evt
{
  uint8_t nb_rsp;
  bd_addr bd_addr;
  uint8_t page_scan_rep_mode;
  uint8_t reserved1;
  devclass class_of_dev;
  uint16_t clk_off;
  uint8_t rssi;
};

/* 979 */
struct __attribute__((aligned(2))) hci_ext_inq_res_evt
{
  uint8_t nb_rsp;
  bd_addr bd_addr;
  uint8_t page_scan_rep_mode;
  uint8_t reserved1;
  devclass class_of_dev;
  uint16_t clk_off;
  uint8_t rssi;
  eir eir;
};

/* 980 */
struct __attribute__((aligned(2))) hci_disc_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t reason;
};

/* 981 */
struct hci_basic_cmd_cmp_evt
{
  uint8_t status;
};

/* 982 */
struct hci_basic_conhdl_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 983 */
struct hci_basic_bd_addr_cmd_cmp_evt
{
  uint8_t status;
  bd_addr bd_addr;
};

/* 984 */
struct hci_basic_conhdl_evt
{
  uint16_t conhdl;
};

/* 985 */
struct hci_cmd_stat_event
{
  uint8_t status;
};

/* 986 */
struct hci_nb_cmp_pkts_evt
{
  uint8_t nb_of_hdl;
  uint16_t conhdl[1];
  uint16_t nb_comp_pkt[1];
};

/* 987 */
struct hci_data_buf_ovflw_evt
{
  uint8_t link_type;
};

/* 988 */
struct hci_hw_err_evt
{
  uint8_t hw_code;
};

/* 989 */
struct __attribute__((aligned(2))) hci_enc_change_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t enc_stat;
};

/* 990 */
struct hci_enc_key_ref_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 991 */
struct hci_auth_payl_to_exp_evt
{
  uint16_t conhdl;
};

/* 992 */
struct hci_con_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  bd_addr bd_addr;
  uint8_t link_type;
  uint8_t enc_en;
};

/* 993 */
struct hci_qos_setup_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t flags;
  uint8_t serv_type;
  uint32_t tok_rate;
  uint32_t pk_bw;
  uint32_t lat;
  uint32_t del_var;
};

/* 994 */
struct hci_flow_spec_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t flags;
  uint8_t flow_dir;
  uint8_t serv_type;
  uint32_t tk_rate;
  uint32_t tk_buf_sz;
  uint32_t pk_bw;
  uint32_t acc_lat;
};

/* 995 */
struct hci_role_chg_evt
{
  uint8_t status;
  bd_addr bd_addr;
  uint8_t new_role;
};

/* 996 */
struct hci_rd_clk_off_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t clk_off_val;
};

/* 997 */
struct hci_flush_occurred_evt
{
  uint16_t conhdl;
};

/* 998 */
struct __attribute__((aligned(2))) hci_max_slot_chg_evt
{
  uint16_t conhdl;
  uint8_t max_slot;
};

/* 999 */
struct hci_sniff_sub_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint16_t max_lat_tx;
  uint16_t max_lat_rx;
  uint16_t min_rem_to;
  uint16_t min_loc_to;
};

/* 1000 */
struct hci_rd_rem_ext_feats_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t pg_nb;
  uint8_t pg_nb_max;
  features ext_feats;
};

/* 1001 */
struct hci_rem_host_supp_feats_notif_evt
{
  bd_addr bd_addr;
  features ext_feats;
};

/* 1002 */
struct hci_rd_rem_supp_feats_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  features rem_feats;
};

/* 1003 */
struct hci_rd_rem_ver_info_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t vers;
  uint16_t compid;
  uint16_t subvers;
};

/* 1004 */
struct __attribute__((aligned(2))) hci_enc_chg_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t enc_stat;
};

/* 1005 */
struct hci_mode_chg_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t cur_mode;
  uint16_t interv;
};

/* 1006 */
struct hci_sp_cmp_evt
{
  uint8_t status;
  bd_addr bd_addr;
};

/* 1007 */
struct hci_auth_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1008 */
struct hci_chg_con_lk_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1009 */
struct hci_enc_key_refresh_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1010 */
struct __attribute__((aligned(2))) hci_master_lk_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t key_flag;
};

/* 1011 */
struct __attribute__((aligned(2))) hci_sync_con_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  bd_addr bd_addr;
  uint8_t lk_type;
  uint8_t tx_int;
  uint8_t ret_win;
  uint16_t rx_pkt_len;
  uint16_t tx_pkt_len;
  uint8_t air_mode;
};

/* 1012 */
struct hci_sync_con_chg_evt
{
  uint8_t status;
  uint16_t sync_conhdl;
  uint8_t tx_int;
  uint8_t ret_win;
  uint16_t rx_pkt_len;
  uint16_t tx_pkt_len;
};

/* 1013 */
struct hci_con_pkt_type_chg_evt
{
  uint8_t status;
  uint16_t sync_conhdl;
  uint16_t pkt_type;
};

/* 1014 */
struct hci_link_supv_to_chg_evt
{
  uint16_t conhdl;
  uint16_t lsto_val;
};

/* 1015 */
struct hci_lk_req_evt
{
  bd_addr bd_addr;
};

/* 1016 */
struct hci_enc_key_refresh_evt
{
  uint8_t status;
  uint16_t conhdl;
};

