hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1017 */
struct hci_con_req_evt
{
  bd_addr bd_addr;
  devclass classofdev;
  uint8_t lk_type;
};

/* 1018 */
struct hci_qos_viol_evt
{
  uint16_t conhdl;
};

/* 1019 */
struct hci_io_cap_rsp_evt
{
  bd_addr bd_addr;
  uint8_t io_capa;
  uint8_t oob_data_pres;
  uint8_t auth_req;
};

/* 1020 */
struct hci_io_cap_req_evt
{
  bd_addr bd_addr;
};

/* 1021 */
struct hci_return_link_keys_evt
{
  uint8_t num_keys;
  bd_addr bd_addr;
  ltk key;
};

/* 1022 */
struct hci_pin_code_req_evt
{
  bd_addr bd_addr;
};

/* 1023 */
struct hci_user_passkey_req_evt
{
  bd_addr bd_addr;
};

/* 1024 */
struct hci_user_passkey_notif_evt
{
  bd_addr bd_addr;
  uint32_t passkey;
};

/* 1025 */
struct hci_rem_oob_data_req_evt
{
  bd_addr bd_addr;
};

/* 1026 */
struct hci_user_cfm_req_evt
{
  bd_addr bd_addr;
  uint32_t passkey;
};

/* 1027 */
struct hci_keypress_notif_evt
{
  bd_addr bd_addr;
  uint8_t type;
};

/* 1028 */
struct hci_lk_notif_evt
{
  bd_addr bd_addr;
  ltk key;
  uint8_t key_type;
};

/* 1029 */
struct hci_le_rd_local_supp_feats_cmd_cmp_evt
{
  uint8_t status;
  le_features feats;
};

/* 1030 */
struct hci_rd_adv_chnl_tx_pw_cmd_cmp_evt
{
  uint8_t status;
  int8_t adv_tx_pw_lvl;
};

/* 1031 */
struct hci_rd_wlst_size_cmd_cmp_evt
{
  uint8_t status;
  uint8_t wlst_size;
};

/* 1032 */
struct __attribute__((aligned(2))) hci_le_rd_buff_size_cmd_cmp_evt
{
  uint8_t status;
  uint16_t hc_data_pk_len;
  uint8_t hc_tot_nb_data_pkts;
};

/* 1033 */
struct hci_le_rand_cmd_cmp_evt
{
  uint8_t status;
  rand_nb nb;
};

/* 1034 */
struct hci_rd_supp_states_cmd_cmp_evt
{
  uint8_t status;
  le_states states;
};

/* 1035 */
struct hci_test_end_cmd_cmp_evt
{
  uint8_t status;
  uint16_t nb_packet_received;
};

/* 1036 */
struct hci_le_enc_cmd_cmp_evt
{
  uint8_t status;
  uint8_t encrypted_data[16];
};

/* 1037 */
struct hci_le_adv_report_evt
{
  uint8_t subcode;
  uint8_t nb_reports;
  adv_report adv_rep[1];
};

/* 1038 */
struct hci_le_direct_adv_report_evt
{
  uint8_t subcode;
  uint8_t nb_reports;
  direct_adv_report adv_rep[1];
};

/* 1039 */
struct __attribute__((aligned(2))) hci_le_rd_chnl_map_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  le_chnl_map ch_map;
};

/* 1040 */
struct hci_le_ltk_req_reply_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1041 */
struct hci_le_ltk_req_neg_reply_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1042 */
struct hci_wr_auth_payl_to_cmd
{
  uint16_t conhdl;
  uint16_t auth_payl_to;
};

/* 1043 */
struct hci_wr_auth_payl_to_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
};

/* 1044 */
struct hci_le_con_update_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint16_t conhdl;
  uint16_t con_interval;
  uint16_t con_latency;
  uint16_t sup_to;
};

/* 1045 */
struct __attribute__((aligned(2))) hci_le_con_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint16_t conhdl;
  uint8_t role;
  uint8_t peer_addr_type;
  bd_addr peer_addr;
  uint16_t con_interval;
  uint16_t con_latency;
  uint16_t sup_to;
  uint8_t clk_accuracy;
};

/* 1046 */
struct hci_le_rd_rem_used_feats_cmd
{
  uint16_t conhdl;
};

/* 1047 */
struct hci_le_rd_rem_used_feats_cmd_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint16_t conhdl;
  le_features feats_used;
};

/* 1048 */
struct __attribute__((aligned(2))) hci_rd_tx_pwr_lvl_cmd
{
  uint16_t conhdl;
  uint8_t type;
};

/* 1049 */
struct __attribute__((aligned(2))) hci_rd_tx_pwr_lvl_cmd_cmp_evt
{
  uint8_t status;
  uint16_t conhdl;
  uint8_t tx_pow_lvl;
};

/* 1050 */
struct hci_rd_rem_ver_info_cmd
{
  uint16_t conhdl;
};

/* 1051 */
struct hci_le_rem_con_param_req_evt
{
  uint8_t subcode;
  uint16_t conhdl;
  uint16_t interval_min;
  uint16_t interval_max;
  uint16_t latency;
  uint16_t timeout;
};

/* 1052 */
struct hci_le_ltk_request_evt
{
  uint8_t subcode;
  uint16_t conhdl;
  rand_nb rand;
  uint16_t ediv;
};

/* 1053 */
struct hci_le_data_length_change_evt
{
  uint8_t subcode;
  uint16_t conhdl;
  uint16_t max_txoctets;
  uint16_t max_txtime;
  uint16_t max_rxoctets;
  uint16_t max_rxtime;
};

/* 1054 */
struct __attribute__((aligned(2))) hci_le_enh_con_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint16_t conhdl;
  uint8_t role;
  uint8_t peer_addr_type;
  bd_addr peer_addr;
  bd_addr local_rpa_addr;
  bd_addr peer_rpa_addr;
  uint16_t con_interval;
  uint16_t con_latency;
  uint16_t sup_to;
  uint8_t clk_accuracy;
};

/* 1055 */
struct hci_le_read_suggested_default_data_length_cmd_cmp_evt
{
  uint8_t status;
  uint16_t suggested_tx_octets;
  uint16_t suggested_tx_time;
};

/* 1056 */
struct hci_le_read_max_data_length_cmd_cmp_evt
{
  uint8_t status;
  uint16_t max_tx_octets;
  uint16_t max_tx_time;
  uint16_t max_rx_octets;
  uint16_t max_rx_time;
};

/* 1057 */
struct hci_le_dev_from_rslv_list_cmd_cmp_evt
{
  uint8_t status;
  uint8_t address[6];
};

/* 1058 */
struct hci_le_rd_rslv_list_size_cmd_cmp_evt
{
  uint8_t status;
  uint8_t resolving_list_size;
};

/* 1059 */
struct buffer_tag
{
  uint8_t length;
  uint8_t data[128];
};

/* 1060 */
struct hci_dbg_basic_rd_data_cmd_cmp_evt
{
  uint8_t status;
  buffer_tag buf;
};

/* 1061 */
struct __attribute__((aligned(4))) hci_dbg_rd_mem_cmd
{
  uint32_t start_addr;
  uint8_t type;
  uint8_t length;
};

/* 1062 */
struct __attribute__((aligned(4))) hci_dbg_wr_mem_cmd
{
  uint32_t start_addr;
  uint8_t type;
  buffer_tag buf;
};

/* 1063 */
struct hci_dbg_del_param_cmd
{
  uint16_t param_tag;
};

/* 1064 */
struct hci_dbg_er_flash_cmd
{
  uint8_t flashtype;
  uint32_t startoffset;
  uint32_t size;
};

/* 1065 */
struct __attribute__((aligned(4))) hci_dbg_wr_flash_cmd
{
  uint8_t flashtype;
  uint32_t startoffset;
  buffer_tag buf;
};

/* 1066 */
struct __attribute__((aligned(4))) hci_dbg_rd_flash_cmd
{
  uint8_t flashtype;
  uint32_t startoffset;
  uint8_t size;
};

