hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1067 */
struct hci_dbg_rd_par_cmd
{
  uint16_t param_tag;
};

/* 1068 */
struct __attribute__((aligned(2))) hci_dbg_wr_par_cmd
{
  uint16_t param_tag;
  buffer_tag buf;
};

/* 1069 */
struct hci_dbg_rd_ke_stats_cmd_cmp_evt
{
  uint8_t status;
  uint8_t max_msg_sent;
  uint8_t max_msg_saved;
  uint8_t max_timer_used;
  uint16_t max_heap_used;
  uint16_t max_stack_used;
};

/* 1070 */
struct hci_dbg_rd_mem_info_cmd_cmp_evt
{
  uint8_t status;
  uint16_t mem_used[4];
  uint32_t max_mem_used;
};

/* 1071 */
struct hci_dbg_id_flash_cmd_cmp_evt
{
  uint8_t status;
  uint8_t flash_id;
};

/* 1072 */
struct hci_dbg_rf_reg_rd_cmd
{
  uint16_t addr;
};

/* 1073 */
struct hci_dbg_rf_reg_rd_cmd_cmp_evt
{
  uint8_t status;
  uint16_t addr;
  uint32_t value;
};

/* 1074 */
struct hci_dbg_rf_reg_wr_cmd
{
  uint16_t addr;
  uint32_t value;
};

/* 1075 */
struct hci_dbg_rf_reg_wr_cmd_cmp_evt
{
  uint8_t status;
  uint16_t addr;
};

/* 1076 */
struct hci_dbg_plf_reset_cmd
{
  uint8_t reason;
};

/* 1077 */
struct hci_dbg_hw_reg_rd_cmd
{
  uint16_t reg_addr;
};

/* 1078 */
struct hci_dbg_hw_reg_wr_cmd
{
  uint16_t reg_addr;
  uint16_t reserved;
  uint32_t reg_value;
};

/* 1079 */
struct hci_dbg_hw_reg_rd_cmd_cmp_evt
{
  uint8_t status;
  uint16_t reg_addr;
  uint32_t reg_value;
};

/* 1080 */
struct hci_dbg_hw_reg_wr_cmd_cmp_evt
{
  uint8_t status;
  uint16_t reg_addr;
};

/* 1081 */
struct hci_dbg_set_bd_addr_cmd
{
  bd_addr addr;
};

/* 1082 */
struct __attribute__((aligned(2))) hci_dbg_set_crc_cmd
{
  uint16_t conhdl;
  crc_init crc;
};

/* 1083 */
struct __attribute__((aligned(2))) hci_dbg_llcp_discard_cmd
{
  uint16_t conhdl;
  uint8_t enable;
};

/* 1084 */
struct hci_dbg_reset_rx_cnt_cmd
{
  uint16_t conhdl;
};

/* 1085 */
struct hci_dbg_reset_tx_cnt_cmd
{
  uint16_t conhdl;
};

/* 1086 */
struct __attribute__((aligned(2))) hci_dbg_set_tx_pw_cmd
{
  uint16_t conhdl;
  uint8_t pw_lvl;
};

/* 1087 */
struct hci_dbg_wr_dle_dft_value_cmd
{
  uint16_t supported_tx_octets;
  uint16_t supported_tx_time;
  uint16_t supported_rx_octets;
  uint16_t supported_rx_time;
};

/* 1088 */
struct hci_dbg_wr_dle_dft_value_cmd_cmp_evt
{
  uint8_t status;
};

/* 1089 */
struct hci_dbg_wr_rl_size_cmd
{
  uint8_t rl_size;
};

/* 1090 */
struct hci_dbg_wr_rl_size_cmd_cmp_evt
{
  uint8_t status;
};

/* 1091 */
struct hci_dbg_wr_filt_dup_size_cmd
{
  uint8_t filt_dup_size;
};

/* 1092 */
struct hci_dbg_wr_filt_dup_size_cmd_cmp_evt
{
  uint8_t status;
};

/* 1093 */
struct hci_le_generate_dhkey_cmd
{
  uint8_t public_key[64];
};

/* 1094 */
struct hci_le_generate_dhkey_v2_cmd
{
  uint8_t public_key[64];
  uint8_t key_type;
};

/* 1095 */
struct hci_rd_p256_public_key_cmd_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint8_t public_key[64];
};

/* 1096 */
struct hci_generate_dhkey_cmd_cmp_evt
{
  uint8_t subcode;
  uint8_t status;
  uint8_t dhkey[32];
};

/* 1098 */
typedef prf_env prf_env_t;

/* 1097 */
struct prf_task_env
{
  ke_task_desc desc;
  prf_env_t *env;
  ke_task_id_t task;
  ke_task_id_t id;
};

/* 1099 */
struct prf_env
{
  ke_task_id_t app_task;
  ke_task_id_t prf_task;
};

/* 1100 */
typedef uint8_t (*prf_init_fnct)(prf_task_env *, uint16_t *, uint16_t, uint8_t, void *);

/* 1101 */
typedef void (*prf_destroy_fnct)(prf_task_env *);

/* 1102 */
typedef void (*prf_create_fnct)(prf_task_env *, uint8_t);

/* 1103 */
typedef void (*prf_cleanup_fnct)(prf_task_env *, uint8_t, uint8_t);

/* 1104 */
struct prf_task_cbs
{
  prf_init_fnct init;
  prf_destroy_fnct destroy;
  prf_create_fnct create;
  prf_cleanup_fnct cleanup;
};

/* 1105 */
typedef const prf_task_cbs *(*prfif_func_t)(void);

/* 1106 */
struct profile_interface
{
  uint8_t id;
  prfif_func_t func;
};

/* 1107 */
struct prf_env_tag;

/* 1108 */
struct __attribute__((aligned(4))) rom_prf_cfg_t
{
  const profile_interface *profile_if;
  prf_env_tag *prf_env;
  uint8_t num_of_profiles;
};

/* 1109 */
enum prf_perm_mask : __int16
{
  PERM_MASK_PRF_TASK = 0x7FFF,
  PERM_POS_PRF_TASK = 0x0,
  PERM_MASK_PRF_MI = 0x8000,
  PERM_POS_PRF_MI = 0xF,
};

/* 1110 */
enum sleep_state_t : __int8
{
  ARCH_SLEEP_OFF = 0x0,
  ARCH_EXT_SLEEP_ON = 0x1,
  ARCH_EXT_SLEEP_OTP_COPY_ON = 0x2,
};

/* 1111 */
struct arch_sleep_env_tag
{
  sleep_state_t slp_state;
};

/* 1112 */
enum pd_sys_down_ram_t : __int8
{
  PD_SYS_DOWN_RAM_ON = 0x0,
  PD_SYS_DOWN_RAM_OFF = 0x1,
};

/* 1113 */
enum remap_addr0_t : __int8
{
  REMAP_ADDR0_TO_ROM = 0x0,
  REMAP_ADDR0_TO_OTP = 0x1,
  REMAP_ADDR0_TO_RAM1 = 0x2,
  REMAP_ADDR0_TO_RAM3 = 0x3,
};

/* 1114 */
enum stateful_hibern_remap_addr0_t : __int8
{
  STATEFUL_HIBERN_REMAP_ADDR0_TO_RAM1 = 0x2,
  STATEFUL_HIBERN_REMAP_ADDR0_TO_RAM3 = 0x3,
};

/* 1115 */
enum last_ble_evt : __int8
{
  BLE_EVT_SLP = 0x0,
  BLE_EVT_CSCNT = 0x1,
  BLE_EVT_RX = 0x2,
  BLE_EVT_TX = 0x3,
  BLE_EVT_END = 0x4,
};

/* 1116 */
enum arch_main_loop_callback_ret_t : __int8
{
  GOTO_SLEEP = 0x0,
  KEEP_POWERED = 0x1,
};

/* 1117 */
struct arch_main_loop_callbacks
{
  void (*app_on_init)(void);
  arch_main_loop_callback_ret_t (*app_on_ble_powered)(void);
  arch_main_loop_callback_ret_t (*app_on_system_powered)(void);
  void (*app_before_sleep)(void);
  sleep_mode_t (*app_validate_sleep)(sleep_mode_t);
  void (*app_going_to_sleep)(sleep_mode_t);
  void (*app_resume_from_sleep)(void);
};

/* 1118 */
struct __attribute__((aligned(4))) arch_ble_metrics_t
{
  uint32_t rx_pkt;
  uint32_t rx_err;
  uint32_t rx_err_crc;
  uint32_t rx_err_sync;
  uint16_t rx_rssi;
};

/* 1119 */
enum lld_evt_mode : __int8
{
  LLD_EVT_ADV_MODE = 0x0,
  LLD_EVT_SCAN_MODE = 0x1,
  LLD_EVT_TEST_MODE = 0x2,
  LLD_EVT_MST_MODE = 0x3,
  LLD_EVT_SLV_MODE = 0x4,
  LLD_EVT_MODE_MAX = 0x5,
};

