hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1120 */
enum lld_evt_instant_action : __int8
{
  LLD_EVT_NO_ACTION = 0x0,
  LLD_EVT_PARAM_UPDATE = 0x1,
  LLD_EVT_CHMAP_UPDATE = 0x2,
};

/* 1121 */
enum lld_evt_cs_format : __int8
{
  LLD_MASTER_CONNECTED = 0x2,
  LLD_SLAVE_CONNECTED = 0x3,
  LLD_LD_ADVERTISER = 0x4,
  LLD_HD_ADVERTISER = 0x5,
  LLD_PASSIVE_SCANNING = 0x8,
  LLD_ACTIVE_SCANNING = 0x9,
  LLD_INITIATING = 0xF,
  LLD_TXTEST_MODE = 0x1C,
  LLD_RXTEST_MODE = 0x1D,
  LLD_TXRXTEST_MODE = 0x1E,
};

/* 1122 */
struct lld_evt_anchor
{
  uint32_t basetime_cnt;
  uint16_t finetime_cnt;
  uint16_t evt_cnt;
};

/* 1123 */
struct lld_evt_tag
{
  co_list_hdr hdr;
  lld_evt_anchor anchor_point;
  co_list tx_prog;
  co_list tx_rdy;
  ea_interval_tag *interval_elt;
  uint32_t sync_win_size;
  uint32_t sca_drift;
  uint32_t evt_end_ts;
  uint16_t conhdl;
  uint16_t cs_ptr;
  uint16_t interval;
  uint16_t instant;
  uint16_t new_instant;
  uint16_t latency;
  uint16_t counter;
  uint16_t missed_cnt;
  uint16_t duration_dft;
  uint16_t update_offset;
  uint16_t slot;
  uint8_t update_size;
  uint8_t rx_cnt;
  uint8_t mode;
  uint8_t instant_action;
  uint8_t new_instant_action;
  uint8_t tx_pwr;
  uint8_t tx_cnt;
  uint8_t mst_sca;
  uint8_t evt_flag;
  uint8_t last_md_rx;
};

/* 1124 */
struct __attribute__((aligned(2))) lld_evt_update_tag
{
  uint16_t win_offset;
  uint16_t instant;
  uint8_t win_size;
};

/* 1125 */
struct __attribute__((aligned(4))) lld_evt_int_tag
{
  co_list_hdr hdr;
  lld_evt_tag *evt;
  uint32_t freeslot;
  uint16_t int_base;
};

/* 1126 */
struct __attribute__((aligned(4))) lld_evt_env_tag
{
  co_list elt_prog;
  co_list elt_deferred;
  uint8_t sca;
};

/* 1127 */
struct __attribute__((aligned(4))) lld_evt_deferred_tag
{
  co_list_hdr hdr;
  ea_elt_tag *elt_ptr;
  uint8_t type;
  uint8_t rx_desc_cnt;
};

/* 1128 */
enum prevent_sleep : __int8
{
  RW_WAKE_UP_ONGOING = 0x1,
  RW_TL_TX_ONGOING = 0x2,
  RW_TL_RX_ONGOING = 0x4,
  RW_GTL_TIMEOUT = 0x8,
  RW_CRYPT_ONGOING = 0x10,
  RW_DELETE_ELT_ONGOING = 0x20,
  RW_P256_ONGOING = 0x40,
};

/* 1129 */
enum rwip_eif_types : __int8
{
  RWIP_EIF_HCIC = 0x0,
  RWIP_EIF_HCIH = 0x1,
  RWIP_EIF_AHI = 0x2,
};

/* 1130 */
enum rwip_eif_status : __int8
{
  RWIP_EIF_STATUS_OK = 0x0,
  RWIP_EIF_STATUS_ERROR = 0x1,
};

/* 1131 */
enum rwip_rf_mod : __int8
{
  MOD_GFSK = 0x1,
  MOD_DQPSK = 0x2,
  MOD_8DPSK = 0x3,
};

/* 1132 */
struct __attribute__((aligned(4))) rwip_rf_api
{
  void (*reset)(void);
  void (*force_agc_enable)(bool);
  bool (*txpwr_inc)(uint8_t);
  bool (*txpwr_dec)(uint8_t);
  uint8_t (*txpwr_epc_req)(uint8_t, uint8_t);
  uint8_t (*txpwr_dbm_get)(uint8_t, uint8_t);
  uint8_t (*txpwr_cs_get)(int8_t);
  uint8_t (*rssi_convert)(uint8_t);
  void (*isr)(void);
  uint32_t (*reg_rd)(uint16_t);
  void (*reg_wr)(uint16_t, uint32_t);
  void (*sleep)(void);
  uint8_t txpwr_max;
  uint8_t rssi_high_thr;
  uint8_t rssi_low_thr;
  uint8_t rssi_interf_thr;
  uint8_t wakeup_delay;
};

/* 1133 */
typedef void (*rwip_eif_callback)(uint8_t);

/* 1134 */
struct rwip_eif_api
{
  void (*read)(uint8_t *, uint32_t, rwip_eif_callback);
  void (*write)(uint8_t *, uint32_t, rwip_eif_callback);
  void (*flow_on)(void);
  bool (*flow_off)(void);
};

/* 1135 */
struct __attribute__((aligned(2))) rwip_env_tag
{
  uint16_t prevent_sleep;
  uint8_t wakeup_delay;
  bool sleep_enable;
  uint8_t ext_wakeup_enable;
};

/* 1136 */
enum rf_tx_pwr_lvl_t : __int8
{
  RF_TX_PWR_LVL_MINUS_19d5 = 0x1,
  RF_TX_PWR_LVL_MINUS_13d5 = 0x2,
  RF_TX_PWR_LVL_MINUS_10d0 = 0x3,
  RF_TX_PWR_LVL_MINUS_7d0 = 0x4,
  RF_TX_PWR_LVL_MINUS_5d0 = 0x5,
  RF_TX_PWR_LVL_MINUS_3d5 = 0x6,
  RF_TX_PWR_LVL_MINUS_2d0 = 0x7,
  RF_TX_PWR_LVL_MINUS_1d0 = 0x8,
  RF_TX_PWR_LVL_0d0 = 0x9,
  RF_TX_PWR_LVL_PLUS_1d0 = 0xA,
  RF_TX_PWR_LVL_PLUS_1d5 = 0xB,
  RF_TX_PWR_LVL_PLUS_2d5 = 0xC,
  RF_TX_PWR_LVL_TOTAL_VALUES = 0xC,
};

/* 1137 */
struct rf_calibration_result
{
  uint8_t dcoff_result;
  uint8_t kdco_result[8];
  uint16_t kdtc_result[8];
  uint8_t tx_div2_result[8];
  uint8_t iq_div2_result[8];
};

/* 1138 */
enum tim2_clk_src_t : __int8
{
  TIM2_CLK_LP = 0x0,
  TIM2_CLK_SYS = 0x1,
};

/* 1139 */
enum tim2_hw_pause_t : __int8
{
  TIM2_HW_PAUSE_OFF = 0x0,
  TIM2_HW_PAUSE_ON = 0x1,
};

/* 1140 */
enum tim2_sw_pause_t : __int8
{
  TIM2_SW_PAUSE_OFF = 0x0,
  TIM2_SW_PAUSE_ON = 0x1,
};

/* 1141 */
enum tim2_t : __int8
{
  TIM2_OFF = 0x0,
  TIM2_ON = 0x1,
};

/* 1142 */
enum tim2_pwm_t : __int8
{
  TIM2_PWM_2 = 0x1,
  TIM2_PWM_3 = 0x2,
  TIM2_PWM_4 = 0x3,
  TIM2_PWM_5 = 0x4,
  TIM2_PWM_6 = 0x5,
  TIM2_PWM_7 = 0x6,
};

/* 1143 */
struct tim2_config_t
{
  tim2_clk_src_t clk_source;
  tim2_hw_pause_t hw_pause;
};

/* 1144 */
struct tim2_pwm_config_t
{
  tim2_pwm_t pwm_signal;
  uint8_t pwm_dc;
  uint8_t pwm_offset;
};

/* 1145 */
enum adc_input_mode_t : __int8
{
  ADC_INPUT_MODE_DIFFERENTIAL = 0x0,
  ADC_INPUT_MODE_SINGLE_ENDED = 0x1,
};

/* 1146 */
enum adc_input_se_t : __int8
{
  ADC_INPUT_SE_P0_1 = 0x0,
  ADC_INPUT_SE_P0_2 = 0x1,
  ADC_INPUT_SE_P0_6 = 0x2,
  ADC_INPUT_SE_P0_7 = 0x3,
  ADC_INPUT_SE_TEMP_SENS = 0x4,
  ADC_INPUT_SE_VBAT_HIGH = 0x5,
  ADC_INPUT_SE_VBAT_LOW = 0x6,
  ADC_INPUT_SE_VDD = 0x7,
};

/* 1147 */
enum adc_input_diff_t : __int8
{
  ADC_INPUT_DIFF_P0_1 = 0x0,
  ADC_INPUT_DIFF_P0_2 = 0x1,
  ADC_INPUT_DIFF_P0_6 = 0x2,
  ADC_INPUT_DIFF_P0_7 = 0x3,
};

/* 1148 */
enum adc_input_attn_t : __int8
{
  ADC_INPUT_ATTN_NO = 0x0,
  ADC_INPUT_ATTN_2X = 0x1,
  ADC_INPUT_ATTN_3X = 0x2,
  ADC_INPUT_ATTN_4X = 0x3,
};

/* 1149 */
enum adc_input_sh_gain_t : __int8
{
  ADC_INPUT_SH_GAIN_2X = 0x0,
  ADC_INPUT_SH_GAIN_2X25 = 0x1,
};

/* 1150 */
enum adc_input_sh_cm_t : __int8
{
  ADC_INPUT_SH_CM_1V25 = 0x0,
  ADC_INPUT_SH_CM_1V30 = 0x1,
  ADC_INPUT_SH_CM_1V35 = 0x2,
  ADC_INPUT_SH_CM_1V40 = 0x3,
};

/* 1151 */
typedef void (*adc_interrupt_cb_t)(void);

/* 1152 */
struct adc_config_t
{
  adc_input_mode_t input_mode;
  uint8_t input;
  uint8_t smpl_time_mult;
  bool continuous;
  uint8_t interval_mult;
  adc_input_attn_t input_attenuator;
  bool chopping;
  uint8_t oversampling;
};

/* 1153 */
struct spi_t
{
  volatile uint16_t SPI_CTRL_REGF;
  uint16_t RESERVED;
  volatile uint16_t SPI_CONFIG_REGF;
  uint16_t RESERVED1;
  volatile uint16_t SPI_CLOCK_REGF;
  uint16_t RESERVED2;
  volatile uint16_t SPI_FIFO_CONFIG_REGF;
  uint16_t RESERVED3;
  volatile uint16_t SPI_IRQ_MASK_REGF;
  uint16_t RESERVED4;
  volatile uint16_t SPI_STATUS_REGF;
  uint16_t RESERVED5;
  volatile uint16_t SPI_FIFO_STATUS_REGF;
  uint16_t RESERVED6;
  volatile uint16_t SPI_FIFO_READ_REGF;
  uint16_t RESERVED7;
  volatile uint16_t SPI_FIFO_WRITE_REGF;
  uint16_t RESERVED8;
  volatile uint16_t SPI_CS_CONFIG_REGF;
  uint16_t RESERVED9;
  volatile uint16_t SPI_FIFO_HIGH_REGF;
  uint16_t RESERVED10;
  volatile uint16_t SPI_TXBUFFER_FORCE_L_REGF;
  uint16_t RESERVED11;
  volatile uint16_t SPI_TXBUFFER_FORCE_H_REGF;
};

/* 1154 */
enum SPI_BIT_CFG : __int8
{
  SPI_BIT_DIS = 0x0,
  SPI_BIT_EN = 0x1,
};

/* 1155 */
enum SPI_MS_MODE_CFG : __int8
{
  SPI_MS_MODE_MASTER = 0x0,
};

