hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1156 */
enum SPI_CP_MODE_CFG : __int8
{
  SPI_CP_MODE_0 = 0x0,
  SPI_CP_MODE_1 = 0x1,
  SPI_CP_MODE_2 = 0x2,
  SPI_CP_MODE_3 = 0x3,
};

/* 1157 */
enum SPI_SPEED_MODE_CFG : __int16
{
  SPI_SPEED_MODE_2MHz = 0x7D0,
  SPI_SPEED_MODE_4MHz = 0xFA0,
  SPI_SPEED_MODE_8MHz = 0x1F40,
  SPI_SPEED_MODE_16MHz = 0x3E80,
  SPI_SPEED_MODE_32MHz = 0x7D00,
};

/* 1158 */
enum SPI_WSZ_MODE_CFG : __int8
{
  SPI_MODE_8BIT = 0x0,
  SPI_MODE_16BIT = 0x1,
  SPI_MODE_32BIT = 0x2,
};

/* 1159 */
enum SPI_CS_MODE_CFG : __int8
{
  SPI_CS_NONE = 0x0,
  SPI_CS_0 = 0x1,
  SPI_CS_1 = 0x2,
  SPI_CS_GPIO = 0x4,
};

/* 1160 */
enum SPI_IRQ_CFG : __int8
{
  SPI_IRQ_DISABLED = 0x0,
  SPI_IRQ_ENABLED = 0x1,
};

/* 1161 */
enum SPI_OP_CFG : __int8
{
  SPI_OP_BLOCKING = 0x0,
};

/* 1162 */
enum SPI_MASTER_EDGE_CAPTURE_CFG : __int8
{
  SPI_MASTER_EDGE_CAPTURE = 0x0,
  SPI_MASTER_EDGE_CAPTURE_NEXT = 0x1,
};

/* 1163 */
enum SPI_RX_FIFO_EMPTY_STATUS : __int8
{
  SPI_RX_FIFO_IS_NOT_EMPTY = 0x0,
  SPI_RX_FIFO_IS_EMPTY = 0x1,
};

/* 1164 */
enum SPI_RX_FIFO_FULL_STATUS : __int8
{
  SPI_RX_FIFO_IS_NOT_FULL = 0x0,
  SPI_RX_FIFO_IS_FULL = 0x1,
};

/* 1165 */
enum SPI_TX_FIFO_EMPTY_STATUS : __int8
{
  SPI_TX_FIFO_IS_NOT_EMPTY = 0x0,
  SPI_TX_FIFO_IS_EMPTY = 0x1,
};

/* 1166 */
enum SPI_TX_FIFO_FULL_STATUS : __int8
{
  SPI_TX_FIFO_IS_NOT_FULL = 0x0,
  SPI_TX_FIFO_IS_FULL = 0x1,
};

/* 1167 */
enum SPI_TRANSACTION_STATUS : __int8
{
  SPI_TRANSACTION_IS_INACTIVE = 0x0,
  SPI_TRANSACTION_IS_ACTIVE = 0x1,
};

/* 1168 */
struct SPI_Pad_t
{
  GPIO_PORT port;
  GPIO_PIN pin;
};

/* 1169 */
typedef void (*spi_cb_t)(uint16_t);

/* 1170 */
struct spi_cfg_t
{
  __int8 spi_ms : 1;
  __int8 spi_cp : 3;
  SPI_SPEED_MODE_CFG spi_speed;
  __int8 spi_wsz : 3;
  __int8 spi_cs : 3;
  __int8 spi_irq : 1;
  SPI_Pad_t cs_pad;
  __int8 spi_capture : 1;
};

/* 1171 */
struct i2c_t
{
  volatile uint16_t I2C_CON_REGF;
  uint16_t RESERVED;
  volatile uint16_t I2C_TAR_REGF;
  uint16_t RESERVED1;
  volatile uint16_t I2C_SAR_REGF;
  uint16_t RESERVED2[3];
  volatile uint16_t I2C_DATA_CMD_REGF;
  uint16_t RESERVED3;
  volatile uint16_t I2C_SS_SCL_HCNT_REGF;
  uint16_t RESERVED4;
  volatile uint16_t I2C_SS_SCL_LCNT_REGF;
  uint16_t RESERVED5;
  volatile uint16_t I2C_FS_SCL_HCNT_REGF;
  uint16_t RESERVED6;
  volatile uint16_t I2C_FS_SCL_LCNT_REGF;
  uint16_t RESERVED7[5];
  volatile uint16_t I2C_INTR_STAT_REGF;
  uint16_t RESERVED8;
  volatile uint16_t I2C_INTR_MASK_REGF;
  uint16_t RESERVED9;
  volatile uint16_t I2C_RAW_INTR_STAT_REGF;
  uint16_t RESERVED10;
  volatile uint16_t I2C_RX_TL_REGF;
  uint16_t RESERVED11;
  volatile uint16_t I2C_TX_TL_REGF;
  uint16_t RESERVED12;
  volatile uint16_t I2C_CLR_INTR_REGF;
  uint16_t RESERVED13;
  volatile uint16_t I2C_CLR_RX_UNDER_REGF;
  uint16_t RESERVED14;
  volatile uint16_t I2C_CLR_RX_OVER_REGF;
  uint16_t RESERVED15;
  volatile uint16_t I2C_CLR_TX_OVER_REGF;
  uint16_t RESERVED16;
  volatile uint16_t I2C_CLR_RD_REQ_REGF;
  uint16_t RESERVED17;
  volatile uint16_t I2C_CLR_TX_ABRT_REGF;
  uint16_t RESERVED18;
  volatile uint16_t I2C_CLR_RX_DONE_REGF;
  uint16_t RESERVED19;
  volatile uint16_t I2C_CLR_ACTIVITY_REGF;
  uint16_t RESERVED20;
  volatile uint16_t I2C_CLR_STOP_DET_REGF;
  uint16_t RESERVED21;
  volatile uint16_t I2C_CLR_START_DET_REGF;
  uint16_t RESERVED22;
  volatile uint16_t I2C_CLR_GEN_CALL_REGF;
  uint16_t RESERVED23;
  volatile uint16_t I2C_ENABLE_REGF;
  uint16_t RESERVED24;
  volatile uint16_t I2C_STATUS_REGF;
  uint16_t RESERVED25;
  volatile uint16_t I2C_TXFLR_REGF;
  uint16_t RESERVED26;
  volatile uint16_t I2C_RXFLR_REGF;
  uint16_t RESERVED27;
  volatile uint16_t I2C_SDA_HOLD_REGF;
  uint16_t RESERVED28;
  volatile uint16_t I2C_TX_ABRT_SOURCE_REGF;
  uint16_t RESERVED29[3];
  volatile uint16_t I2C_DMA_CR_REGF;
  uint16_t RESERVED30;
  volatile uint16_t I2C_DMA_TDLR_REGF;
  uint16_t RESERVED31;
  volatile uint16_t I2C_DMA_RDLR_REGF;
  uint16_t RESERVED32;
  volatile uint16_t I2C_SDA_SETUP_REGF;
  uint16_t RESERVED33;
  volatile uint16_t I2C_ACK_GENERAL_CALL_REGF;
  uint16_t RESERVED34;
  volatile uint16_t I2C_ENABLE_STATUS_REGF;
  uint16_t RESERVED35;
  volatile uint16_t I2C_IC_FS_SPKLEN_REGF;
  uint16_t RESERVED36[41];
  volatile uint16_t I2C_COMP_PARAM1_REGF;
  volatile uint16_t I2C_COMP_PARAM2_REGF;
  volatile uint16_t I2C_COMP_VERSION_REGF;
  volatile uint16_t I2C_COMP2_VERSIONF;
  volatile uint16_t I2C_COMP_TYPE_REGF;
  volatile uint16_t I2C_COMP_TYPE2_REGF;
};

/* 1172 */
enum i2c_clock_t : __int8
{
  I2C_CLOCK_DISABLE = 0x0,
  I2C_CLOCK_ENABLE = 0x1,
};

/* 1173 */
enum i2c_controller_t : __int8
{
  I2C_CONTROLLER_DISABLE = 0x0,
  I2C_CONTROLLER_ENABLE = 0x1,
};

/* 1174 */
enum i2c_mode_t : __int8
{
  I2C_MODE_SLAVE = 0x0,
  I2C_MODE_MASTER = 0x1,
};

/* 1175 */
enum i2c_restart_t : __int8
{
  I2C_RESTART_DISABLE = 0x0,
  I2C_RESTART_ENABLE = 0x1,
};

/* 1176 */
enum i2c_addressing_t : __int8
{
  I2C_ADDRESSING_7B = 0x0,
  I2C_ADDRESSING_10B = 0x1,
};

/* 1177 */
enum i2c_speed_t : __int8
{
  I2C_SPEED_STANDARD = 0x1,
  I2C_SPEED_FAST = 0x0,
};

/* 1178 */
enum i2c_abort_t : __int16
{
  I2C_ABORT_NONE = 0x0,
  I2C_ABORT_7B_ADDR_NO_ACK = 0x1,
  I2C_ABORT_10B_ADDR1_NO_ACK = 0x2,
  I2C_ABORT_10B_ADDR2_NO_ACK = 0x4,
  I2C_ABORT_TX_DATA_NO_ACK = 0x8,
  I2C_ABORT_GENERAL_CALL_NO_ACK = 0x10,
  I2C_ABORT_GENERAL_CALL_READ = 0x20,
  I2C_ABORT_HS_ACKDET = 0x40,
  I2C_ABORT_SBYTE_ACKDET = 0x80,
  I2C_ABORT_HS_NORSTRT = 0x100,
  I2C_ABORT_10B_READ_NO_RESTART = 0x400,
  I2C_ABORT_MASTER_DISABLED = 0x800,
  I2C_ABORT_ARBITRATION_LOST = 0x1000,
  I2C_ABORT_SLAVE_FLUSH_TX_FIFO = 0x2000,
  I2C_ABORT_SLAVE_ARBITRATION_LOST = 0x4000,
  I2C_ABORT_SLAVE_IN_TX = 0x8000,
  I2C_ABORT_SW_ERROR = 0x8001,
};

/* 1179 */
typedef void (*i2c_interrupt_cb_t)(uint16_t);

/* 1180 */
typedef void (*i2c_complete_cb_t)(void *, uint16_t, bool);

