hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1181 */
struct $EC076EA72A7F68F89B44F8E63CD8D392
{
  uint16_t ss_hcnt;
  uint16_t ss_lcnt;
  uint16_t fs_hcnt;
  uint16_t fs_lcnt;
};

/* 1182 */
struct i2c_cfg_t
{
  $EC076EA72A7F68F89B44F8E63CD8D392 clock_cfg;
  i2c_restart_t restart_en;
  i2c_speed_t speed;
  i2c_mode_t mode;
  i2c_addressing_t addr_mode;
  uint16_t address;
  uint8_t tx_fifo_level;
  uint8_t rx_fifo_level;
};

/* 1183 */
enum $F1CDEA35E468E13FE9619D2B3F26E9AF : __int8
{
  I2C_F_NONE = 0x0,
  I2C_F_WAIT_FOR_STOP = 0x1,
  I2C_F_ADD_STOP = 0x2,
};

/* 1184 */
enum $1C54ECF45D4BD2F0F8454918EF136624 : __int16
{
  I2C_INT_RX_UNDERFLOW = 0x1,
  I2C_INT_RX_OVERFLOW = 0x2,
  I2C_INT_RX_FULL = 0x4,
  I2C_INT_TX_OVERFLOW = 0x8,
  I2C_INT_TX_EMPTY = 0x10,
  I2C_INT_READ_REQUEST = 0x20,
  I2C_INT_TX_ABORT = 0x40,
  I2C_INT_RX_DONE = 0x80,
  I2C_INT_ACTIVITY = 0x100,
  I2C_INT_STOP_DETECTED = 0x200,
  I2C_INT_START_DETECTED = 0x400,
  I2C_INT_GENERAL_CALL = 0x800,
};

/* 1185 */
enum PWM_MODE_t : __int8
{
  PWM_MODE_ONE = 0x0,
  PWM_MODE_CLOCK_DIV_BY_TWO = 0x1,
};

/* 1186 */
enum TIM0_CLK_DIV_t : __int8
{
  TIM0_CLK_DIV_BY_10 = 0x0,
  TIM0_CLK_NO_DIV = 0x1,
};

/* 1187 */
enum TIM0_CLK_SEL_t : __int8
{
  TIM0_CLK_32K = 0x0,
  TIM0_CLK_FAST = 0x1,
};

/* 1188 */
enum TIM0_CTRL_t : __int8
{
  TIM0_CTRL_OFF_RESET = 0x0,
  TIM0_CTRL_RUNNING = 0x1,
};

/* 1189 */
typedef void timer0_handler_function_t(void);

/* 1190 */
enum hw_otpc_mode_t : __int8
{
  HW_OTPC_MODE_DSTBY = 0x0,
  HW_OTPC_MODE_STBY = 0x1,
  HW_OTPC_MODE_READ = 0x2,
  HW_OTPC_MODE_PROG = 0x3,
  HW_OTPC_MODE_PVFY = 0x4,
  HW_OTPC_MODE_RINI = 0x5,
  HW_OTPC_MODE_AREAD = 0x6,
};

/* 1191 */
enum hw_otpc_word_t : __int8
{
  HW_OTPC_WORD_LOW = 0x0,
  HW_OTPC_WORD_HIGH = 0x1,
};

/* 1192 */
enum hw_otpc_clk_freq_t : __int8
{
  HW_OTPC_CLK_FREQ_2MHz = 0x0,
  HW_OTPC_CLK_FREQ_4MHz = 0x1,
  HW_OTPC_CLK_FREQ_8MHz = 0x2,
  HW_OTPC_CLK_FREQ_16MHz = 0x3,
};

/* 1193 */
enum syscntl_dcdc_level_t : __int8
{
  SYSCNTL_DCDC_LEVEL_1V025 = 0x0,
  SYSCNTL_DCDC_LEVEL_1V05 = 0x1,
  SYSCNTL_DCDC_LEVEL_1V075 = 0x2,
  SYSCNTL_DCDC_LEVEL_1V1 = 0x3,
  SYSCNTL_DCDC_LEVEL_1V125 = 0x4,
  SYSCNTL_DCDC_LEVEL_1V150 = 0x5,
  SYSCNTL_DCDC_LEVEL_1V175 = 0x6,
  SYSCNTL_DCDC_LEVEL_1V2 = 0x7,
  SYSCNTL_DCDC_LEVEL_1V725 = 0x8,
  SYSCNTL_DCDC_LEVEL_1V75 = 0x9,
  SYSCNTL_DCDC_LEVEL_1V775 = 0xA,
  SYSCNTL_DCDC_LEVEL_1V8 = 0xB,
  SYSCNTL_DCDC_LEVEL_1V825 = 0xC,
  SYSCNTL_DCDC_LEVEL_1V850 = 0xD,
  SYSCNTL_DCDC_LEVEL_1V875 = 0xE,
  SYSCNTL_DCDC_LEVEL_1V9 = 0xF,
  SYSCNTL_DCDC_LEVEL_2V425 = 0x10,
  SYSCNTL_DCDC_LEVEL_2V45 = 0x11,
  SYSCNTL_DCDC_LEVEL_2V475 = 0x12,
  SYSCNTL_DCDC_LEVEL_2V5 = 0x13,
  SYSCNTL_DCDC_LEVEL_2V525 = 0x14,
  SYSCNTL_DCDC_LEVEL_2V550 = 0x15,
  SYSCNTL_DCDC_LEVEL_2V575 = 0x16,
  SYSCNTL_DCDC_LEVEL_2V6 = 0x17,
  SYSCNTL_DCDC_LEVEL_2V925 = 0x18,
  SYSCNTL_DCDC_LEVEL_2V95 = 0x19,
  SYSCNTL_DCDC_LEVEL_2V975 = 0x1A,
  SYSCNTL_DCDC_LEVEL_3V0 = 0x1B,
  SYSCNTL_DCDC_LEVEL_3V025 = 0x1C,
  SYSCNTL_DCDC_LEVEL_3V050 = 0x1D,
  SYSCNTL_DCDC_LEVEL_3V075 = 0x1E,
  SYSCNTL_DCDC_LEVEL_3V1 = 0x1F,
};

/* 1194 */
struct syscntl_dcdc_state_t
{
  syscntl_dcdc_level_t level;
  bool status;
};

/* 1195 */
enum xtal32m_amp_reg_t : __int8
{
  XTAL32M_AMP_REG_NORMAL = 0x0,
  XTAL32M_AMP_REG_TRACKING = 0x1,
  XTAL32M_AMP_REG_HOLD = 0x2,
};

/* 1196 */
enum por_vbat_mask_t : __int8
{
  POR_VBAT_MASK_OFF = 0x0,
  POR_VBAT_MASK_ON = 0x1,
};

/* 1197 */
enum $94A965D1309505F9B45E80FE0660B0EA : __int8
{
  SYSCNTL_DCDC_NOMINAL_LEVEL_1V1 = 0x0,
  SYSCNTL_DCDC_NOMINAL_LEVEL_1V8 = 0x1,
  SYSCNTL_DCDC_NOMINAL_LEVEL_2V5 = 0x2,
  SYSCNTL_DCDC_NOMINAL_LEVEL_3V0 = 0x3,
};

/* 1198 */
enum $0BE8C8E7CA73A089342EE2E7E8020136 : __int8
{
  SYSCNTL_DCDC_TRIM_N_75mV = 0x0,
  SYSCNTL_DCDC_TRIM_N_50mV = 0x1,
  SYSCNTL_DCDC_TRIM_N_25mV = 0x2,
  SYSCNTL_DCDC_TRIM_0mV = 0x3,
  SYSCNTL_DCDC_TRIM_P_25mV = 0x4,
  SYSCNTL_DCDC_TRIM_P_50mV = 0x5,
  SYSCNTL_DCDC_TRIM_P_75mV = 0x6,
  SYSCNTL_DCDC_TRIM_P_100mV = 0x7,
};

/* 1199 */
struct uart_t
{
  volatile uint16_t UART_RBR_THR_DLL_REGF;
  uint16_t RESERVED;
  volatile uint16_t UART_IER_DLH_REGF;
  uint16_t RESERVED1;
  volatile uint16_t UART_IIR_FCR_REGF;
  uint16_t RESERVED2;
  volatile uint16_t UART_LCR_REGF;
  uint16_t RESERVED3;
  volatile uint16_t UART_MCR_REGF;
  uint16_t RESERVED4;
  volatile uint16_t UART_LSR_REGF;
  uint16_t RESERVED5;
  volatile uint16_t UART_MSR_REGF;
  uint16_t RESERVED6;
  volatile uint16_t UART_SCR_REGF;
  uint16_t RESERVED7[9];
  volatile uint16_t UART_SRBR_STHR0_REGF;
  uint16_t RESERVED8;
  volatile uint16_t UART_SRBR_STHR1_REGF;
  uint16_t RESERVED9;
  volatile uint16_t UART_SRBR_STHR2_REGF;
  uint16_t RESERVED10;
  volatile uint16_t UART_SRBR_STHR3_REGF;
  uint16_t RESERVED11;
  volatile uint16_t UART_SRBR_STHR4_REGF;
  uint16_t RESERVED12;
  volatile uint16_t UART_SRBR_STHR5_REGF;
  uint16_t RESERVED13;
  volatile uint16_t UART_SRBR_STHR6_REGF;
  uint16_t RESERVED14;
  volatile uint16_t UART_SRBR_STHR7_REGF;
  uint16_t RESERVED15;
  volatile uint16_t UART_SRBR_STHR8_REGF;
  uint16_t RESERVED16;
  volatile uint16_t UART_SRBR_STHR9_REGF;
  uint16_t RESERVED17;
  volatile uint16_t UART_SRBR_STHR10_REGF;
  uint16_t RESERVED18;
  volatile uint16_t UART_SRBR_STHR11_REGF;
  uint16_t RESERVED19;
  volatile uint16_t UART_SRBR_STHR12_REGF;
  uint16_t RESERVED20;
  volatile uint16_t UART_SRBR_STHR13_REGF;
  uint16_t RESERVED21;
  volatile uint16_t UART_SRBR_STHR14_REGF;
  uint16_t RESERVED22;
  volatile uint16_t UART_SRBR_STHR15_REGF;
  uint16_t RESERVED23;
  volatile uint16_t UART_FAR_REGF;
  uint16_t RESERVED24[5];
  volatile uint16_t UART_USR_REGF;
  uint16_t RESERVED25;
  volatile uint16_t UART_TFL_REGF;
  uint16_t RESERVED26;
  volatile uint16_t UART_RFL_REGF;
  uint16_t RESERVED27;
  volatile uint16_t UART_SRR_REGF;
  uint16_t RESERVED28;
  volatile uint16_t UART_SRTS_REGF;
  uint16_t RESERVED29;
  volatile uint16_t UART_SBCR_REGF;
  uint16_t RESERVED30;
  volatile uint16_t UART_SDMAM_REGF;
  uint16_t RESERVED31;
  volatile uint16_t UART_SFE_REGF;
  uint16_t RESERVED32;
  volatile uint16_t UART_SRT_REGF;
  uint16_t RESERVED33;
  volatile uint16_t UART_STET_REGF;
  uint16_t RESERVED34;
  volatile uint16_t UART_HTX_REGF;
  uint16_t RESERVED35;
  volatile uint16_t UART_DMASA_REGF;
  uint16_t RESERVED36[11];
  volatile uint16_t UART_DLF_REGF;
  uint16_t RESERVED37[27];
  volatile uint16_t UART_UCV_REGF;
  volatile uint16_t UART_UCV_HIGH_REGF;
  volatile uint16_t UART_CTR_REGF;
  volatile uint16_t UART_CTR_HIGH_REGF;
};

/* 1200 */
enum UART_BIT_CFG : __int8
{
  UART_BIT_DIS = 0x0,
  UART_BIT_EN = 0x1,
};

/* 1201 */
enum UART_STATUS : __int8
{
  UART_ERR_NO_ERROR = 0x0,
  UART_ERR_BUSY_ERROR = 0x1,
  UART_ERR_OVERRUN_ERROR = 0x2,
  UART_ERR_PARITY_ERROR = 0x4,
  UART_ERR_FRAMING_ERROR = 0x8,
  UART_ERR_BREAK_ERROR = 0x10,
  UART_ERR_RX_FIFO_ERROR = 0x80,
};

/* 1202 */
enum UART_INT : __int8
{
  UART_INT_NO_INT_PEND = 0x1,
  UART_INT_THR_EMPTY = 0x2,
  UART_INT_RECEIVED_AVAILABLE = 0x4,
  UART_INT_RECEIVE_LINE_STAT = 0x6,
  UART_INT_BUSY_DETECTED = 0x7,
  UART_INT_TIMEOUT = 0xC,
};

