hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1203 */
enum UART_BAUDRATE : __int32
{
  UART_BAUDRATE_1000000 = 0x100,
  UART_BAUDRATE_921600 = 0x101,
  UART_BAUDRATE_500000 = 0x200,
  UART_BAUDRATE_460800 = 0x203,
  UART_BAUDRATE_230400 = 0x405,
  UART_BAUDRATE_115200 = 0x80B,
  UART_BAUDRATE_57600 = 0x1106,
  UART_BAUDRATE_38400 = 0x1A01,
  UART_BAUDRATE_28800 = 0x220C,
  UART_BAUDRATE_19200 = 0x3401,
  UART_BAUDRATE_14400 = 0x4507,
  UART_BAUDRATE_9600 = 0x6803,
  UART_BAUDRATE_4800 = 0xD005,
  UART_BAUDRATE_2400 = 0x1A00B,
};

/* 1204 */
enum UART_DATABITS : __int8
{
  UART_DATABITS_5 = 0x0,
  UART_DATABITS_6 = 0x1,
  UART_DATABITS_7 = 0x2,
  UART_DATABITS_8 = 0x3,
};

/* 1205 */
enum UART_PARITY : __int8
{
  UART_PARITY_NONE = 0x0,
  UART_PARITY_ODD = 0x1,
  UART_PARITY_EVEN = 0x3,
};

/* 1206 */
enum UART_STOPBITS : __int8
{
  UART_STOPBITS_1 = 0x0,
  UART_STOPBITS_2 = 0x1,
};

/* 1207 */
enum UART_AFCE_CFG : __int8
{
  UART_AFCE_DIS = 0x0,
  UART_AFCE_EN = 0x1,
};

/* 1208 */
enum UART_FIFO_CFG : __int8
{
  UART_FIFO_DIS = 0x0,
  UART_FIFO_EN = 0x1,
};

/* 1209 */
enum UART_RX_FIFO_LEVEL : __int8
{
  UART_RX_FIFO_LEVEL_0 = 0x0,
  UART_RX_FIFO_LEVEL_1 = 0x1,
  UART_RX_FIFO_LEVEL_2 = 0x2,
  UART_RX_FIFO_LEVEL_3 = 0x3,
};

/* 1210 */
enum UART_TX_FIFO_LEVEL : __int8
{
  UART_TX_FIFO_LEVEL_0 = 0x0,
  UART_TX_FIFO_LEVEL_1 = 0x1,
  UART_TX_FIFO_LEVEL_2 = 0x2,
  UART_TX_FIFO_LEVEL_3 = 0x3,
};

/* 1211 */
enum UART_OP_CFG : __int8
{
  UART_OP_BLOCKING = 0x0,
  UART_OP_INTR = 0x1,
};

/* 1212 */
typedef void (*uart_cb_t)(uint16_t);

/* 1213 */
typedef void (*uart_err_cb_t)(uart_t *, uint8_t);

/* 1214 */
struct uart_cfg_t
{
  __int32 baud_rate : 24;
  __int8 data_bits : 3;
  __int8 parity : 2;
  __int8 stop_bits : 1;
  __int8 auto_flow_control : 1;
  __int8 use_fifo : 1;
  __int8 tx_fifo_tr_lvl : 2;
  __int8 rx_fifo_tr_lvl : 2;
  uint32_t intr_priority;
  uart_err_cb_t uart_err_cb;
  uart_cb_t uart_tx_cb;
  uart_cb_t uart_rx_cb;
};

/* 1215 */
struct otp_cs_addr_value_t
{
  uint32_t addr;
  uint32_t val;
};

/* 1216 */
struct otp_cs_trim_value_t
{
  uint32_t lp_clk_set[1];
  int16_t gp_adc_single_ge;
  int16_t gp_adc_single_offset;
  int16_t gp_adc_diff_ge;
  int16_t gp_adc_diff_offset;
  uint16_t gp_adc_trim_reg;
  int16_t gp_adc_offsh_ge;
  int16_t gp_adc_offsh_offset;
  uint16_t adc_25_cal;
  uint16_t xtal_wait_trim;
  uint16_t xtal_trim_value;
};

/* 1217 */
struct __attribute__((aligned(4))) otp_cs_t
{
  otp_cs_addr_value_t pd_rad[2];
  otp_cs_addr_value_t pd_adpll[6];
  otp_cs_trim_value_t trim_values;
  uint8_t pd_rad_pairs;
  uint8_t pd_adpll_pairs;
};

/* 1218 */
struct otp_cs_booter_val_t
{
  uint16_t dbg_cfg;
  uint16_t bandgap_reg;
  uint16_t clk_rc32m_reg;
  uint16_t clk_rc32k_reg;
};

/* 1219 */
struct $7011C88ECC5BE84F30945B4766F6B9E2
{
  unsigned __int32 _reserved0 : 28;
  unsigned __int32 V : 1;
  unsigned __int32 C : 1;
  unsigned __int32 Z : 1;
  unsigned __int32 N : 1;
};

/* 1220 */
union APSR_Type
{
  $7011C88ECC5BE84F30945B4766F6B9E2 b;
  uint32_t w;
};

/* 1221 */
struct $1A3F4086B4B259A3A84849011510F78C
{
  unsigned __int32 ISR : 9;
  unsigned __int32 _reserved0 : 23;
};

/* 1222 */
union IPSR_Type
{
  $1A3F4086B4B259A3A84849011510F78C b;
  uint32_t w;
};

/* 1223 */
struct $404C6C53D680280832D08EA4B605F0B9
{
  unsigned __int32 ISR : 9;
  unsigned __int32 _reserved0 : 15;
  unsigned __int32 T : 1;
  unsigned __int32 _reserved1 : 3;
  unsigned __int32 V : 1;
  unsigned __int32 C : 1;
  unsigned __int32 Z : 1;
  unsigned __int32 N : 1;
};

/* 1224 */
union xPSR_Type
{
  $404C6C53D680280832D08EA4B605F0B9 b;
  uint32_t w;
};

/* 1225 */
struct $EA1059961599FCFC2BF0AB253B342E0B
{
  unsigned __int32 nPRIV : 1;
  unsigned __int32 SPSEL : 1;
  unsigned __int32 _reserved1 : 30;
};

/* 1226 */
union CONTROL_Type
{
  $EA1059961599FCFC2BF0AB253B342E0B b;
  uint32_t w;
};

/* 1227 */
struct NVIC_Type
{
  volatile uint32_t ISER[1];
  uint32_t RESERVED0[31];
  volatile uint32_t ICER[1];
  uint32_t RESERVED1[31];
  volatile uint32_t ISPR[1];
  uint32_t RESERVED2[31];
  volatile uint32_t ICPR[1];
  uint32_t RESERVED3[31];
  uint32_t RESERVED4[64];
  volatile uint32_t IP[8];
};

/* 1228 */
struct SCB_Type
{
  const volatile uint32_t CPUID;
  volatile uint32_t ICSR;
  uint32_t RESERVED0;
  volatile uint32_t AIRCR;
  volatile uint32_t SCR;
  volatile uint32_t CCR;
  uint32_t RESERVED1;
  volatile uint32_t SHP[2];
  volatile uint32_t SHCSR;
};

/* 1229 */
struct SysTick_Type
{
  volatile uint32_t CTRL;
  volatile uint32_t LOAD;
  volatile uint32_t VAL;
  const volatile uint32_t CALIB;
};

/* 1230 */
enum tim0_2_clk_div_t : __int8
{
  TIM0_2_CLK_DIV_1 = 0x0,
  TIM0_2_CLK_DIV_2 = 0x1,
  TIM0_2_CLK_DIV_4 = 0x2,
  TIM0_2_CLK_DIV_8 = 0x3,
};

/* 1231 */
enum tim0_2_clk_t : __int8
{
  TIM0_2_CLK_OFF = 0x0,
  TIM0_2_CLK_ON = 0x1,
};

/* 1232 */
struct tim0_2_clk_div_config_t
{
  tim0_2_clk_div_t clk_div;
};

/* 1233 */
enum $8E368D0586093EF6620FAFDDF92E6568 : __int8
{
  UART_CHARFORMAT_5 = 0x0,
  UART_CHARFORMAT_6 = 0x1,
  UART_CHARFORMAT_7 = 0x2,
  UART_CHARFORMAT_8 = 0x3,
};

/* 1234 */
struct __uart_sel_pins_t
{
  uint8_t uart_port_tx;
  uint8_t uart_tx_pin;
  uint8_t uart_port_rx;
  uint8_t uart_rx_pin;
};

/* 1235 */
typedef __uart_sel_pins_t _uart_sel_pins_t;

/* 1236 */
enum __reset_options : __int8
{
  ENABLE_HW_RESET = 0x0,
  ENABLE_POR_RESET = 0x1,
  DISABLE_RESET = 0x2,
  RESET_MAX_VAL = 0x3,
};

/* 1237 */
typedef __reset_options _reset_options;

/* 1238 */
enum $450A3D078ECB3EFF4DF30D2286429D26 : __int8
{
  P0_0_AND_P0_1_INITIALIZED_FROM_EXT_TOOL = 0x0,
  P0_2_AND_P0_3_INITIALIZED_FROM_EXT_TOOL = 0x2,
  P0_3_SINGLE_W_INITIALIZED_FROM_EXT_TOOL = 0x3,
  P0_4_AND_P0_5_INITIALIZED_FROM_EXT_TOOL = 0x4,
  P0_5_SINGLE_W_INITIALIZED_FROM_EXT_TOOL = 0x5,
  P0_6_AND_P0_7_INITIALIZED_FROM_EXT_TOOL = 0x6,
};

