hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1239 */
enum __xtal_sections : __int8
{
  XTAL_SEC_MIN = 0x0,
  XTAL_SEC_MAX = 0x1,
  XTAL_SEC_ENUM_MAX_VAL = 0x2,
};

/* 1240 */
typedef __xtal_sections _xtal_sections;

/* 1241 */
struct bf_t
{
  unsigned __int32 data : 16;
  unsigned __int32 addr : 14;
  unsigned __int32 data8or16n : 1;
  unsigned __int32 valid : 1;
};

/* 1242 */
union t_arp_reg
{
  uint32_t value;
  bf_t bf;
};

/* 1243 */
struct s_arp_table
{
  t_arp_reg arpt_pwr[1];
  uint32_t null1;
  uint16_t tx_tbase;
  uint16_t rx_tbase;
  t_arp_reg arpt_pref[9];
  uint32_t null2;
  t_arp_reg tx_en_delay;
  t_arp_reg arpt_tx[7];
  uint32_t null3;
  t_arp_reg rx_en_delay;
  t_arp_reg arpt_rx[8];
  uint32_t null4;
};

/* 1245 */
struct $31FDB377CBA239063A684C1E4A50254F
{
  unsigned __int32 data : 16;
  unsigned __int32 addr : 14;
  unsigned __int32 data8or16n : 1;
  unsigned __int32 valid : 1;
};

/* 1244 */
union t_arp_reg_0
{
  uint32_t value;
  $31FDB377CBA239063A684C1E4A50254F bf;
};

/* 1246 */
struct s_arp_table_0
{
  t_arp_reg_0 arpt_pwr[1];
  uint32_t null1;
  uint16_t tx_tbase;
  uint16_t rx_tbase;
  t_arp_reg_0 arpt_pref[14];
  uint32_t null2;
  t_arp_reg_0 tx_en_delay;
  t_arp_reg_0 arpt_tx[3];
  uint32_t null3;
  t_arp_reg_0 rx_en_delay;
  t_arp_reg_0 arpt_rx[3];
  uint32_t null4;
};

/* 1247 */
typedef void (*systick_callback_function_t)(void);

/* 1248 */
struct __attribute__((aligned(4))) spi_env_t
{
  __int8 spi_ms : 1;
  __int8 spi_wsz : 4;
  __int8 spi_cs : 3;
  spi_cb_t send_cb;
  spi_cb_t receive_cb;
  spi_cb_t transfer_cb;
  uint8_t incr;
};

/* 1249 */
struct tx_state_t
{
  const uint8_t *data;
  uint16_t len;
  uint16_t num;
  i2c_complete_cb_t cb;
  void *cb_data;
  uint32_t flags;
};

/* 1250 */
struct rx_state_t
{
  uint8_t *data;
  uint16_t len;
  uint16_t num;
  uint16_t rr;
  i2c_complete_cb_t cb;
  void *cb_data;
  uint32_t flags;
};

/* 1251 */
struct i2c_env_tag_t
{
  tx_state_t tx_state;
  rx_state_t rx_state;
  i2c_interrupt_cb_t intr_cb;
};

/* 1252 */
struct __attribute__((aligned(4))) uart_env_t
{
  const uint8_t *tx_buffer;
  uint16_t tx_total_length;
  uint16_t tx_index;
  uint8_t *rx_buffer;
  uint16_t rx_total_length;
  uint16_t rx_index;
  uart_err_cb_t err_cb;
  uart_cb_t tx_cb;
  uart_cb_t rx_cb;
  uint8_t intr_priority;
  UART_RX_FIFO_LEVEL rx_fifo_tr_lvl;
  bool one_wire_enabled;
  GPIO_PORT one_wire_port;
  GPIO_PIN one_wire_pin;
};

/* 1253 */
enum $B202F2CDB420F47DCAF6ACFD3FC9D62D : __int8
{
  WKUPCT_PIN_POLARITY_HIGH = 0x0,
  WKUPCT_PIN_POLARITY_LOW = 0x1,
};

/* 1254 */
enum wkupct_quadec_error_t : __int8
{
  WKUPCT_QUADEC_ERR_RESERVED = 0xFF,
  WKUPCT_QUADEC_ERR_OK = 0x0,
};

/* 1255 */
typedef void (*wakeup_handler_function_t)(void);

/* 1256 */
typedef void (*quad_encoder_handler_function_t)(int16_t, int16_t, int16_t);

/* 1257 */
enum CHX_PORT_SEL_t : __int8
{
  QUAD_DEC_CHXA_NONE_AND_CHXB_NONE = 0x0,
  QUAD_DEC_CHXA_P02_AND_CHXB_P05 = 0x1,
  QUAD_DEC_CHXA_P01_AND_CHXB_P04 = 0x2,
  QUAD_DEC_CHXA_P03_AND_CHXB_P10 = 0x3,
  QUAD_DEC_CHXA_P06_AND_CHXB_P07 = 0x4,
  QUAD_DEC_CHXA_P08_AND_CHXB_P09 = 0x5,
  QUAD_DEC_CHXA_P00_AND_CHXB_P11 = 0x6,
};

/* 1258 */
enum CHX_EVENT_MODE_t : __int16
{
  QUAD_DEC_CHX_NORMAL_COUNTING = 0x0,
  QUAD_DEC_CHX_EDGE_COUNTING = 0x200,
};

/* 1259 */
enum CHY_PORT_SEL_t : __int8
{
  QUAD_DEC_CHYA_NONE_AND_CHYB_NONE = 0x0,
  QUAD_DEC_CHYA_P02_AND_CHYB_P05 = 0x8,
  QUAD_DEC_CHYA_P01_AND_CHYB_P04 = 0x10,
  QUAD_DEC_CHYA_P03_AND_CHYB_P10 = 0x18,
  QUAD_DEC_CHYA_P06_AND_CHYB_P07 = 0x20,
  QUAD_DEC_CHYA_P08_AND_CHYB_P09 = 0x28,
  QUAD_DEC_CHYA_P00_AND_CHYB_P11 = 0x30,
};

/* 1260 */
enum CHY_EVENT_MODE_t : __int16
{
  QUAD_DEC_CHY_NORMAL_COUNTING = 0x0,
  QUAD_DEC_CHY_EDGE_COUNTING = 0x400,
};

/* 1261 */
enum CHZ_PORT_SEL_t : __int16
{
  QUAD_DEC_CHZA_NONE_AND_CHZB_NONE = 0x0,
  QUAD_DEC_CHZA_P02_AND_CHZB_P05 = 0x40,
  QUAD_DEC_CHZA_P01_AND_CHZB_P04 = 0x80,
  QUAD_DEC_CHZA_P03_AND_CHZB_P10 = 0xC0,
  QUAD_DEC_CHZA_P06_AND_CHZB_P07 = 0x100,
  QUAD_DEC_CHZA_P08_AND_CHZB_P09 = 0x140,
  QUAD_DEC_CHZA_P00_AND_CHZB_P11 = 0x180,
};

/* 1262 */
enum CHZ_EVENT_MODE_t : __int16
{
  QUAD_DEC_CHZ_NORMAL_COUNTING = 0x0,
  QUAD_DEC_CHZ_EDGE_COUNTING = 0x800,
};

/* 1263 */
struct __attribute__((aligned(2))) QUAD_DEC_INIT_PARAMS_t
{
  CHX_EVENT_MODE_t chx_event_mode;
  CHY_EVENT_MODE_t chy_event_mode;
  CHZ_EVENT_MODE_t chz_event_mode;
  CHX_PORT_SEL_t chx_port_sel;
  CHY_PORT_SEL_t chy_port_sel;
  CHZ_PORT_SEL_t chz_port_sel;
  uint16_t qdec_clockdiv;
  uint8_t qdec_events_count_to_trigger_interrupt;
};

/* 1264 */
struct lld_sleep_init_func::lld_sleep_env_tag
{
  uint32_t irq_mask;
};

/* 1265 */
struct lld_data_ind;

/* 1266 */
struct rf_reinit_func::LUT_CFG_struct
{
  int8_t HW_LUT_MODE;
  int8_t RX_HSI_ENABLED;
  int8_t PA_PULLING_OFFSET;
  int8_t NR_CCUPD_1ST;
  int8_t NR_CCUPD_REST;
  int8_t NR_CCUPD_OL;
  int8_t BLE_BAND_MARGIN;
  int8_t EST_HALF_OVERLAP;
  int8_t REQUIRED_CHAN_OVERLAP;
  uint8_t PLL_LOCK_VTUNE_NUMAVGPOW;
  int16_t PLL_LOCK_VTUNE_LIMIT_LO;
  int16_t PLL_LOCK_VTUNE_LIMIT_HI;
  int16_t PLL_LOCK_VTUNE_P2PVAR;
  int16_t PLL_LOCK_TIMING;
  uint16_t VCO_CALCNT_STARTVAL;
  uint16_t VCO_CALCNT_TIMEOUT;
};

/* 1267 */
union __attribute__((aligned(8))) __n64
{
  unsigned __int64 n64_u64[1];
  unsigned __int32 n64_u32[2];
  unsigned __int16 n64_u16[4];
  unsigned __int8 n64_u8[8];
  __int64 n64_i64[1];
  __int32 n64_i32[2];
  __int16 n64_i16[4];
  __int8 n64_i8[8];
  float n64_f32[2];
  double n64_f64[1];
};

/* 1268 */
union __attribute__((aligned(8))) __n128
{
  unsigned __int64 n128_u64[2];
  unsigned __int32 n128_u32[4];
  unsigned __int16 n128_u16[8];
  unsigned __int8 n128_u8[16];
  __int64 n128_i64[2];
  __int32 n128_i32[4];
  __int16 n128_i16[8];
  __int8 n128_i8[16];
  float n128_f32[4];
  double n128_f64[2];
};

