hac425xxx/BLE-DA145XX/da14531_ida_prod_test_531.axf.h
/* 1269 */
typedef __n64 int8x8_t;

/* 1270 */
typedef __n64 uint8x8_t;

/* 1271 */
typedef __n64 int16x4_t;

/* 1272 */
typedef __n64 int32x2_t;

/* 1273 */
typedef __n64 uint16x4_t;

/* 1274 */
typedef __n64 uint32x2_t;

/* 1275 */
typedef __n128 int8x16_t;

/* 1276 */
typedef __n128 int16x8_t;

/* 1277 */
typedef __n128 int32x4_t;

/* 1278 */
typedef __n128 int64x2_t;

/* 1279 */
typedef __n128 uint8x16_t;

/* 1280 */
typedef __n128 uint16x8_t;

/* 1281 */
typedef __n128 uint32x4_t;

/* 1282 */
typedef __n128 uint64x2_t;

/* 1283 */
typedef __n64 poly8x8_t;

/* 1284 */
typedef __n64 poly16x4_t;

/* 1285 */
typedef __n128 poly16x8_t;

/* 1286 */
typedef __n128 poly8x16_t;

/* 1287 */
typedef __n64 float32x2_t;

/* 1288 */
typedef __n128 float32x4_t;

/* 1289 */
typedef __n128 float64x2_t;

/* 1290 */
typedef __n128 poly128_t;

/* 1291 */
typedef int (__fastcall *dummy_func)(char *);

/* 1292 */
struct rom_func_addr_table_struct
{
  dummy_func rf_init_func;
  dummy_func rf_reinit_func;
  dummy_func uart_init_func;
  dummy_func uart_flow_on_func;
  dummy_func uart_flow_off_func;
  dummy_func uart_finish_transfers_func;
  dummy_func uart_read_func;
  dummy_func one_wire_uart_write_func;
  dummy_func UART_Handler_func;
  dummy_func gtl_init_func;
  dummy_func gtl_eif_init_func;
  dummy_func gtl_eif_read_start_func;
  dummy_func gtl_eif_read_hdr_func;
  dummy_func gtl_eif_read_payl_func;
  dummy_func one_wire_uart_gtl_eif_tx_done_func;
  dummy_func gtl_eif_rx_done_func;
  dummy_func h4tl_init_func;
  dummy_func h4tl_read_start_func;
  dummy_func h4tl_read_hdr_func;
  dummy_func h4tl_read_payl_func;
  dummy_func h4tl_read_next_out_of_sync_func;
  dummy_func h4tl_out_of_sync_func;
  dummy_func one_wire_uart_h4tl_tx_done_func;
  dummy_func h4tl_rx_done_func;
  dummy_func ke_task_init_func;
  dummy_func ke_timer_init_func;
  dummy_func llm_encryption_done_func;
  dummy_func nvds_get_func;
  dummy_func nvds_put_func;
  dummy_func nvds_del_func;
  dummy_func nvds_init_func;
  dummy_func rwip_eif_get_func;
  dummy_func platform_reset_func;
  dummy_func lld_sleep_compensate_func;
  dummy_func lld_sleep_init_func;
  dummy_func lld_sleep_us_2_lpcycles_sel_func;
  dummy_func lld_sleep_lpcycles_2_us_sel_func;
  dummy_func lld_test_stop_func;
  dummy_func lld_test_mode_tx_func;
  dummy_func JT_lld_test_mode_rx_func;
  dummy_func smpc_check_param_func;
  dummy_func smpc_pdu_recv_func;
  dummy_func prf_init_func;
  dummy_func prf_add_profile_func;
  dummy_func prf_create_func;
  dummy_func prf_cleanup_func;
  dummy_func prf_get_id_from_task_func;
  dummy_func prf_get_task_from_id_func;
  dummy_func SetSystemVars_func;
  dummy_func dbg_init_func_empty;
  dummy_func dbg_platform_reset_complete_func_empty;
  dummy_func hci_rd_local_supp_feats_cmd_handler_func;
  dummy_func l2cc_pdu_pack_func;
  dummy_func JT_l2cc_pdu_unpack_func;
  dummy_func l2c_send_lecb_message_func;
  dummy_func l2c_process_sdu_func;
  dummy_func JT_l2cc_pdu_recv_ind_handler_func;
  dummy_func gapc_lecb_connect_cfm_handler_func;
  dummy_func atts_l2cc_pdu_recv_handler_func;
  dummy_func attc_l2cc_pdu_recv_handler_func;
  dummy_func crypto_init_func;
  dummy_func llm_le_adv_report_ind_func;
  dummy_func PK_PointMult_func;
  dummy_func llm_p256_start_func;
  dummy_func llm_create_p256_key_func;
  dummy_func llm_p256_req_handler_func;
  dummy_func llc_le_length_effective_func;
  dummy_func llc_le_length_conn_init_func;
  dummy_func lld_data_tx_prog_func;
  dummy_func lld_data_tx_check_func;
  dummy_func llc_pdu_send_func;
  dummy_func llc_data_notif_func;
  dummy_func dia_rand_func;
  dummy_func dia_srand_func;
  dummy_func ba431_get_rand_func;
  dummy_func smpc_public_key_exchange_start_func;
  dummy_func smpc_dhkey_calc_ind_func;
  dummy_func smpm_ecdh_key_create_func;
  dummy_func ble_init_arp_func;
  dummy_func unk_func_1;
  dummy_func unk_func_2;
  dummy_func unk_func_3;
  dummy_func unk_func_4;
  dummy_func unk_func_5;
  dummy_func unk_func_6;
  dummy_func unk_func_7;
  dummy_func unk_func_8;
  dummy_func unk_func_9;
  dummy_func unk_func_a;
  dummy_func unk_func_b;
  dummy_func unk_func_c;
  dummy_func unk_func_d;
  dummy_func unk_func_e;
  dummy_func unk_func_f;
  dummy_func unk_func_g;
};

